#pragma once


namespace blofeld
{
	namespace infinite
	{
#pragma pack(push, 1)

		struct s_s_anytagguts
		{
			long global_tag_id;
			char local_tag_handle[4]; // padding
		};
		static_assert(sizeof(s_s_anytagguts) == 8, "struct s_s_anytagguts is invalid size");

		struct s_anytag_struct_definition
		{
			long long vtable_space;
			s_s_anytagguts internal_struct;
		};
		static_assert(sizeof(s_anytag_struct_definition) == 16, "struct s_anytag_struct_definition is invalid size");

		struct s_s_object_meta_label
		{
			string_id meta_label;
		};
		static_assert(sizeof(s_s_object_meta_label) == 4, "struct s_s_object_meta_label is invalid size");

		struct s_ambientactioninfo
		{
			c_enum<e_i343interactiveobjectsinteractivedesire, char> desire_type;
			char generated_pad5f2a[3]; // padding
			c_enum<e_i343actionsystemactiontype, long> action;
			string_id animation_token_override;
			real time_playing_animation;
			real cooldown_time;
			string_id composition_name;
			c_typed_tag_reference<COMPOSITION_TAG> composition_definition;
			real max_distance_agents_will_consider_this_opp_from;
			c_typed_tag_block<s_s_object_meta_label> ambient_meta_labels_block;
			c_typed_tag_block<s_s_object_meta_label> exclusion_meta_labels_block;
			real min_danger_to_activate;
			real max_danger_to_activate;
			real abort_danger_level;
			real chance_per_second;
			real min_enemy_target_distance;
			real max_enemy_target_distance;
			real max_height_difference;
		};
		static_assert(sizeof(s_ambientactioninfo) == 96, "struct s_ambientactioninfo is invalid size");

		struct s_ambientactionpointdefinition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_ambientactioninfo> ambient_info_block;
			char generated_padc9b5[4]; // padding
		};
		static_assert(sizeof(s_ambientactionpointdefinition) == 32, "struct s_ambientactionpointdefinition is invalid size");

		struct s_abcarchivepointer
		{
			long long archive_read_pointer;
			c_static_string<256> name;
		};
		static_assert(sizeof(s_abcarchivepointer) == 264, "struct s_abcarchivepointer is invalid size");

		struct s_abcstat
		{
			string_id name;
			string_id value;
		};
		static_assert(sizeof(s_abcstat) == 8, "struct s_abcstat is invalid size");

		struct s_abcsourcefiletag
		{
			s_anytag_struct_definition anytag;
			s_abcarchivepointer ptr;
			c_static_string<256> dccsourcepath;
			c_typed_tag_reference<ASSET_TAG> asset;
			c_static_string<256> dcc_instance_name;
			real dcc_start_frame;
			long frame_count;
			real frames_per_second;
			c_typed_tag_block<s_abcstat> statistics_block;
			char generated_pad18e1[4]; // padding
		};
		static_assert(sizeof(s_abcsourcefiletag) == 836, "struct s_abcsourcefiletag is invalid size");

		struct s_assetentry
		{
			c_typed_tag_reference<ASSET_TAG> asset;
		};
		static_assert(sizeof(s_assetentry) == 16, "struct s_assetentry is invalid size");

		struct s_keywordqueryentry
		{
			string_id query;
		};
		static_assert(sizeof(s_keywordqueryentry) == 4, "struct s_keywordqueryentry is invalid size");

		struct s_assetcollectiontag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_assetentry> assets_block;
			c_enum<e_assetcollectionquerymode, char> querymode;
			char generated_padd9ee[3]; // padding
			c_typed_tag_block<s_keywordqueryentry> keyword_queries_block;
			char generated_pad26a3[4]; // padding
		};
		static_assert(sizeof(s_assetcollectiontag) == 48, "struct s_assetcollectiontag is invalid size");

		struct s_i343aisquadconstructionactorcellentry
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_reference<CHARACTER_TAG> character;
			c_typed_tag_reference<WEAPON_TAG> primary_weapon;
			c_typed_tag_reference<WEAPON_TAG> secondary_weapon;
			char generated_padbb57[4]; // padding
		};
		static_assert(sizeof(s_i343aisquadconstructionactorcellentry) == 68, "struct s_i343aisquadconstructionactorcellentry is invalid size");

		struct s_i343contenttagsteammatechatter
		{
			c_typed_tag_reference<DIALOGUE_TAG> chatter_dialogue;
		};
		static_assert(sizeof(s_i343contenttagsteammatechatter) == 16, "struct s_i343contenttagsteammatechatter is invalid size");

		struct s_assetdialoguetag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343contenttagsteammatechatter> teammate_male_chatter_block;
			c_typed_tag_block<s_i343contenttagsteammatechatter> teammate_female_chatter_block;
		};
		static_assert(sizeof(s_assetdialoguetag) == 40, "struct s_assetdialoguetag is invalid size");

		struct s_defaultstimulussuppressorparam
		{
			string_id stimulus;
		};
		static_assert(sizeof(s_defaultstimulussuppressorparam) == 4, "struct s_defaultstimulussuppressorparam is invalid size");

		struct s_dialoguesystemdatatagreference
		{
			c_typed_tag_reference<DIALOGUE_SYSTEM_DATA_TAG> dialogue_system_data_tag;
		};
		static_assert(sizeof(s_dialoguesystemdatatagreference) == 16, "struct s_dialoguesystemdatatagreference is invalid size");

		struct s_ai_dialogue_definitions
		{
			s_anytag_struct_definition anytag;

			/* Global timing */

			real_bounds strike_delay_bounds;
			real remind_delay;
			real post_combat_results_wait_time;
			real grapple_hook_pull_delay_time;
			real player_shoot_min_interval;
			real actor_shoot_min_interval;
			real cover_curse_chance;

			/* Player look settings */

			real player_look_max_distance;
			real player_look;
			real player_look_long_time;

			/* Spartan nearby search distance */

			real spartan_nearby_search_distance$2;

			/* Face friendly player distance */

			real face_friendly_player_distance$2;

			/* Space dialogue effect */

			string_id space_dialogue_effect$2;

			/* Speaker distance restrictions */

			real max_respond_distance;
			real max_respond_distance_in_space;

			/* Pattern selection ranges */

			real speaker_max_delta;
			real pattern_max_delta;

			/* Danger Level thresholds */

			real player_shield_damage_threshold;
			real player_body_damage_threshold;

			/* Subtitles */

			real max_player_distance;

			/* Default stimulus suppressors */

			c_typed_tag_block<s_defaultstimulussuppressorparam> default_stimulus_suppressors_block;

			/* Dialogue System Data Tags */

			c_typed_tag_block<s_dialoguesystemdatatagreference> dsd_tags_block;
			char generated_pade870[4]; // padding
			long long runtime_dialogue_system_data;
		};
		static_assert(sizeof(s_ai_dialogue_definitions) == 136, "struct s_ai_dialogue_definitions is invalid size");

		struct s_i343aiairdropairdropsystemglobalsdefinition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_reference<KIT_TAG> default_flight_path_kit;
			char generated_padfc5f[4]; // padding
		};
		static_assert(sizeof(s_i343aiairdropairdropsystemglobalsdefinition) == 36, "struct s_i343aiairdropairdropsystemglobalsdefinition is invalid size");

		struct s_namedhlodsettings
		{
			c_typed_tag_reference<HLODPRESETS_TAG> hlod_settings_preset_list;
			string_id hlod_settings_name;
		};
		static_assert(sizeof(s_namedhlodsettings) == 20, "struct s_namedhlodsettings is invalid size");

		struct s_autohlodlevelsettings
		{
			s_namedhlodsettings hlod_settings;
			real switch_distance;
			c_enum<e_etargetlod, short> maximum_lod;
			char generated_padd86d[2]; // padding
		};
		static_assert(sizeof(s_autohlodlevelsettings) == 28, "struct s_autohlodlevelsettings is invalid size");

		struct s_autohlodsettings
		{
			s_anytag_struct_definition anytag;

			/* HLOD Auto-Generation Parameters */

			// custom bsp_cells
			long x_splits;
			long y_splits;
			long z_splits;
			// custom value
			// custom hlod_settings
			// custom bsp_hlod_settings
			s_autohlodlevelsettings bsp_hlod_settings;
			// custom value
			// custom bsp_cell_hlod_settings
			s_autohlodlevelsettings bsp_cell_hlod_settings;
			// custom value
			// custom value
			char generated_padd9ad[4]; // padding
		};
		static_assert(sizeof(s_autohlodsettings) == 88, "struct s_autohlodsettings is invalid size");

		struct s_i343damagedamagesourcedefinition
		{
			string_id damage_source_name;
		};
		static_assert(sizeof(s_i343damagedamagesourcedefinition) == 4, "struct s_i343damagedamagesourcedefinition is invalid size");

		struct s_s_ai_globals_gravemind_definition
		{
			real min_retreat_time;
			real ideal_retreat_time;
			real max_retreat_time;
		};
		static_assert(sizeof(s_s_ai_globals_gravemind_definition) == 12, "struct s_s_ai_globals_gravemind_definition is invalid size");

		struct s_s_ai_globals_formation_definition
		{
			c_typed_tag_reference<FORMATION_TAG> formation;
		};
		static_assert(sizeof(s_s_ai_globals_formation_definition) == 16, "struct s_s_ai_globals_formation_definition is invalid size");

		struct s_s_ai_globals_squad_template_definition
		{
			c_typed_tag_reference<SQUAD_TEMPLATE_TAG> squad_template;
		};
		static_assert(sizeof(s_s_ai_globals_squad_template_definition) == 16, "struct s_s_ai_globals_squad_template_definition is invalid size");

		struct s_s_ai_globals_squad_template_sub_folder_definition
		{
			string_id sub_folder_name;
			c_typed_tag_block<s_s_ai_globals_squad_template_definition> templates_block;
		};
		static_assert(sizeof(s_s_ai_globals_squad_template_sub_folder_definition) == 16, "struct s_s_ai_globals_squad_template_sub_folder_definition is invalid size");

		struct s_s_ai_globals_squad_template_folder_definition
		{
			string_id folder_name;
			c_typed_tag_block<s_s_ai_globals_squad_template_sub_folder_definition> sub_folders_block;
			c_typed_tag_block<s_s_ai_globals_squad_template_definition> templates_block;
		};
		static_assert(sizeof(s_s_ai_globals_squad_template_folder_definition) == 28, "struct s_s_ai_globals_squad_template_folder_definition is invalid size");

		struct s_s_ai_globals_custom_stimulus_definition
		{
			string_id name;
		};
		static_assert(sizeof(s_s_ai_globals_custom_stimulus_definition) == 4, "struct s_s_ai_globals_custom_stimulus_definition is invalid size");

		struct s_s_ai_globals_trait_vision_definition
		{

			/* Vision Traits */

			real vision_distance_scale;
			real vision_angle_scale;
		};
		static_assert(sizeof(s_s_ai_globals_trait_vision_definition) == 8, "struct s_s_ai_globals_trait_vision_definition is invalid size");

		struct s_s_ai_globals_trait_sound_definition
		{

			/* Sound Traits */

			real hearing_distance_scale;
		};
		static_assert(sizeof(s_s_ai_globals_trait_sound_definition) == 4, "struct s_s_ai_globals_trait_sound_definition is invalid size");

		struct s_s_ai_globals_trait_luck_definition
		{

			/* Luck Traits */

			real evasion_chance_scale;
			real grenade_dive_chance_scale;
			real broken_kamikaze_chance_scale;
			real leader_dead_retreat_chance_scale;
			real dive_retreat_chance_scale;
			real shield_depleted_berserk_chance_scale;
			real leader_abandoned_berserk_chance_scale;
			real melee_attack_delay_timer_scale;
			real melee_chance_scale;
			real melee_leap_delay_timer_scale;
			real throw_grenade_delay_scale;
		};
		static_assert(sizeof(s_s_ai_globals_trait_luck_definition) == 44, "struct s_s_ai_globals_trait_luck_definition is invalid size");

		struct s_s_ai_globals_trait_grenade_definition
		{

			/* Grenade Traits */

			real velocity_scale;
			real throw_grenade_delay_scale;
			real dont_drop_grenades_chance_scale;
			real grenade_uncover_chance_scale;
			real retreat_throw_grenade_chance_scale;
			real anti_vehicle_grenade_chance_scale;
			real throw_grenade_chance_scale;
		};
		static_assert(sizeof(s_s_ai_globals_trait_grenade_definition) == 28, "struct s_s_ai_globals_trait_grenade_definition is invalid size");

		struct s_functiondefinition
		{
			// custom value
			s_tag_data data;
			// custom value
		};
		static_assert(sizeof(s_functiondefinition) == 20, "struct s_functiondefinition is invalid size");

		struct s_scalarfunctionname
		{
			// custom function
			s_functiondefinition function;
		};
		static_assert(sizeof(s_scalarfunctionname) == 20, "struct s_scalarfunctionname is invalid size");

		struct s_i343aiaimarkupfilter
		{
			c_enum<e_actortype, short> actor_type;
		};
		static_assert(sizeof(s_i343aiaimarkupfilter) == 2, "struct s_i343aiaimarkupfilter is invalid size");

		struct s_friendlysquadproperties
		{
			c_typed_tag_block<s_i343aiaimarkupfilter> follow_actor_types_block;
			real encounter_zone_exit_threshold;
			real dynamic_encounter_radius;
			real follow_radius;
			real area_refresh_distance;
			// custom left_behind_properties
			real maximum_follow_path_length;
			real waiting_distance_threshold;
			real minimum_waiting_time;
			// custom value
			real area_refresh_time;
			real new_vehicle_distance;
			real non_turret_passenger_exit_time;

			/* value */

			real turret_passenger_exit_time;
			real turret_passenger_exit_distance;
			real arrival_dialogue_event_min_delay_time;
			real arrival_dialogue_event_min_travel_distance;
		};
		static_assert(sizeof(s_friendlysquadproperties) == 68, "struct s_friendlysquadproperties is invalid size");

		struct s_pathingcostmodifiers
		{

			/* Pathing cost modifiers */

			real damage_area;
			real no_drive_zone;
			real avoid_area;
		};
		static_assert(sizeof(s_pathingcostmodifiers) == 12, "struct s_pathingcostmodifiers is invalid size");

		struct s_s_ai_globals_data
		{
			real ai_infantry_on_ai_weapon_damage_scale;
			real ai_vehicle_on_ai_weapon_damage_scale;
			real ai_player_vehicle_on_ai_weapon_damage_scale;
			real absolute_maximum_ai_hearing_distance_;
			real absolute_maximum_ai_speech_distance_;
			real maximum_individual_prop_perceived_danger;

			/* Sound Fraction */

			real quiet_perception_distance_fraction;
			real medium_perception_distance_fraction;
			real shout_perception_distance_fraction;

			/* AI Suicide Damage Source */

			s_i343damagedamagesourcedefinition aisuicidedamagesource;
			real danger_broadly_facing;
			real danger_shooting_near;
			real danger_shooting_at;
			real danger_extremely_close;
			real danger_shield_damage;
			real danger_exetended_shield_damage;
			real danger_body_damage;
			real danger_extended_body_damage;
			c_typed_tag_reference<AI_DIALOGUE_GLOBALS_TAG> global_dialogue_tag;
			string_id default_mission_dialogue_sound_effect;
			real jump_velocity___very_short;
			real jump_velocity___short;
			real jump_velocity___medium_short;
			real jump_velocity___medium_long;
			real jump_velocity___long;
			real jump_velocity___very_long;
			char jump_leap_placeholder[4]; // padding
			real max_jump_down_height___very_short;
			real max_jump_down_height___short;
			real max_jump_down_height___medium_short;
			real max_jump_down_height___medium_long;
			real max_jump_down_height___long;
			real max_jump_down_height___very_long;
			char another_leap_placeholder[4]; // padding
			real_bounds hoist_step;
			real_bounds hoist_crouch;
			real_bounds hoist_stand;
			real_bounds vault_step;
			real_bounds vault_crouch;

			/* PATHFINDING SEARCH RANGES */

			real search_range_infantry;
			real search_range_flying;
			real search_range_vehicle;
			real search_range_giant;
			real ai_seat_cooldown;
			real alert_stagger_delay_max;
			real berserk_animation_suppress_radius;
			c_typed_tag_block<s_s_ai_globals_gravemind_definition> gravemind_properties_block;
			real scary_target_threhold;
			real scary_weapon_threhold;
			real player_scariness;
			real_fraction player_desires_healing_health_threshold;
			real_fraction player_desires_healing_shield_threshold;
			real berserking_actor_scariness;
			real kamikazeing_actor_scariness;

			/* RESURRECTION */

			real min_death_time;
			real projectile_distance;
			real idle_clump_distance;
			real dangerous_clump_distance;

			/* TELEPORTATION */

			real cover_search_duration;
			real task_direction_search_duration;

			/* CURE ISOLATION */

			real time_unseen_before_teleport_allowed;
			real time_isolated_before_exiting_vehicle;
			real time_isolated_before_can_attempt_kill;
			real time_unseen_before_kill_allowed;
			real time_isolated_before_force_killed;
			c_typed_tag_block<s_s_ai_globals_formation_definition> spawn_formations_block;
			c_typed_tag_block<s_s_ai_globals_squad_template_folder_definition> squad_template_folders_block;
			c_typed_tag_block<s_s_ai_globals_custom_stimulus_definition> custom_stimuli_block;

			/* CLUMP THROTTLING */

			real stop_dist;
			real resume_dist;
			real min_dist;
			real max_dist;
			real min_scale;

			/* SQUAD PATROLLING */

			real passthrough_chance;
			real search_phase_skip_chance;
			real patrol_transition_timeout;
			real patrol_maneuver_timeout;
			real_bounds patrol_search_firing_point_time;
			real patrol_isolation_distance;
			real patrol_isolation_time;

			/* KUNGFU CONTROL */

			real kungfu_deactivation_delay;
			// custom presearch_child_counts_0_means_no_limit
			short suppressing_fire_count;
			short uncover_count;
			short leap_on_cover_count;
			short destroy_cover_count;
			short guard_count;
			short investigate_count;
			short search_by_fire_count;
			char search_padding[2]; // padding
			// custom value
			c_typed_tag_block<s_s_ai_globals_trait_vision_definition> vision_traits_block;
			c_typed_tag_block<s_s_ai_globals_trait_sound_definition> sound_traits_block;
			c_typed_tag_block<s_s_ai_globals_trait_luck_definition> luck_traits_block;
			c_typed_tag_block<s_s_ai_globals_trait_grenade_definition> grenade_traits_block;
			// custom search_pattern_specification
			real max_decay_time;
			real decay_time_ping;
			real search_pattern_radius;
			short search_pattern_shell_count;
			short_bounds search_pattern_cells_per_shell_range;
			char generated_pad10c4[2]; // padding
			// custom value
			// custom playfighting_modifiers
			real playfight_burst_duration_mod;
			real playfight_burst_error_mod;
			real playfight_burst_error_bonus;
			real playfight_burst_radius_mod;
			real playfight_grenade_miss_distance;
			real playfight_damage_mod;
			// custom procedural_playfighting

			/* value */

			real_bounds playfight_distance_thresholds;
			s_scalarfunctionname distance_function;
			// custom value
			// custom value
			// custom ai_networking_parameters

			/* IMPORTANT */

			real position_discrepancy_below_which_throttle_fixups_are_used_exclusively;
			real positional_discrepancy_below_which_throttle_fixups_are_not_used_if_authority_is_stopped;
			real predict_ahead_time;

			/* Interpolation Settings */

			c_typed_tag_reference<SIMULATION_INTERPOLATION_TAG> simulation_interpolation_parameters;
			c_typed_tag_reference<SIMULATION_INTERPOLATION_TAG> action_simulation_interpolation_parameters;
			real jump_takeoff_warp_threshold;
			// custom value
			real default_max_active_camouflage;
			real max_player_lof_crouch_distance;
			real player_lof_crouch_time;
			real player_lof_stand_time;
			// custom vehicle_properties
			real vehicle_exit_after_player_delay_time;
			// custom value
			// custom slip_space_spawning
			c_typed_tag_reference<EFFECT_TAG> slip_space_spawning_effect;
			// custom value
			// custom weapon_interactive_object_properties
			c_typed_tag_block<s_ambientactioninfo> ambient_info_block;
			// custom value
			c_typed_tag_block<s_friendlysquadproperties> friendly_squad_properties_block;
			c_typed_tag_block<s_pathingcostmodifiers> pathing_cost_modifiers_block;
		};
		static_assert(sizeof(s_s_ai_globals_data) == 648, "struct s_s_ai_globals_data is invalid size");

		struct s_s_ai_globals_definition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_s_ai_globals_data> data_block;
			char generated_pad5c43[4]; // padding
		};
		static_assert(sizeof(s_s_ai_globals_definition) == 32, "struct s_s_ai_globals_definition is invalid size");

		struct s_attachedlightcone
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_reference<LIGHT_CONE_TAG> light_cone_definition;
			argb_color color;
			real intensity;
			real length;
			real width;
			real camera_fade_near;
			real camera_fade_far;
			real lengthwise_offset_percentage;
			char generated_pad4c79[4]; // padding
		};
		static_assert(sizeof(s_attachedlightcone) == 76, "struct s_attachedlightcone is invalid size");

		struct s_animatedmesh
		{
			s_anytag_struct_definition anytag;
			dword flags;
			byte version;
			byte authored_fps;
			word resource_frame_count;
			s_tag_resource perframe_rigid_body_resources;
		};
		static_assert(sizeof(s_animatedmesh) == 32, "struct s_animatedmesh is invalid size");

		struct s_physicsunsafeobjectfunctionentry
		{
			string_id object_function_name;
		};
		static_assert(sizeof(s_physicsunsafeobjectfunctionentry) == 4, "struct s_physicsunsafeobjectfunctionentry is invalid size");

		struct s_animglobals
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_physicsunsafeobjectfunctionentry> physics_unsafe_object_functions_block;
			char generated_pad2e3d[4]; // padding
		};
		static_assert(sizeof(s_animglobals) == 32, "struct s_animglobals is invalid size");

		struct s_subgraphreferenceexportedanimnodegraph
		{
			c_typed_tag_reference<XANIMNODEGRAPH_TAG> anim_subgraph;
		};
		static_assert(sizeof(s_subgraphreferenceexportedanimnodegraph) == 16, "struct s_subgraphreferenceexportedanimnodegraph is invalid size");

		struct s_subgraphreferenceanimstategraph
		{
			c_typed_tag_reference<XANIMSTATEGRAPH_TAG> state_subgraph;
		};
		static_assert(sizeof(s_subgraphreferenceanimstategraph) == 16, "struct s_subgraphreferenceanimstategraph is invalid size");

		struct s_i343animationcontrolparameter
		{
			string_id name;
		};
		static_assert(sizeof(s_i343animationcontrolparameter) == 4, "struct s_i343animationcontrolparameter is invalid size");

		struct s_i343animationlocalcontrolparametersdefinition
		{
			c_typed_tag_block<s_i343animationcontrolparameter> int_control_parameters_block;
			c_typed_tag_block<s_i343animationcontrolparameter> float_control_parameters_block;
			c_typed_tag_block<s_i343animationcontrolparameter> vector_control_parameters_block;
			c_typed_tag_block<s_i343animationcontrolparameter> bool_control_parameters_block;
			c_typed_tag_block<s_i343animationcontrolparameter> string_control_parameters_block;
		};
		static_assert(sizeof(s_i343animationlocalcontrolparametersdefinition) == 60, "struct s_i343animationlocalcontrolparametersdefinition is invalid size");

		struct s_blackboardentrydescriptor
		{
			c_enum<e_blackboarddatatype, long> data_type;
			string_id blackboard_id;
		};
		static_assert(sizeof(s_blackboardentrydescriptor) == 8, "struct s_blackboardentrydescriptor is invalid size");

		struct s_animgraphconnection
		{
			c_enum<e_animgraphnodetype, long> source_node_type;
			long source_node_index;
			long source_pin_index;
			c_enum<e_animgraphnodetype, long> destination_node_type;
			long destination_node_index;
			long destination_pin_index;
		};
		static_assert(sizeof(s_animgraphconnection) == 24, "struct s_animgraphconnection is invalid size");

		struct s_animationtokennode
		{
			string_id animation_name;
			string_id group_name;
			c_enum<e_animationmode, long> mode;
			real playback_rate;
			c_flags<e_animtokenflags, short, k_animtokenflags_count> animation_token_flags;
			char generated_pad4403[2]; // padding
		};
		static_assert(sizeof(s_animationtokennode) == 20, "struct s_animationtokennode is invalid size");

		struct s_animationexistsnode
		{
			string_id anim_set_name;
			string_id animation_name;
			long variation_index;
		};
		static_assert(sizeof(s_animationexistsnode) == 12, "struct s_animationexistsnode is invalid size");

		struct s_animsetexistsnode
		{
			string_id anim_set_name;
		};
		static_assert(sizeof(s_animsetexistsnode) == 4, "struct s_animsetexistsnode is invalid size");

		struct s_posenode
		{
			string_id animation_name;
			long frame;
		};
		static_assert(sizeof(s_posenode) == 8, "struct s_posenode is invalid size");

		struct s_selectionnodepose
		{
			s_animgraphconnection pose_connection;
		};
		static_assert(sizeof(s_selectionnodepose) == 24, "struct s_selectionnodepose is invalid size");

		struct s_selectionnode
		{
			long default_selection;
			c_flags<e_selectionnodeflags, short, k_selectionnodeflags_count> selection_node_flags;
			char generated_pad6efe[2]; // padding
			c_typed_tag_block<s_selectionnodepose> pose_connections_block;
		};
		static_assert(sizeof(s_selectionnode) == 20, "struct s_selectionnode is invalid size");

		struct s_layernodelayer
		{
			long index;
			c_enum<e_layernodemode, long> mode;
			real alpha;
			s_animgraphconnection pose_connection;
			s_animgraphconnection alpha_connection;
			c_flags<e_layernodelayerflags, short, k_layernodelayerflags_count> layer_token_flags;
			char generated_pad47a8[2]; // padding
			string_id correction_pose_bone;
			s_animgraphconnection replacement_anim_correction_pose_connection;
		};
		static_assert(sizeof(s_layernodelayer) == 92, "struct s_layernodelayer is invalid size");

		struct s_layernode
		{
			c_typed_tag_block<s_layernodelayer> layers_block;
		};
		static_assert(sizeof(s_layernode) == 12, "struct s_layernode is invalid size");

		struct s_autospeedtoken
		{
			string_id animation_token;
			real weight;
			s_subgraphreferenceexportedanimnodegraph subgraph_reference;
		};
		static_assert(sizeof(s_autospeedtoken) == 24, "struct s_autospeedtoken is invalid size");

		struct s_blendspacenode
		{
			c_enum<e_animblendnodetype, long> blend_type;
			c_typed_tag_reference<XANIMBLENDGRAPHNG_TAG> blend_graph;
			string_id anim_name;
			c_typed_tag_block<s_autospeedtoken> auto_speed_tokens_block;
			c_typed_tag_block<s_autospeedtoken> auto_turn_rate_tokens_block;
			real min_alpha;
			real max_alpha;
			real radius;
			long partition_count;
			string_id group_name;
			string_id label;
			c_flags<e_blendspaceflags, short, k_blendspaceflags_count> flags;
			char generated_pad29df[2]; // padding
			string_id channel_1;
			string_id channel_2;
			string_id channel_3;
			real input_smoothing_traversal_time;
		};
		static_assert(sizeof(s_blendspacenode) == 92, "struct s_blendspacenode is invalid size");

		struct s_statemachinenode
		{
			c_typed_tag_reference<XANIMSTATEGRAPH_TAG> animation_state_machine;
		};
		static_assert(sizeof(s_statemachinenode) == 16, "struct s_statemachinenode is invalid size");

		struct s_controlparameternode
		{
			string_id parameter_name;
			c_enum<e_controlparametertype, long> type;
		};
		static_assert(sizeof(s_controlparameternode) == 8, "struct s_controlparameternode is invalid size");

		struct s_subanimgraphnode
		{
			c_typed_tag_reference<XANIMNODEGRAPH_TAG> animation_graph;
		};
		static_assert(sizeof(s_subanimgraphnode) == 16, "struct s_subanimgraphnode is invalid size");

		struct s_transitiondatanode
		{
			c_enum<e_transitiondatatype, long> data_type;
		};
		static_assert(sizeof(s_transitiondatanode) == 4, "struct s_transitiondatanode is invalid size");

		struct s_objectfunctionnode
		{
			string_id function_name;
		};
		static_assert(sizeof(s_objectfunctionnode) == 4, "struct s_objectfunctionnode is invalid size");

		struct s_editablenumbernode
		{
			string_id property_name;
			c_enum<e_editablenumbertype, long> data_type;
			real float_value;
			real float_min_value;
			real float_max_value;
			long int_value;
			long bool_value;
			real_vector3d vector_value;
		};
		static_assert(sizeof(s_editablenumbernode) == 40, "struct s_editablenumbernode is invalid size");

		struct s_booleanlogicnode
		{
			c_enum<e_booleanlogictype, long> operation_type;
		};
		static_assert(sizeof(s_booleanlogicnode) == 4, "struct s_booleanlogicnode is invalid size");

		struct s_floatlogicnode
		{
			c_enum<e_floatlogictype, long> condition;
		};
		static_assert(sizeof(s_floatlogicnode) == 4, "struct s_floatlogicnode is invalid size");

		struct s_floatoperatornode
		{
			c_enum<e_floatoperatortype, long> operation_type;
		};
		static_assert(sizeof(s_floatoperatornode) == 4, "struct s_floatoperatornode is invalid size");

		struct s_intlogicnode
		{
			c_enum<e_intlogictype, long> condition;
		};
		static_assert(sizeof(s_intlogicnode) == 4, "struct s_intlogicnode is invalid size");

		struct s_intoperatornode
		{
			c_enum<e_intoperatortype, long> operation_type;
		};
		static_assert(sizeof(s_intoperatornode) == 4, "struct s_intoperatornode is invalid size");

		struct s_trignode
		{
			c_enum<e_trigtype, long> operation_type;
		};
		static_assert(sizeof(s_trignode) == 4, "struct s_trignode is invalid size");

		struct s_blackboardnode
		{
			c_enum<e_blackboardoperationtype, long> operation_type;
			s_blackboardentrydescriptor blackboard_entry_descriptor;
		};
		static_assert(sizeof(s_blackboardnode) == 12, "struct s_blackboardnode is invalid size");

		struct s_valueconversionnode
		{
			c_enum<e_valueconversiontype, long> conversion_type;
		};
		static_assert(sizeof(s_valueconversionnode) == 4, "struct s_valueconversionnode is invalid size");

		struct s_interpolationnode
		{
			c_enum<e_interpolationtype, long> interpolation_type;
		};
		static_assert(sizeof(s_interpolationnode) == 4, "struct s_interpolationnode is invalid size");

		struct s_constantfloatnode
		{
			real value;
		};
		static_assert(sizeof(s_constantfloatnode) == 4, "struct s_constantfloatnode is invalid size");

		struct s_constantintnode
		{
			long value;
		};
		static_assert(sizeof(s_constantintnode) == 4, "struct s_constantintnode is invalid size");

		struct s_constantint64node
		{
			long value;
			char generated_pad8671[4]; // padding
		};
		static_assert(sizeof(s_constantint64node) == 8, "struct s_constantint64node is invalid size");

		struct s_constantuint64node
		{
			long value;
			char generated_pad75b8[4]; // padding
		};
		static_assert(sizeof(s_constantuint64node) == 8, "struct s_constantuint64node is invalid size");

		struct s_constantstringnode
		{
			c_static_string<256> value;
		};
		static_assert(sizeof(s_constantstringnode) == 256, "struct s_constantstringnode is invalid size");

		struct s_constantboolnode
		{
			long value;
		};
		static_assert(sizeof(s_constantboolnode) == 4, "struct s_constantboolnode is invalid size");

		struct s_unitparameternode
		{
			c_enum<e_unitparametertype, long> parameter_type;
			real angle_lock_range;
		};
		static_assert(sizeof(s_unitparameternode) == 8, "struct s_unitparameternode is invalid size");

		struct s_endofanimationnode
		{
			c_enum<e_endofanimationeventtype, char> node_type;
			char generated_pade774[3]; // padding
			string_id group_name;
			real offset_time;
		};
		static_assert(sizeof(s_endofanimationnode) == 12, "struct s_endofanimationnode is invalid size");

		struct s_bonemasknode
		{
			string_id bone_mask_id;
		};
		static_assert(sizeof(s_bonemasknode) == 4, "struct s_bonemasknode is invalid size");

		struct s_iknodetag
		{
			real weight;
			string_id source_marker_name;
			string_id target_marker_name;
			string_id preferred_ik_chain_name;
			real blend_rate;
			c_enum<e_iktype, char> ik_type;
			char generated_pad0318[3]; // padding
			real priority;
			c_flags<e_iktaskflags, char, k_iktaskflags_count> flags;
			char generated_pad1cf9[3]; // padding
		};
		static_assert(sizeof(s_iknodetag) == 32, "struct s_iknodetag is invalid size");

		struct s_groundiknodetag
		{
			real weight;
			string_id source_marker_name;
			string_id preferred_ik_chain_name;
			real blend_rate;
			real priority;
		};
		static_assert(sizeof(s_groundiknodetag) == 20, "struct s_groundiknodetag is invalid size");

		struct s_lookiknodetag
		{
			real weight;
			real blend_rate;
			real priority;
			string_id relative_forward_marker;
			real yaw;
			real pitch;
			real yaw_min;
			real yaw_max;
			real pitch_min;
			real pitch_max;
			real yaw_pose_contribution;
			real pitch_pose_contribution;
			c_enum<e_lookikrelativeforwardmode, char> relative_forward_mode;
			char generated_pad9f7b[3]; // padding
		};
		static_assert(sizeof(s_lookiknodetag) == 52, "struct s_lookiknodetag is invalid size");

		struct s_concatenatestring
		{
			long index;
			c_static_string<256> _string;
		};
		static_assert(sizeof(s_concatenatestring) == 260, "struct s_concatenatestring is invalid size");

		struct s_concatenatenode
		{
			c_typed_tag_block<s_concatenatestring> strings_block;
		};
		static_assert(sizeof(s_concatenatenode) == 12, "struct s_concatenatenode is invalid size");

		struct s_animsetpushnode
		{
			c_enum<e_pushnodetype, char> type;
			c_static_string<256> _string;
			char generated_pada121[3]; // padding
			long push_order;
		};
		static_assert(sizeof(s_animsetpushnode) == 264, "struct s_animsetpushnode is invalid size");

		struct s_switchintinputvalue
		{
			long int_value;
		};
		static_assert(sizeof(s_switchintinputvalue) == 4, "struct s_switchintinputvalue is invalid size");

		struct s_switchstringinputvalue
		{
			string_id string_value;
		};
		static_assert(sizeof(s_switchstringinputvalue) == 4, "struct s_switchstringinputvalue is invalid size");

		struct s_switchnode
		{
			c_typed_tag_block<s_switchintinputvalue> int_input_values_block;
			c_typed_tag_block<s_switchstringinputvalue> string_input_values_block;
			long default_pin_index;
		};
		static_assert(sizeof(s_switchnode) == 28, "struct s_switchnode is invalid size");

		struct s_switchonassetinputvalue
		{
			c_typed_tag_reference<ANYTAG_TAG> asset_reference;
			c_enum<e_switchableassetinputtype, char> is_asset_category;
			char generated_pade0fe[3]; // padding
		};
		static_assert(sizeof(s_switchonassetinputvalue) == 20, "struct s_switchonassetinputvalue is invalid size");

		struct s_switchonassetnode
		{
			c_typed_tag_block<s_switchonassetinputvalue> inputs_block;
		};
		static_assert(sizeof(s_switchonassetnode) == 12, "struct s_switchonassetnode is invalid size");

		struct s_aimscreennode
		{
			real yaw;
			real pitch;
			s_animgraphconnection yaw_connection;
			s_animgraphconnection pitch_connection;
			string_id aim_animation_name;
			string_id label;
			c_flags<e_aimscreenflags, short, k_aimscreenflags_count> flags;
			char generated_pad6467[2]; // padding
			real input_smoothing_traversal_time;
		};
		static_assert(sizeof(s_aimscreennode) == 72, "struct s_aimscreennode is invalid size");

		struct s_accspacenode
		{
			string_id acceleration_animation_name;
		};
		static_assert(sizeof(s_accspacenode) == 4, "struct s_accspacenode is invalid size");

		struct s_animationextractnode
		{
			s_animgraphconnection pose_connection;
			string_id joint_name;
		};
		static_assert(sizeof(s_animationextractnode) == 28, "struct s_animationextractnode is invalid size");

		struct s_animationgetlocaloffsetnode
		{
			string_id joint_name_1;
			string_id joint_name_2;
			c_flags<e_animationgetlocaloffsetflags, short, k_animationgetlocaloffsetflags_count> animation_get_local_offset_flags;
			char generated_padb27a[2]; // padding
		};
		static_assert(sizeof(s_animationgetlocaloffsetnode) == 12, "struct s_animationgetlocaloffsetnode is invalid size");

		struct s_animationgetvaluesnode
		{
			s_animgraphconnection pose_connection;
			string_id joint_name;
			c_flags<e_animationgetvaluesflags, short, k_animationgetvaluesflags_count> animation_get_values_node_flags;
			char generated_pad70a2[2]; // padding
		};
		static_assert(sizeof(s_animationgetvaluesnode) == 32, "struct s_animationgetvaluesnode is invalid size");

		struct s_animationfkjointnames
		{
			string_id joint_name;
		};
		static_assert(sizeof(s_animationfkjointnames) == 4, "struct s_animationfkjointnames is invalid size");

		struct s_animationfknode
		{
			s_animgraphconnection pose_connection;
			c_typed_tag_block<s_animationfkjointnames> joint_names_block;
			s_animgraphconnection translation;
			s_animgraphconnection rotation;
			s_animgraphconnection scale;
			c_flags<e_animationfkflags, short, k_animationfkflags_count> animation_fk_node_flags;
			char generated_pad8b37[2]; // padding
			s_animgraphconnection pivot_pose_connection;
			string_id pivot_joint_name;
		};
		static_assert(sizeof(s_animationfknode) == 140, "struct s_animationfknode is invalid size");

		struct s_animationconstraintnode
		{
			string_id joint_name;
			string_id target_joint_name;
			string_id offset_joint_name;
			c_flags<e_animationconstraintflags, short, k_animationconstraintflags_count> animation_constraint_node_flags;
			char generated_pade4e3[2]; // padding
		};
		static_assert(sizeof(s_animationconstraintnode) == 16, "struct s_animationconstraintnode is invalid size");

		struct s_voiceoveranimationnode
		{
			c_enum<e_voiceoveranimationdatatypes, long> voiceover_animation_data_types;
		};
		static_assert(sizeof(s_voiceoveranimationnode) == 4, "struct s_voiceoveranimationnode is invalid size");

		struct s_nativeexpressionnode
		{
			c_enum<e_nativeexpressiontype, long> type;
			string_id native_graph_name;
			long use_native_graph;
		};
		static_assert(sizeof(s_nativeexpressionnode) == 12, "struct s_nativeexpressionnode is invalid size");

		struct s_exportedanimnodegraph
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_reference<ANIMNODEGRAPH_TAG> source_graph;
			c_typed_tag_block<s_subgraphreferenceexportedanimnodegraph> anim_node_subgraphs_block;
			c_typed_tag_block<s_subgraphreferenceanimstategraph> anim_state_subgraphs_block;
			s_i343animationlocalcontrolparametersdefinition control_parameters_definitions;
			c_typed_tag_block<s_blackboardentrydescriptor> blackboard_entries_block;
			c_typed_tag_block<s_animgraphconnection> connections_block;
			c_typed_tag_block<s_animationtokennode> animation_tokens_block;
			c_typed_tag_block<s_animationexistsnode> animation_exists_nodes_block;
			c_typed_tag_block<s_animsetexistsnode> anim_set_exists_nodes_block;
			long blend_node_count;
			long overlay_node_count;
			long dummy_pose_node_count;
			long branch_node_count;
			c_typed_tag_block<s_posenode> pose_nodes_block;
			c_typed_tag_block<s_selectionnode> selection_nodes_block;
			c_typed_tag_block<s_layernode> layer_nodes_block;
			c_typed_tag_block<s_blendspacenode> blend_space_nodes_block;
			c_typed_tag_block<s_statemachinenode> state_machine_nodes_block;
			c_typed_tag_block<s_controlparameternode> control_parameters_block;
			c_typed_tag_block<s_subanimgraphnode> sub_anim_graphs_block;
			c_typed_tag_block<s_transitiondatanode> transition_data_nodes_block;
			c_typed_tag_block<s_objectfunctionnode> object_function_nodes_block;
			c_typed_tag_block<s_editablenumbernode> editable_number_nodes_block;
			c_typed_tag_block<s_booleanlogicnode> boolean_logic_nodes_block;
			c_typed_tag_block<s_floatlogicnode> float_logic_nodes_block;
			c_typed_tag_block<s_floatoperatornode> float_operator_nodes_block;
			c_typed_tag_block<s_intlogicnode> int_logic_nodes_block;
			c_typed_tag_block<s_intoperatornode> int_operator_nodes_block;
			c_typed_tag_block<s_trignode> trig_nodes_block;
			c_typed_tag_block<s_blackboardnode> blackboard_nodes_block;
			c_typed_tag_block<s_valueconversionnode> valueconversion_nodes_block;
			c_typed_tag_block<s_interpolationnode> interpolation_nodes_block;
			c_typed_tag_block<s_constantfloatnode> constant_float_nodes_block;
			c_typed_tag_block<s_constantintnode> constant_int_nodes_block;
			c_typed_tag_block<s_constantint64node> constant_int64_nodes_block;
			c_typed_tag_block<s_constantuint64node> constant_uint64_nodes_block;
			c_typed_tag_block<s_constantstringnode> constant_string_nodes_block;
			c_typed_tag_block<s_constantboolnode> constant_bool_nodes_block;
			c_typed_tag_block<s_unitparameternode> unit_parameter_nodes_block;
			c_typed_tag_block<s_endofanimationnode> end_of_animation_nodes_block;
			c_typed_tag_block<s_bonemasknode> bone_mask_nodes_block;
			c_typed_tag_block<s_iknodetag> ik_nodes_block;
			c_typed_tag_block<s_groundiknodetag> ground_ik_nodes_block;
			c_typed_tag_block<s_lookiknodetag> look_ik_nodes_block;
			c_typed_tag_block<s_concatenatenode> concatenate_nodes_block;
			c_typed_tag_block<s_animsetpushnode> anim_set_push_nodes_block;
			c_typed_tag_block<s_switchnode> switch_nodes_block;
			c_typed_tag_block<s_switchonassetnode> switchonasset_nodes_block;
			c_typed_tag_block<s_aimscreennode> aim_screen_nodes_block;
			c_typed_tag_block<s_accspacenode> acc_space_nodes_block;
			c_typed_tag_block<s_animationextractnode> animation_extract_nodes_block;
			c_typed_tag_block<s_animationgetlocaloffsetnode> animation_get_local_offset_nodes_block;
			c_typed_tag_block<s_animationgetvaluesnode> animation_get_values_nodes_block;
			c_typed_tag_block<s_animationfknode> animation_fk_nodes_block;
			c_typed_tag_block<s_animationconstraintnode> animation_constraint_nodes_block;
			c_typed_tag_block<s_voiceoveranimationnode> voiceover_animation_nodes_block;
			c_typed_tag_block<s_nativeexpressionnode> native_expression_nodes_block;
			c_enum<e_animgraphnodetype, long> final_pose_node_type;
			long final_pose_node_index;
			long final_pose_pin_index;
		};
		static_assert(sizeof(s_exportedanimnodegraph) == 732, "struct s_exportedanimnodegraph is invalid size");

		struct s_animentry
		{
			string_id token;
			long uniqueid;
			string_id legacyname;
			s_tag_reference animationsource;
			c_enum<e_animationtype, char> type;
			c_enum<e_animationcompressiontype, char> compression;
			char generated_pad78b5[2]; // padding
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> generatedmodelanimation;
			real weight;
			c_enum<e_autoweight, char> autoweight;
			c_flags<e_animentryflags, char, k_animentryflags_count> flags;
			// custom legacy_fields
			short loop_frame_index;
			c_flags<e_c_animation_user_flags, short, k_c_animation_user_flags_count> legacy_user_flags;
			// custom value
			char generated_pad5ed4[2]; // padding
		};
		static_assert(sizeof(s_animentry) == 60, "struct s_animentry is invalid size");

		struct s_legacyanimsetcompositeentry
		{
			string_id name;
			c_static_string<256> source_xml;
			c_enum<e_legacyanimsetcompositetype, char> type;
			char generated_padc60d[3]; // padding
		};
		static_assert(sizeof(s_legacyanimsetcompositeentry) == 264, "struct s_legacyanimsetcompositeentry is invalid size");

		struct s_animsettag
		{
			s_anytag_struct_definition anytag;
			string_id channel;
			c_typed_tag_reference<ANIMSET_TAG> parent;
			s_tag_reference asset;
			c_typed_tag_reference<ANIMFRAMEEVENTS_TAG> animation_frame_events;
			c_typed_tag_reference<ANIMFRAMEEVENTSAUDIO_TAG> audio_frame_events;
			c_typed_tag_reference<ANIMFRAMEEVENTSFX_TAG> effect_frame_events;
			c_typed_tag_block<s_animentry> animations_block;
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> reference_to_generated_anim_pool_tag;
			// custom legacy_animset_fields
			c_typed_tag_block<s_legacyanimsetcompositeentry> composites_block;
			// custom value
			char generated_pad5195[4]; // padding
		};
		static_assert(sizeof(s_animsettag) == 144, "struct s_animsettag is invalid size");

		struct s_subgraphreferencetransitionlogicgraph
		{
			c_typed_tag_reference<XTRANSITIONLOGICGRAPH_TAG> transition_logic_subgraph;
		};
		static_assert(sizeof(s_subgraphreferencetransitionlogicgraph) == 16, "struct s_subgraphreferencetransitionlogicgraph is invalid size");

		struct s_animstatenode
		{
			string_id name;
			c_typed_tag_reference<XANIMNODEGRAPH_TAG> animation_sub_graph;
			c_flags<e_animstateflags, short, k_animstateflags_count> state_flags;
			char generated_padde0e[2]; // padding
		};
		static_assert(sizeof(s_animstatenode) == 24, "struct s_animstatenode is invalid size");

		struct s_animstateconnection
		{
			short start_state;
			short end_state;
			c_typed_tag_reference<XTRANSITIONLOGICGRAPH_TAG> condition_graph;
			c_typed_tag_reference<XANIMNODEGRAPH_TAG> transition_blend;
			long priority;
			real duration;
			c_flags<e_animstateconnectionflags, short, k_animstateconnectionflags_count> inertialize;
			c_flags<e_animstateeventsflags, short, k_animstateeventsflags_count> process_events_from_both_states;
		};
		static_assert(sizeof(s_animstateconnection) == 48, "struct s_animstateconnection is invalid size");

		struct s_animdefaultstateconnection
		{
			short state;
			char generated_paddb5f[2]; // padding
			c_typed_tag_reference<XTRANSITIONLOGICGRAPH_TAG> condition_graph;
		};
		static_assert(sizeof(s_animdefaultstateconnection) == 20, "struct s_animdefaultstateconnection is invalid size");

		struct s_animstategraph
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_reference<ANIMSTATENODEGRAPH_TAG> source_graph;
			c_typed_tag_block<s_subgraphreferenceexportedanimnodegraph> anim_node_subgraphs_block;
			c_typed_tag_block<s_subgraphreferencetransitionlogicgraph> transition_logic_subgraphs_block;
			c_typed_tag_block<s_animstatenode> states_block;
			c_typed_tag_block<s_animstateconnection> connections_block;
			c_typed_tag_block<s_animdefaultstateconnection> start_transitions_block;
			c_typed_tag_reference<XANIMNODEGRAPH_TAG> transition_blend;
			char generated_pad2a58[4]; // padding
		};
		static_assert(sizeof(s_animstategraph) == 112, "struct s_animstategraph is invalid size");

		struct s_antenna_vertex
		{
			real_euler_angles2d angles;
			real length;
			short sequence_index;
			char generated_padd920[2]; // padding
			argb_color color;
			argb_color lod_color;
			real hermite_t;
			real_vector3d vector_to_next;
		};
		static_assert(sizeof(s_antenna_vertex) == 64, "struct s_antenna_vertex is invalid size");

		struct s_antenna_definition
		{
			s_anytag_struct_definition anytag;
			string_id attachment_marker_name;
			c_typed_tag_reference<BITMAP_TAG> bitmaps;
			c_typed_tag_reference<POINT_PHYSICS_TAG> physics;
			real_fraction spring_strength_coefficient;
			real texel_to_world_width_scale;
			real falloff_pixels;
			real cutoff_pixels;
			real point_of_bend;
			real starting_bend;
			real ending_bend;
			real runtime_total_length;
			c_typed_tag_block<s_antenna_vertex> vertices_block;
		};
		static_assert(sizeof(s_antenna_definition) == 96, "struct s_antenna_definition is invalid size");

		struct s_i343actionsystemactionprioritydatadefinitionexistingentry
		{
			c_enum<e_i343actionsystemactiontype, long> this_action;
			c_enum<e_i343actionsystemactionpriorityresult, long> combined_result;
		};
		static_assert(sizeof(s_i343actionsystemactionprioritydatadefinitionexistingentry) == 8, "struct s_i343actionsystemactionprioritydatadefinitionexistingentry is invalid size");

		struct s_i343actionsystemactionprioritydatadefinitionincomingentry
		{
			c_enum<e_i343actionsystemactiontype, long> this_action;
			c_typed_tag_block<s_i343actionsystemactionprioritydatadefinitionexistingentry> existing_actions_block;
		};
		static_assert(sizeof(s_i343actionsystemactionprioritydatadefinitionincomingentry) == 16, "struct s_i343actionsystemactionprioritydatadefinitionincomingentry is invalid size");

		struct s_i343actionsystemactionprioritydatadefinition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343actionsystemactionprioritydatadefinitionincomingentry> incoming_actions_block;
			char generated_pade8f1[4]; // padding
		};
		static_assert(sizeof(s_i343actionsystemactionprioritydatadefinition) == 32, "struct s_i343actionsystemactionprioritydatadefinition is invalid size");

		struct s_visualregionnameblock
		{
			string_id name;
		};
		static_assert(sizeof(s_visualregionnameblock) == 4, "struct s_visualregionnameblock is invalid size");

		struct s_propertyregion
		{
			string_id name;
			c_flags<e_propertyregionflagsdefinition, long, k_propertyregionflagsdefinition_count> flags;
			c_enum<e_staticgeometrymergemode, long> static_geometry_merge_mode;
			c_enum<e_assetnumberofsides, long> number_of_sides;
			c_enum<e_prefablightmappingpolicy, char> lightmapping_policy;
			char generated_pad5489[3]; // padding
			real_vector3d probe_grid_capture_offset;
			string_id physics_material_name;
			string_id damage_section;
			// custom blendshapes
			c_enum<e_tensionsupportlod, long> tension_backing_data;
			real prune_threshold;
			c_enum<e_recomputednormalblendmode, long> recomputed_normal_blend_mode;
			// custom value
			// custom emblem_data
			long emblem_layer_depth;
			// custom value
		};
		static_assert(sizeof(s_propertyregion) == 56, "struct s_propertyregion is invalid size");

		struct s_relativesourcepath
		{
			c_static_string<256> path;
		};
		static_assert(sizeof(s_relativesourcepath) == 256, "struct s_relativesourcepath is invalid size");

		struct s_damagestateblock
		{
			c_enum<e_assetdamagestates, long> state;
			string_id geometry_name;
		};
		static_assert(sizeof(s_damagestateblock) == 8, "struct s_damagestateblock is invalid size");

		struct s_contenttagblock
		{
			string_id name;
			string_id groupname;
			c_typed_tag_reference<GEOMETRY_TAG> reference;
			c_typed_tag_block<s_relativesourcepath> relative_source_paths_block;
			c_typed_tag_block<s_damagestateblock> damage_states_block;
		};
		static_assert(sizeof(s_contenttagblock) == 48, "struct s_contenttagblock is invalid size");

		struct s_skeletonblock
		{
			c_typed_tag_reference<SKELETON_TAG> reference;
			c_static_string<256> alembic_source_path;
		};
		static_assert(sizeof(s_skeletonblock) == 272, "struct s_skeletonblock is invalid size");

		struct s_additionalcontentpath
		{
			string_id name;
			c_static_string<256> path;
		};
		static_assert(sizeof(s_additionalcontentpath) == 260, "struct s_additionalcontentpath is invalid size");

		struct s_markerblock
		{
			string_id name;
			string_id groupname;
			c_typed_tag_reference<MARKER_TAG> reference;
		};
		static_assert(sizeof(s_markerblock) == 24, "struct s_markerblock is invalid size");

		struct s_lodtransitiondistancesblock
		{
			real transition_distance;
		};
		static_assert(sizeof(s_lodtransitiondistancesblock) == 4, "struct s_lodtransitiondistancesblock is invalid size");

		struct s_visualregionoverrideentry
		{
			string_id region_name;
			string_id geometry_name;
		};
		static_assert(sizeof(s_visualregionoverrideentry) == 8, "struct s_visualregionoverrideentry is invalid size");

		struct s_materialoverrideentry
		{
			c_typed_tag_reference<MATERIAL_TAG> original_material_ref;
			c_typed_tag_reference<MATERIAL_TAG> override_material_ref;
		};
		static_assert(sizeof(s_materialoverrideentry) == 32, "struct s_materialoverrideentry is invalid size");

		struct s_assetchildobject
		{
			string_id parent_marker;
			string_id child_marker;
			string_id child_variant_name;
			c_typed_tag_reference<OBJECT_TAG> child_object;
			c_typed_tag_reference<OBJECT_CONFIGURATION_TAG> child_configuration;
			string_id damage_section;
			c_flags<e_i343modelmodelvariantobjectflags, char, k_i343modelmodelvariantobjectflags_count> flags;
			char generated_padb3ad[3]; // padding
		};
		static_assert(sizeof(s_assetchildobject) == 52, "struct s_assetchildobject is invalid size");

		struct s_mutedjointentry
		{
			string_id joint_name;
		};
		static_assert(sizeof(s_mutedjointentry) == 4, "struct s_mutedjointentry is invalid size");

		struct s_i343objectsobjectnodegraphdefinition
		{
			string_id name;
			c_typed_tag_reference<XOBJECTNODEGRAPH_TAG> exported_node_graph;
			c_flags<e_objectnodegraphflags, char, k_objectnodegraphflags_count> flags;
			c_enum<e_booleanoverride, char> enable_node_graph;
			char generated_pad8671[2]; // padding
		};
		static_assert(sizeof(s_i343objectsobjectnodegraphdefinition) == 24, "struct s_i343objectsobjectnodegraphdefinition is invalid size");

		struct s_assetvariant
		{
			string_id name;
			string_id style;
			long damage_style_index;
			string_id all_visual_region;
			c_typed_tag_block<s_visualregionoverrideentry> visual_region_overrides_block;
			c_typed_tag_block<s_materialoverrideentry> material_overrides_block;
			c_typed_tag_block<s_assetchildobject> child_objects_block;
			c_typed_tag_block<s_mutedjointentry> muted_joints_block;
			c_typed_tag_block<s_i343objectsobjectnodegraphdefinition> object_node_graphs_overrides_block;
			c_typed_tag_reference<RTMP_TAG> reference_to_material_palette_tag;
			c_typed_tag_reference<VECTORART_TAG> reference_to_generated_vector_art;
			c_typed_tag_reference<ABC_TAG> reference_round_trip_abc_tag_from_a_render_model;
			c_typed_tag_reference<ABC_TAG> reference_round_trip_abc_tag_from_a_runtimegeo;
		};
		static_assert(sizeof(s_assetvariant) == 140, "struct s_assetvariant is invalid size");

		struct s_uniqueassetgeometryvariant
		{
			qword uuid;
			c_typed_tag_block<s_visualregionoverrideentry> explicit_visual_region_list_block;
			c_typed_tag_reference<RUNTIME_GEO_TAG> reference_to_generated_prefab;
			c_typed_tag_reference<RAW_GEO_TAG> reference_to_raw_triangle_data;
			c_typed_tag_reference<STATIC_COLLISION_TAG> reference_to_generated_static_collision_geometry;
			c_typed_tag_reference<FIXEDDEPTHQUADTREE_TAG> reference_to_generated_lightweight_fixed_depth_quadtree;
			char generated_pada40c[4]; // padding
		};
		static_assert(sizeof(s_uniqueassetgeometryvariant) == 88, "struct s_uniqueassetgeometryvariant is invalid size");

		struct s_validationcomment
		{
			c_static_string<256> comment;
			c_flags<e_validationstatusflags, long, k_validationstatusflags_count> status;
		};
		static_assert(sizeof(s_validationcomment) == 260, "struct s_validationcomment is invalid size");

		struct s_validation
		{
			c_static_string<256> test_name;
			c_flags<e_validationstatusflags, long, k_validationstatusflags_count> test_status;
			c_typed_tag_block<s_validationcomment> comments_block;
		};
		static_assert(sizeof(s_validation) == 272, "struct s_validation is invalid size");

		struct s_contentvalidationgroup
		{
			c_static_string<256> group_name;
			long group_id;
			c_flags<e_validationstatusflags, long, k_validationstatusflags_count> validation_status;
			c_typed_tag_block<s_validation> validation_tests_block;
		};
		static_assert(sizeof(s_contentvalidationgroup) == 276, "struct s_contentvalidationgroup is invalid size");

		struct s_contentvalidationblockdata
		{

			/* Content validation tests */

			c_flags<e_validationstatusflags, long, k_validationstatusflags_count> validation_status;
			c_typed_tag_block<s_contentvalidationgroup> validation_test_batteries_block;
		};
		static_assert(sizeof(s_contentvalidationblockdata) == 16, "struct s_contentvalidationblockdata is invalid size");

		struct s_assettag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_visualregionnameblock> visual_region_names_block;
			c_typed_tag_block<s_propertyregion> property_regions_block;
			// custom component_tags_files
			c_typed_tag_block<s_contenttagblock> geometry_tags_block;
			c_typed_tag_block<s_skeletonblock> skeleton_block;
			c_typed_tag_block<s_additionalcontentpath> additional_content_paths_block;
			c_typed_tag_block<s_markerblock> marker_tags_block;
			c_typed_tag_reference<ASSET_PHYSICS_TAG> asset_physics_tag;
			c_typed_tag_reference<DAMAGE_TAG> damage_tag;
			c_typed_tag_reference<LEGACYANIMSET_TAG> legacy_animset_tag;
			c_typed_tag_reference<ASSET_SOUND_TAG> asset_sound_tag;
			c_typed_tag_reference<ASSET_DIALOGUE_TAG> asset_dialogue_tag;
			// custom value
			string_id asset_category;
			// custom lods
			// custom automatically_generated_lod_settings
			c_typed_tag_reference<LODSETTINGS_TAG> lod_settings_tag;
			string_id lod_settings_name;
			real lod_distance_bias;
			// custom value
			c_typed_tag_block<s_lodtransitiondistancesblock> lod_transition_distances_block;
			real lod_fade_out_after_distance;
			c_enum<e_hlodpolicy, char> hlod_policy;
			char generated_padebca[3]; // padding
			// custom value
			// custom variants
			string_id default_variant_name;
			c_typed_tag_block<s_assetvariant> asset_variants_block;
			c_typed_tag_block<s_uniqueassetgeometryvariant> unique_geometry_block;
			c_enum<e_rendermodeldefaultloadvariantpolicy, char> default_load_variant_policy;
			// custom value
			// custom static_collision_generation_settings
			c_enum<e_staticcollisionbuildpolicy, char> static_collision_build_policy;
			c_enum<e_staticcollisiondecalspolicy, char> static_collision_decals_policy;
			char generated_pad387f[1]; // padding
			// custom value
			// custom static_render_generation_settings
			c_enum<e_assetusecollisionasshadowpolicy, long> convert_collision_to_shadow_geometry;
			c_flags<e_meshlodflagsdefinition, short, k_meshlodflagsdefinition_count> converted_bullet_collision_lod_flags;
			c_flags<e_meshlodflagsdefinition, short, k_meshlodflagsdefinition_count> converted_play_collision_lod_flags;
			// custom value
			// custom generated_tags
			c_typed_tag_reference<MODEL_TAG> model_tag;
			c_typed_tag_reference<RENDER_MODEL_TAG> render_model_tag;
			c_typed_tag_reference<PHYSICS_MODEL_TAG> physics_model_tag;
			c_typed_tag_reference<COLLISION_MODEL_TAG> collision_model_tag;
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> legacy_model_animation_graph_tag;
			// custom impostor
			c_typed_tag_reference<IMPOSTOR_TAG> impostor_tag;
			// custom value
			// custom validation
			s_contentvalidationblockdata validation;
			// custom value
		};
		static_assert(sizeof(s_assettag) == 368, "struct s_assettag is invalid size");

		struct s_s_animation_graph_node
		{
			string_id name;
			short next_sibling_node_index;
			short first_child_node_index;
			short parent_node_index;
			c_flags<e_animationnodemodelflags, short, k_animationnodemodelflags_count> model_flags;
			real z_pos;
			long frame_id1;
			long frame_id2;
		};
		static_assert(sizeof(s_s_animation_graph_node) == 24, "struct s_s_animation_graph_node is invalid size");

		struct s_s_animation_node_usage_entry
		{
			c_enum<e_c_animation_node_usage, short> usage;
			short node_to_use;
		};
		static_assert(sizeof(s_s_animation_node_usage_entry) == 4, "struct s_s_animation_node_usage_entry is invalid size");

		struct s_s_animation_node_mask_entry
		{
			short node;
		};
		static_assert(sizeof(s_s_animation_node_mask_entry) == 2, "struct s_s_animation_node_mask_entry is invalid size");

		struct s_nodeflagstoragearray
		{
			long flag_data;
		};
		static_assert(sizeof(s_nodeflagstoragearray) == 4, "struct s_nodeflagstoragearray is invalid size");

		struct s_s_animation_node_mask
		{
			string_id name;
			c_flags<e_nodemaskflags, short, k_nodemaskflags_count> flags;
			short chain_start;
			c_typed_tag_block<s_s_animation_node_mask_entry> chain_ends_block;
			c_typed_tag_block<s_s_animation_node_mask_entry> nodes_block;
			short add_nodes;
			short remove_nodes;
			s_nodeflagstoragearray node_flags[32];
		};
		static_assert(sizeof(s_s_animation_node_mask) == 164, "struct s_s_animation_node_mask is invalid size");

		struct s_animationgraphuserparameter
		{
			string_id name;
			real default_value;
		};
		static_assert(sizeof(s_animationgraphuserparameter) == 8, "struct s_animationgraphuserparameter is invalid size");

		struct s_animationgraphskeleton
		{
			long skeleton_checksum;
			c_typed_tag_block<s_s_animation_graph_node> skeleton_bones_block;
			c_typed_tag_block<s_s_animation_node_usage_entry> bone_usage_block;
			c_typed_tag_block<s_s_animation_node_mask> bone_masks_block;
			c_typed_tag_block<s_animationgraphuserparameter> user_parameters_block;
		};
		static_assert(sizeof(s_animationgraphskeleton) == 52, "struct s_animationgraphskeleton is invalid size");

		struct s_animationikjunction
		{
			string_id name;
			short pivot_node;
			short parent_junction;
			short supporting_chain;
			short supporting_node;
			real_fraction pull_passthrough;
		};
		static_assert(sizeof(s_animationikjunction) == 16, "struct s_animationikjunction is invalid size");

		struct s_animationikjoint
		{
			short joint_index;
			c_flags<e_animationikjointflags, short, k_animationikjointflags_count> flags;
		};
		static_assert(sizeof(s_animationikjoint) == 4, "struct s_animationikjoint is invalid size");

		struct s_s_animation_ik_chain
		{
			string_id name;
			c_enum<e_c_animation_ik_chain_type, short> type;
			short start_node;
			short effector_node;
			short parent_junction;
			short rank;
			short antecedents;
			c_typed_tag_block<s_animationikjoint> special_joints_block;

			/* Pull settings */

			real_fraction native_pull_strength;
			real_fraction native_push_strength;
			real_fraction over_extent_pull_strength;
			real_fraction under_extent_push_strength;

			/* Effector Cone Limits */

			real_fraction effector_cone_limit_power;
			angle_bounds pitch_bounds;
			angle_bounds yaw_bounds;
			real_bounds offset_bounds;
			c_typed_tag_block<s_animationikjoint> full_joint_chain_block;
			real_fraction spline_reversal_strength;
		};
		static_assert(sizeof(s_s_animation_ik_chain) == 88, "struct s_s_animation_ik_chain is invalid size");

		struct s_s_animation_ik_leg_definition
		{
			long leg_ik_chain;
			real standing_compression_limit;
			real crouching_compression_limit;
			real_bounds foot_pitch_limits;
			real_bounds foot_yaw_limits;
		};
		static_assert(sizeof(s_s_animation_ik_leg_definition) == 28, "struct s_s_animation_ik_leg_definition is invalid size");

		struct s_s_animation_ik_arm_definition
		{
			long arm_ik_chain;
			real wrist_break_threshold;
			string_id fixup_axis_marker;
			real ik_wrist_break_acceptable_min_angle;
		};
		static_assert(sizeof(s_s_animation_ik_arm_definition) == 16, "struct s_s_animation_ik_arm_definition is invalid size");

		struct s_s_animation_ik_point
		{
			string_id name;
			string_id source_marker;
			c_enum<e_ikattachmenttargettype, long> attach_to;
			string_id destination_marker;
			real_point3d pole_marker;
			long chain_to_use;
			// custom value
			string_id weight_source_object_function;
			// custom value
			string_id priority_source_object_function;
		};
		static_assert(sizeof(s_s_animation_ik_point) == 40, "struct s_s_animation_ik_point is invalid size");

		struct s_s_animation_ik_set_item
		{
			short ik_point;
			c_flags<e_iksetitemflags, short, k_iksetitemflags_count> flags;
		};
		static_assert(sizeof(s_s_animation_ik_set_item) == 4, "struct s_s_animation_ik_set_item is invalid size");

		struct s_s_animation_ik_set
		{
			string_id name;
			c_flags<e_iksetflags, long, k_iksetflags_count> flags;
			c_typed_tag_block<s_s_animation_ik_set_item> ik_points_block;
		};
		static_assert(sizeof(s_s_animation_ik_set) == 20, "struct s_s_animation_ik_set is invalid size");

		struct s_i343animationikgroundfittingchain
		{

			/* Chain Drivers */

			long start_junction;
			long end_junction;
			real probe_distance;
			real angle_threshold;
			real maximum_rate;
		};
		static_assert(sizeof(s_i343animationikgroundfittingchain) == 20, "struct s_i343animationikgroundfittingchain is invalid size");

		struct s_animationgraphik
		{

			/* IK Junctions */

			c_typed_tag_block<s_animationikjunction> ik_junctions_block;

			/* IK Chains */

			c_typed_tag_block<s_s_animation_ik_chain> ik_chains_block;
			c_typed_tag_block<s_s_animation_ik_leg_definition> ik_leg_definitions_block;
			c_typed_tag_block<s_s_animation_ik_arm_definition> ik_arm_definitions_block;

			/* Points and Sets */

			c_typed_tag_block<s_s_animation_ik_point> ik_point_block;
			c_typed_tag_block<s_s_animation_ik_set> ik_sets_block;

			/* Ground-fit chains */

			c_typed_tag_block<s_i343animationikgroundfittingchain> groundfit_ik_chains_block;
		};
		static_assert(sizeof(s_animationgraphik) == 84, "struct s_animationgraphik is invalid size");

		struct s_animation_skeleton
		{
			s_anytag_struct_definition anytag;
			s_animationgraphskeleton skeleton;
			s_animationgraphik ik;
		};
		static_assert(sizeof(s_animation_skeleton) == 152, "struct s_animation_skeleton is invalid size");

		struct s_i343contenttagsvariantmodelhittype
		{
			string_id variant_name;
			c_enum<e_i343contenttagsmodelhittypeoverride, char> use_model_hit_override;
			char generated_padf148[3]; // padding
		};
		static_assert(sizeof(s_i343contenttagsvariantmodelhittype) == 8, "struct s_i343contenttagsvariantmodelhittype is invalid size");

		struct s_assetsoundtag
		{
			s_anytag_struct_definition anytag;
			c_enum<e_i343contenttagsmodelhittype, char> use_model_hit;
			char generated_padddab[3]; // padding
			c_typed_tag_block<s_i343contenttagsvariantmodelhittype> per_variant_model_hit_block;
		};
		static_assert(sizeof(s_assetsoundtag) == 32, "struct s_assetsoundtag is invalid size");

		struct s_assetcategorysettingpersku
		{
			real_bounds lod_distance_multiplier;
			// custom lod_splitscreen_multipliers
			real lod___2_player_splitscreen;
			real lod___3_player_splitscreen;
			real lod___4_player_splitscreen;
			// custom value
			dword number_of_lods_to_skip;
			real_bounds hide_after_distance_multiplier;
			// custom hide_after_distance_splitscreen_multipliers
			real had___2_player_splitscreen;
			real had___3_player_splitscreen;
			real had___4_player_splitscreen;
			// custom value
			real static_io_shadow_casting_maximum_distance;
			real dynamic_object_shadow_casting_maximum_distance;
			real dynamic_object_cast_shadow_outside_of_camera_frustum_distance;
		};
		static_assert(sizeof(s_assetcategorysettingpersku) == 56, "struct s_assetcategorysettingpersku is invalid size");

		struct s_assetcategorysetting
		{
			string_id name;
			string_id editor_group;
			// custom low_setting
			s_assetcategorysettingpersku low_setting;
			// custom value
			// custom medium_setting
			s_assetcategorysettingpersku medium_setting;
			// custom value
			// custom high_setting
			s_assetcategorysettingpersku high_setting;
			// custom value
			// custom ultra_setting
			s_assetcategorysettingpersku ultra_setting;
			// custom value
			c_enum<e_assetcategorysettingshadowcastingoption, char> shadow_casting;
			char generated_pad4ade[3]; // padding
			real shadow_distance;
			c_enum<e_assetcategorysettingexcludefromddgioption, char> exclude_from_ddgi;
			c_enum<e_assetcategorysettingexcludefromdxroption, char> exclude_from_dxr;
			char generated_pad9793[2]; // padding
		};
		static_assert(sizeof(s_assetcategorysetting) == 244, "struct s_assetcategorysetting is invalid size");

		struct s_assetcategoryglobalstag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_assetcategorysetting> asset_category_globals_block;
			char generated_pad66d4[4]; // padding
		};
		static_assert(sizeof(s_assetcategoryglobalstag) == 32, "struct s_assetcategoryglobalstag is invalid size");

		struct s_functiondefinitiondefaultone
		{
			// custom value
			s_tag_data data;
			// custom value
		};
		static_assert(sizeof(s_functiondefinitiondefaultone) == 20, "struct s_functiondefinitiondefaultone is invalid size");

		struct s_scalarfunctionnamedefaultone
		{
			// custom function
			s_functiondefinitiondefaultone function;
		};
		static_assert(sizeof(s_scalarfunctionnamedefaultone) == 20, "struct s_scalarfunctionnamedefaultone is invalid size");

		struct s_volumetexturefogglobals
		{

			/* Volume Texture Fog Non-blending Parameters */

			c_typed_tag_reference<BITMAP_TAG> fog_bitmap;
			real texture_repeat_rate;
			real distance_between_sheets;
			real depth_fade_factor;
			real transparent_sort_distance;
			c_enum<e_e_transparent_sort_layer, char> transparent_sort_layer;
			c_flags<e_volumetexturefogglobalsflags, char, k_volumetexturefogglobalsflags_count> flags;
			char generated_pad2c77[2]; // padding
			s_scalarfunctionnamedefaultone wind_strength_across_distance;
		};
		static_assert(sizeof(s_volumetexturefogglobals) == 56, "struct s_volumetexturefogglobals is invalid size");

		struct s_s_atmosphere_globals
		{
			s_anytag_struct_definition anytag;
			s_volumetexturefogglobals volume_texture_fog_globals;
		};
		static_assert(sizeof(s_s_atmosphere_globals) == 72, "struct s_s_atmosphere_globals is invalid size");

		struct s_animchannelentry
		{
			string_id channel;
		};
		static_assert(sizeof(s_animchannelentry) == 4, "struct s_animchannelentry is invalid size");

		struct s_animtokenglobalstag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_animchannelentry> channels_block;
			string_id internal_stringeditorproxy;
			string_id internal_intcontrolparameternamestringeditorproxy;
			string_id internal_floatcontrolparameternamestringeditorproxy;
			string_id internal_boolcontrolparameternamestringeditorproxy;
			string_id internal_stringcontrolparameternamestringeditorproxy;
			string_id internal_vectorcontrolparameternamestringeditorproxy;
			char generated_padee72[4]; // padding
		};
		static_assert(sizeof(s_animtokenglobalstag) == 56, "struct s_animtokenglobalstag is invalid size");

		struct s_audiogamebucketthreatsetup
		{
			real min_threat_value;
			short character_count;
			char generated_pad482f[2]; // padding
		};
		static_assert(sizeof(s_audiogamebucketthreatsetup) == 8, "struct s_audiogamebucketthreatsetup is invalid size");

		struct s_audiogamecontextualthreatsetup
		{
			real min;
			real max;
			real_fraction weight;
			real time;
			c_flags<e_audiogamethreatdefinitionflags, char, k_audiogamethreatdefinitionflags_count> flags;
			c_enum<e_audiogamethreatcontext, char> context;
			char generated_pad8e86[2]; // padding
		};
		static_assert(sizeof(s_audiogamecontextualthreatsetup) == 20, "struct s_audiogamecontextualthreatsetup is invalid size");

		struct s_audiogamethreatlogicinstance
		{
			string_id rtpc_name;
			string_id multiplayer_rtpc_name;
			string_id btb_rtpc_name;
			c_typed_tag_block<s_audiogamebucketthreatsetup> buckets_block;
			c_typed_tag_block<s_audiogamecontextualthreatsetup> damage_block;
			c_typed_tag_block<s_audiogamecontextualthreatsetup> distance_block;

			/* Aiming Min/Max settings */

			c_typed_tag_block<s_audiogamecontextualthreatsetup> aiming_block;

			/* Allegiance Min/Max settings */

			c_typed_tag_block<s_audiogamecontextualthreatsetup> allegiance_block;
			c_typed_tag_block<s_audiogamecontextualthreatsetup> targeting_block;
			c_typed_tag_block<s_audiogamecontextualthreatsetup> scariness_block;
			real min_threat_value;
			byte default_bucket;
			char generated_pad688d[3]; // padding
		};
		static_assert(sizeof(s_audiogamethreatlogicinstance) == 104, "struct s_audiogamethreatlogicinstance is invalid size");

		struct s_audiogameaudiothreatglobalsdefinition
		{
			s_anytag_struct_definition anytag;
			// custom audio_threat_globals

			/* Audio Threat System Global Settings */

			c_typed_tag_block<s_audiogamethreatlogicinstance> audio_threats_block;
			// custom value
			char generated_pad25d5[4]; // padding
		};
		static_assert(sizeof(s_audiogameaudiothreatglobalsdefinition) == 32, "struct s_audiogameaudiothreatglobalsdefinition is invalid size");

		struct s_deathdamageregion
		{
			c_enum<e_damagepart, char> damaged_region;
		};
		static_assert(sizeof(s_deathdamageregion) == 1, "struct s_deathdamageregion is invalid size");

		struct s_ragdolldeathblendfunction
		{
			string_id name;
			c_flags<e_poweredragdollblendflags, char, k_poweredragdollblendflags_count> flags;
			char generated_pad9986[3]; // padding
			s_scalarfunctionname blend_function;
			string_id ragdoll_subgroup;
		};
		static_assert(sizeof(s_ragdolldeathblendfunction) == 32, "struct s_ragdolldeathblendfunction is invalid size");

		struct s_s_death_program_selector_velocity_gate
		{
			real minimum_velocity;
			c_enum<e_deathprogramresult, long> death_program;
			real death_program_scale;
			real acceleration_direction_adjust_z;
			real fallback_death_program_scale;
			real fallback_acceleration_direction_adjust_z;
			real powered_ragdoll_impact_radius;
			string_id death_animation_stance;
			c_flags<e_velocitygateflags, char, k_velocitygateflags_count> flags;
			char generated_pad2cfd[3]; // padding
			// custom animate_then_ragdoll
			angle ragdoll_animation_bypass_angle;
			char cosine_angle[4]; // skip
			// custom value
			// custom powered_ragdoll
			real blend_duration;

			/* Blend functions */

			c_typed_tag_block<s_ragdolldeathblendfunction> blend_functions_block;
			// custom value
			// custom motor_driven_ragdoll
			real_fraction keyframe_threshold;
			// custom value
			// custom explosion_ragdoll
			real explosion_radius;
			s_scalarfunctionname explosion_impulse_curve;
			// custom value
		};
		static_assert(sizeof(s_s_death_program_selector_velocity_gate) == 88, "struct s_s_death_program_selector_velocity_gate is invalid size");

		struct s_s_death_program_selector_damage_type
		{

			/* Triggering Damage Source */

			s_i343damagedamagesourcedefinition damagesource;

			/* Damaged Regions */

			c_typed_tag_block<s_deathdamageregion> damage_regions_block;
			c_typed_tag_block<s_s_death_program_selector_velocity_gate> velocity_block;
		};
		static_assert(sizeof(s_s_death_program_selector_damage_type) == 28, "struct s_s_death_program_selector_damage_type is invalid size");

		struct s_s_death_program_selector_special
		{
			c_enum<e_objectdamageaftermathspecialdamagetype, long> special_type;
			c_typed_tag_block<s_s_death_program_selector_damage_type> damage_type_block;
		};
		static_assert(sizeof(s_s_death_program_selector_special) == 16, "struct s_s_death_program_selector_special is invalid size");

		struct s_s_death_program_selector
		{
			s_anytag_struct_definition anytag;
			// custom explanation

			/* Death Program Selection */

			// custom value
			c_typed_tag_reference<DEATH_PROGRAM_SELECTOR_TAG> parent;
			c_typed_tag_block<s_s_death_program_selector_special> special_type_block;
		};
		static_assert(sizeof(s_s_death_program_selector) == 44, "struct s_s_death_program_selector is invalid size");

		struct s_behaviornodesettings
		{
			c_enum<e_behaviorindex, short> behavior;
			c_flags<e_behaviornodeoverrideflags, short, k_behaviornodeoverrideflags_count> override;
			c_enum<e_behaviorchecktype, short> type;
			c_enum<e_behaviortimer, short> timer;
			c_enum<e_e_stimulus, short> stimulus;
			char generated_pad52cf[2]; // padding
			real seconds;
			// custom static_args
			c_flags<e_behaviornodevalidargsflags, short, k_behaviornodevalidargsflags_count> valid_args;
			char generated_pad061a[2]; // padding
			short short_0;
			short short_1;
			real real_0;
			// custom value
		};
		static_assert(sizeof(s_behaviornodesettings) == 28, "struct s_behaviornodesettings is invalid size");

		struct s_behaviornodechildindex
		{
			short child;
		};
		static_assert(sizeof(s_behaviornodechildindex) == 2, "struct s_behaviornodechildindex is invalid size");

		struct s_behaviornodedefinition
		{
			c_typed_tag_reference<BEHAVIORTREE_TAG> sub_tree;
			// custom settings
			s_behaviornodesettings settings;
			// custom value
			c_typed_tag_block<s_behaviornodechildindex> children_block;
		};
		static_assert(sizeof(s_behaviornodedefinition) == 56, "struct s_behaviornodedefinition is invalid size");

		struct s_behaviortreedefinition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_behaviornodedefinition> nodes_block;
			char generated_padd2e7[4]; // padding
		};
		static_assert(sizeof(s_behaviortreedefinition) == 32, "struct s_behaviortreedefinition is invalid size");

		struct s_s_bink_definition
		{
			s_anytag_struct_definition anytag;
			long frame_count;
			char generated_pad3c54[4]; // padding
		};
		static_assert(sizeof(s_s_bink_definition) == 24, "struct s_s_bink_definition is invalid size");

		struct s_bitmapdictionaryentrydefinition
		{
			string_id identifier;
			c_typed_tag_reference<BITMAP_TAG> bitmap;
			short bitmap_index;
			char generated_pade5bc[2]; // padding
		};
		static_assert(sizeof(s_bitmapdictionaryentrydefinition) == 24, "struct s_bitmapdictionaryentrydefinition is invalid size");

		struct s_bitmapdictionarymultiactionsetdefinition
		{

			/* Multi actions */

			string_id identifier;
			string_id action_1;
			string_id action_2;
			string_id action_3;
			string_id action_4;

			/* Invalid multi action flags */

			c_flags<e_invalidbitmapmultiactiontypeflags, short, k_invalidbitmapmultiactiontypeflags_count> invalidation_flags;
			char generated_pad2033[2]; // padding
		};
		static_assert(sizeof(s_bitmapdictionarymultiactionsetdefinition) == 24, "struct s_bitmapdictionarymultiactionsetdefinition is invalid size");

		struct s_bitmapdictionarycombinedbitmapdefiniton
		{

			/* Combined bitmaps */

			string_id bitmap_1;
			string_id bitmap_2;
			string_id bitmap_3;
			string_id bitmap_4;
			string_id combined;
		};
		static_assert(sizeof(s_bitmapdictionarycombinedbitmapdefiniton) == 20, "struct s_bitmapdictionarycombinedbitmapdefiniton is invalid size");

		struct s_bitmapdictionarydefinition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_bitmapdictionaryentrydefinition> entries_block;
			c_typed_tag_block<s_bitmapdictionarymultiactionsetdefinition> multi_actions_block;
			c_typed_tag_block<s_bitmapdictionarycombinedbitmapdefiniton> combined_bitmaps_block;
			char generated_pad39d8[4]; // padding
		};
		static_assert(sizeof(s_bitmapdictionarydefinition) == 56, "struct s_bitmapdictionarydefinition is invalid size");

		struct s_bitmapusage
		{
			string_id name;
			string_id editor_group;
			real source_gamma;
			c_enum<e_bitmapcurve, char> bitmap_curve;
			c_flags<e_bitmapusagebitmapusageflag, char, k_bitmapusagebitmapusageflag_count> flags;
			c_enum<e_bitmapusagebitmapslicer, char> slicer;
			c_flags<e_bitmapusagebitmapdicerflag, char, k_bitmapusagebitmapdicerflag_count> dicer_flags;
			c_enum<e_bitmapusagebitmappacker, char> packer;
			c_flags<e_bitmapusagebitmappackerflag, char, k_bitmapusagebitmappackerflag_count> packer_flags;
			c_enum<e_bitmaptype, char> type;
			char mipmap_limit;
			c_enum<e_bitmapusagebitmapsmallestmip, char> smallest_mip;
			c_enum<e_bitmapusagebitmapdownsamplefilter, char> downsample_filter;
			char filter_radius_bias;
			char generated_pad122e[1]; // padding
			c_flags<e_bitmapusagebitmapdownsampleflag, short, k_bitmapusagebitmapdownsampleflag_count> downsample_flags;
			char generated_pad5ee3[2]; // padding
			rgb_color sprite_background_color;
			c_enum<e_floatmapswizzle, char> swizzle_red;
			c_enum<e_floatmapswizzle, char> swizzle_green;
			c_enum<e_floatmapswizzle, char> swizzle_blue;
			c_enum<e_floatmapswizzle, char> swizzle_alpha;
			c_enum<e_bitmapusagebitmapforcedformat, short> bitmap_format;
			c_enum<e_bitmapcolorspace, char> source_color_space;
			c_enum<e_bitmapcolorspace, char> target_color_space;
		};
		static_assert(sizeof(s_bitmapusage) == 48, "struct s_bitmapusage is invalid size");

		struct s_bitmapgroupsprite
		{
			short bitmap_index;
			char generated_pad2095[2]; // padding
			real left;
			real right;
			real top;
			real bottom;
			real_point2d registration_point;
		};
		static_assert(sizeof(s_bitmapgroupsprite) == 28, "struct s_bitmapgroupsprite is invalid size");

		struct s_bitmapgroupsequence
		{
			c_static_string<32> name;
			short first_bitmap_index;
			short bitmap_count;
			c_typed_tag_block<s_bitmapgroupsprite> sprites_block;
		};
		static_assert(sizeof(s_bitmapgroupsequence) == 48, "struct s_bitmapgroupsequence is invalid size");

		struct s_bitmapsourcefile
		{
			c_static_string<256> path;
		};
		static_assert(sizeof(s_bitmapsourcefile) == 256, "struct s_bitmapsourcefile is invalid size");

		struct s_sourcepaths
		{
			c_static_string<256> source_path;
			c_typed_tag_block<s_bitmapsourcefile> intermediate_paths_block;
		};
		static_assert(sizeof(s_sourcepaths) == 268, "struct s_sourcepaths is invalid size");

		struct s_bitmapdata
		{
			short width;
			short height;
			word depth;
			c_enum<e_bitmaptype, char> type;
			char generated_paddca3[1]; // padding
			c_enum<e_bitmapformat, short> format;
			c_flags<e_bitmapflags, short, k_bitmapflags_count> flags;
			char mipmap_count;
			c_enum<e_bitmapcurve, char> curve;
			char generated_pad8fee[2]; // padding
			real streaming_scale;
			short sourcewidth;
			short sourceheight;
			s_tag_resource bitmap_resource_handle;
		};
		static_assert(sizeof(s_bitmapdata) == 32, "struct s_bitmapdata is invalid size");

		struct s_bitmapgroup
		{
			s_anytag_struct_definition anytag;
			// custom show_bitmap

			/* IMPORT SETTINGS */

			dword usage;
			string_id usageid;
			string_id package;
			string_id texture_group;
			c_flags<e_bitmapgroupbitmapgroupflags, long, k_bitmapgroupbitmapgroupflags_count> flags;
			short sprite_spacing;
			short mip_sample_count;
			real bump_map_height;
			real_fraction fade_factor;
			real blur;
			real mip_map_blur;
			c_enum<e_bitmapgroupcurveoverride, char> curve_mode;
			char max_mipmap_level;
			short max_resolution;
			c_enum<e_bitmapusagebitmapforcedformat, short> force_bitmap_format;
			// custom reset_usage_override
			c_enum<e_bitmapgroupsigneddistancefieldmethod, char> sdf_generation;
			char target_platform;
			short spread_factor;
			char generated_pad8ed2[2]; // padding
			c_typed_tag_block<s_bitmapusage> usage_override_block;
			c_typed_tag_block<s_bitmapgroupsequence> manual_sequences_block;

			/* IMPORT DATA */

			s_tag_data source_data;
			c_typed_tag_block<s_sourcepaths> source_paths_block;
			qword source_checksum;
			argb_color min_color;
			argb_color max_color;
			c_typed_tag_block<s_bitmapgroupsequence> sequences_block;
			c_typed_tag_block<s_bitmapdata> bitmaps_block;
		};
		static_assert(sizeof(s_bitmapgroup) == 188, "struct s_bitmapgroup is invalid size");

		struct s_bitmapusagetablebitmapsuffixes
		{
			string_id suffix;
			string_id usage;
		};
		static_assert(sizeof(s_bitmapusagetablebitmapsuffixes) == 8, "struct s_bitmapusagetablebitmapsuffixes is invalid size");

		struct s_bitmapusagetablebackcompatusage
		{
			c_enum<e_globalbitmapusage, long> usage_enum;
			string_id usage;
		};
		static_assert(sizeof(s_bitmapusagetablebackcompatusage) == 8, "struct s_bitmapusagetablebackcompatusage is invalid size");

		struct s_bitmapusagetable
		{
			s_anytag_struct_definition anytag;

			/* Bitmap usage definitions */

			c_typed_tag_block<s_bitmapusage> bitmap_usage_definitions_block;
			c_typed_tag_block<s_bitmapusagetablebitmapsuffixes> bitmap_suffixes_block;

			/* Usage Backcompat */

			c_typed_tag_block<s_bitmapusagetablebackcompatusage> usage_backcompat_block;
			char generated_pad2824[4]; // padding
		};
		static_assert(sizeof(s_bitmapusagetable) == 56, "struct s_bitmapusagetable is invalid size");

		struct s_s_real_sector_point_generic_volume
		{
			real_point3d position;
		};
		static_assert(sizeof(s_s_real_sector_point_generic_volume) == 12, "struct s_s_real_sector_point_generic_volume is invalid size");

		struct s_genericvolumenativepoint2d
		{
			real_point2d point;
		};
		static_assert(sizeof(s_genericvolumenativepoint2d) == 8, "struct s_genericvolumenativepoint2d is invalid size");

		struct s_genericvolume
		{
			c_typed_tag_block<s_s_real_sector_point_generic_volume> points_block;
			real height;
			real sink;
			real_point3d center_point;
			real trivial_cull_radius_squared;
			real_point3d aabbcenter;
			real_point3d aabbextents;
			c_typed_tag_block<s_genericvolumenativepoint2d> nativepoints2d_block;
		};
		static_assert(sizeof(s_genericvolume) == 72, "struct s_genericvolume is invalid size");

		struct s_editormetadata
		{
			c_static_string<256> folder_name;
			real_point3d local_space_pivot_point_position;
		};
		static_assert(sizeof(s_editormetadata) == 268, "struct s_editormetadata is invalid size");

		struct s_lightmappriorityvolume
		{
			string_id name;
			// custom volume_settings
			s_genericvolume volume;
			// custom value
			real volume_priority;
			real lightmap_priority;
			c_enum<e_lightmapexclusionboolean, short> exclude_shadow_geometry;
			c_enum<e_lightmapexclusionboolean, short> exclude_per_pixel_lighting;
			c_enum<e_lightmapexclusionboolean, short> exclude_analytic_sun_contribution;
			c_enum<e_lightmapexclusionboolean, short> exclude_analytic_light_contribution;
			c_typed_tag_block<s_editormetadata> editormetadata_block;
			c_typed_tag_reference<SCENARIO_STRUCTURE_BSP_TAG> owner_bsp;
			string_id owner_variant;
			short runtime_bsp_index;
			short runtime_variant_index;
		};
		static_assert(sizeof(s_lightmappriorityvolume) == 128, "struct s_lightmappriorityvolume is invalid size");

		struct s_airprobedensityvolume
		{
			string_id name;
			// custom volume_settings
			s_genericvolume volume;
			// custom value
			real air_probe_density;
			c_typed_tag_block<s_editormetadata> editormetadata_block;
			c_typed_tag_reference<SCENARIO_STRUCTURE_BSP_TAG> owner_bsp;
			string_id owner_variant;
			short runtime_bsp_index;
			short runtime_variant_index;
		};
		static_assert(sizeof(s_airprobedensityvolume) == 116, "struct s_airprobedensityvolume is invalid size");

		struct s_airproberegionvolume
		{
			string_id name;
			// custom volume_settings
			s_genericvolume volume;
			// custom value
			c_typed_tag_block<s_editormetadata> editormetadata_block;
			c_typed_tag_reference<SCENARIO_STRUCTURE_BSP_TAG> owner_bsp;
			string_id owner_variant;
			short runtime_bsp_index;
			short runtime_variant_index;
			real probe_xy_spacing;
			real probe_z_spacing;
			long volume_priority;
			real blend_radius_xy;
			real blend_radius_z;
			c_flags<e_airproberegionvolumeflags, short, k_airproberegionvolumeflags_count> flags;
			char generated_pad0802[2]; // padding
			real probe_offset_above_ground;
			long number_of_z_layers;
		};
		static_assert(sizeof(s_airproberegionvolume) == 144, "struct s_airproberegionvolume is invalid size");

		struct s_s_dumpling_sector_point
		{
			real_point3d position;
		};
		static_assert(sizeof(s_s_dumpling_sector_point) == 12, "struct s_s_dumpling_sector_point is invalid size");

		struct s_s_scenario_dumpling
		{
			c_typed_tag_block<s_s_dumpling_sector_point> inner_points_block;
			c_typed_tag_block<s_s_dumpling_sector_point> outer_points_block;
			real height;
			real sink;
			real inner_value;
			real outer_value;
			real_point3d center_point;
			real trivial_cull_radius_squared;
			real bound_volume;
		};
		static_assert(sizeof(s_s_scenario_dumpling) == 60, "struct s_s_scenario_dumpling is invalid size");

		struct s_cubemapvolume
		{
			string_id name;
			c_flags<e_cubemapflagsclass, long, k_cubemapflagsclass_count> flags;
			s_s_scenario_dumpling dumpling;
			c_typed_tag_reference<BITMAP_TAG> cubemap_bitmap;
			c_enum<e_cubemapboolean, short> enable_parallax_correction;
			short cubemap_volume_priority;
			real_point3d cubemap_origin;
			real_vector3d depth_positive;
			real_vector3d depth_negative;
			c_enum<e_cubemapboolean, short> active_volume;
			c_enum<e_cubemapsizeclassification, short> maximum_cubemap_size;
			real_point3d intensity;
			real self_illum_scale_down;
			c_typed_tag_block<s_editormetadata> editormetadata_block;
			c_typed_tag_reference<SCENARIO_STRUCTURE_BSP_TAG> owner_bsp;
			string_id owner_variant;
			short runtime_bsp_index;
			short runtime_variant_index;
			real blend_distance;
			c_enum<e_cubemapvolumetype, long> cubemap_volume_type;
			real orientation;
			c_typed_tag_reference<BITMAP_TAG> cubemap_depth_bitmap;
			real depth_blend_range;
			real intensity_scale;
			c_enum<e_cubemapboolean, short> tintable;
			char generated_pad93d5[2]; // padding
		};
		static_assert(sizeof(s_cubemapvolume) == 220, "struct s_cubemapvolume is invalid size");

		struct s_bsplightingvolumes
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_lightmappriorityvolume> lightmap_priority_volumes_block;
			c_typed_tag_block<s_airprobedensityvolume> air_probe_density_volumes_block;
			c_typed_tag_block<s_airproberegionvolume> air_probe_region_volumes_block;
			c_typed_tag_block<s_cubemapvolume> cubemap_volumes_block;
		};
		static_assert(sizeof(s_bsplightingvolumes) == 64, "struct s_bsplightingvolumes is invalid size");

		struct s_i343benchmarkbenchmarkcompositioninfo
		{
			c_static_string<256> display_name;
			string_id composition_id;
			c_flags<e_i343benchmarkbenchmarkcompositionflags, char, k_i343benchmarkbenchmarkcompositionflags_count> flags;
			char generated_pad3ea5[3]; // padding
		};
		static_assert(sizeof(s_i343benchmarkbenchmarkcompositioninfo) == 264, "struct s_i343benchmarkbenchmarkcompositioninfo is invalid size");

		struct s_i343benchmarkbenchmarkmap
		{
			c_static_string<256> map;
			c_typed_tag_block<s_i343benchmarkbenchmarkcompositioninfo> benchmark_compositions_block;
		};
		static_assert(sizeof(s_i343benchmarkbenchmarkmap) == 268, "struct s_i343benchmarkbenchmarkmap is invalid size");

		struct s_i343benchmarkbenchmarkdefinition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343benchmarkbenchmarkmap> benchmarks_block;
			char generated_pad1294[4]; // padding
		};
		static_assert(sizeof(s_i343benchmarkbenchmarkdefinition) == 32, "struct s_i343benchmarkbenchmarkdefinition is invalid size");

		struct s_boost
		{
			c_typed_tag_reference<COLLISION_DAMAGE_TAG> boost_collision_damage;
			c_flags<e_boostboostflags, long, k_boostboostflags_count> flags;
			real boost_peak_power;
			real boost_rise_time;
			real boost_fall_time;
			real boost_power_per_second;
			real boost_low_warning_threshold;
			real recharge_rate;
			real recharge_delay;
			real post_boost_weapon_delay;
			// custom trigger_to_boost
			s_functiondefinition trigger_to_boost;
			c_enum<e_i343collectibletutorial, long> tutorial_id;
		};
		static_assert(sizeof(s_boost) == 76, "struct s_boost is invalid size");

		struct s_i343unitsboostdefinition
		{
			s_anytag_struct_definition anytag;
			s_boost boost;
			char generated_pada510[4]; // padding
		};
		static_assert(sizeof(s_i343unitsboostdefinition) == 96, "struct s_i343unitsboostdefinition is invalid size");

		struct s_botbackfilltuningdefinition
		{
			// custom bot_backfill
			real mmr_threshold_for_recruit;
			real mmr_threshold_for_marine;
			real mmr_threshold_for_odst;
			real mmr_threshold_for_spartan;
			// custom value
		};
		static_assert(sizeof(s_botbackfilltuningdefinition) == 16, "struct s_botbackfilltuningdefinition is invalid size");

		struct s_bothysteresistuningdefinition
		{
			// custom hysteresis
			real hysteresis_max_amount;
			real hysteresis_timeout_seconds;
			// custom value
		};
		static_assert(sizeof(s_bothysteresistuningdefinition) == 8, "struct s_bothysteresistuningdefinition is invalid size");

		struct s_bottraversalpropertiesdefinition
		{
			// custom traversal_properties
			real destination_evaluation_tolerance;
			real random_neighbor_selection_chance;
			real start_sprint_evaluation_tolerance;
			real stop_sprint_evaluation_tolerance;
			angle bot_angular_turn_velocity;
			angle bot_angular_turn_acceleration;
			real bot_stuck_time_timeout;
			real bot_end_of_path_tolerance_distance_sq;
			real wrong_path_direction_timeout;
			real ledge_fall_distance_sq;
			real waypoint_path_distance;
			angle jump_hint_facing_threshold_no_clamber;
			// custom value
		};
		static_assert(sizeof(s_bottraversalpropertiesdefinition) == 48, "struct s_bottraversalpropertiesdefinition is invalid size");

		struct s_botmeleetuningdefinition
		{
			// custom melee
			real melee_min_delay_time;
			real melee_max_delay_time;
			real melee_striking_distance_no_melee_weapon;
			real melee_striking_distance_with_melee_weapon;
			real minimum_melee_distance;
			real max_melee_distance_no_equipment;
			real max_melee_distance_with_objective;
			real min_melee_grapple_distance;
			real max_melee_distance_with_grapple_hook;
			real max_enemy_health_for_unarmed_grapple;
			real restrict_melee_knockback_weapon_desirability_min;
			real target_low_shield_vitality_threshold;
			real low_confidence_threshold;
			angle target_is_facing_away_angle_threshold;
			// custom value
		};
		static_assert(sizeof(s_botmeleetuningdefinition) == 56, "struct s_botmeleetuningdefinition is invalid size");

		struct s_botcombattuningdefinition
		{
			// custom combat
			s_botmeleetuningdefinition melee;
			// custom strafing
			real strafe_min_time;
			real strafe_max_time;
			real halt_strafe_chance;
			real halt_strafe_min_time;
			real halt_strafe_max_time;
			real halt_strafe_min_time_initial;
			real halt_strafe_max_time_initial;
			// custom value
			// custom vertical_movement
			real vertical_movement_min_delay_time;
			real vertical_movement_max_delay_time;
			real vertical_movement_crouch_chance;
			real crouch_hold_time;
			real vertical_movement_jump_check_height;
			angle target_is_aiming_check_threshold;
			real avoid_dangerous_object_jump_chance;
			// custom value
			// custom grenades
			real grenade_delay_min_time;
			real grenade_delay_noise_time;
			real grenade_min_target_distance;
			real grenade_max_target_distance;
			real grenade_distance_in_front_of_target_feet;
			real low_ground_height_threshold;
			// custom value
			real disengage_confidence_threshold;
			real evade_min_delay_time;
			real evade_max_delay_time;
			real combat_error_magnitude;
			real minimum_error_magnitude;
			real target_velocity_max_noise_threshhold_sq;
			real targeting_error_from_velocity_weight;
			real targeting_error_recalculation_time_min;
			real targeting_error_recalculation_time_max;
			angle desired_vs_actual_aiming_differential_allowance;
			real predictability_velocity_magnitude_change_threshold;
			angle predictability_velocity_direction_change_threshhold;
			real predictability_error_gain_rate;
			real predictability_error_decay_rate;
			real maximum_aiming_offset;
			real combat_weapon_switch_desirability_delta;
			real combat_weapon_switch_distance_delta;
			real initial_hide_point_search_radius;
			real location_sensor_activation_distance_sq;
			real disengage_max_jump_height;
			// custom value
		};
		static_assert(sizeof(s_botcombattuningdefinition) == 216, "struct s_botcombattuningdefinition is invalid size");

		struct s_bottargetpriorityinputdefinition
		{
			c_enum<e_i343botsbottargetpriorityinput, short> input;
			char generated_pad9bc9[2]; // padding
			real weight;
		};
		static_assert(sizeof(s_bottargetpriorityinputdefinition) == 8, "struct s_bottargetpriorityinputdefinition is invalid size");

		struct s_botawarenesstuningdefinition
		{
			// custom awareness
			real max_ground_awareness_distance;
			real max_air_awareness_distance;
			angle fov_degrees;
			real threat_sensor_awareness_distance;
			real active_camo_invisibility_threshold;
			real danger_decay_rate_per_second;
			real clairvoyance_max_time;
			real clairvoyance_max_distance;
			real dangerous_object_awareness_distance;
			real dangerous_object_max_time_to_damage;
			angle dangerous_object_approaching_bot_angle;
			real moving_dangerous_object_min_speed;
			real chance_to_notice_new_dangerous_objects_per_second;
			real dangerous_object_danger_radius_scalar;
			real target_hysteresis_max_amount;
			real target_hysteresis_timeout_seconds;
			c_typed_tag_block<s_bottargetpriorityinputdefinition> target_priority_calculation_inputs_block;
			// custom value
		};
		static_assert(sizeof(s_botawarenesstuningdefinition) == 76, "struct s_botawarenesstuningdefinition is invalid size");

		struct s_botguardbehaviortuningdefinition
		{
			// custom guard
			real min_guard_look_time;
			real max_guard_look_time;
			real min_guard_look_rotation_angle;
			real max_guard_look_rotation_angle;
			real guard_volume_boundary_width;
			real max_patrol_time;
			real min_patrol_pause_time;
			real max_patrol_pause_time;
			real min_guard_distance;
			// custom value
		};
		static_assert(sizeof(s_botguardbehaviortuningdefinition) == 36, "struct s_botguardbehaviortuningdefinition is invalid size");

		struct s_botpickuptuningdefinition
		{
			// custom pickup
			real pickup_distance_sq;
			real pathless_distance_sq;
			real item_pickup_delay;
			real weapon_pickup_cooldown;
			real item_observation_radius;
			// custom value
		};
		static_assert(sizeof(s_botpickuptuningdefinition) == 20, "struct s_botpickuptuningdefinition is invalid size");

		struct s_botweapondeftagblock
		{
			c_typed_tag_reference<WEAPON_TAG> approved_weapon_definition_tag;
			c_flags<e_botweaponusageflags, long, k_botweaponusageflags_count> weapon_usage_flags;
			real error_magnitude;
			real minimum_error_magnitude;
			real error_max_velocity_sq_threshold;
			real desirability;
			real min_distance_sq;
			real max_distance_sq;
		};
		static_assert(sizeof(s_botweapondeftagblock) == 44, "struct s_botweapondeftagblock is invalid size");

		struct s_botdifficultyleveltuningdefinition
		{
			c_enum<e_i343botsbotdifficultylevel, short> difficulty_level;
			char generated_pad637c[2]; // padding
			c_flags<e_botdifficultyflags, long, k_botdifficultyflags_count> difficulty_specific_flags;
			s_bothysteresistuningdefinition hysteresis;
			s_bottraversalpropertiesdefinition traversal_tuning;
			s_botcombattuningdefinition combat_tuning;
			s_botawarenesstuningdefinition awareness_tuning;
			s_botguardbehaviortuningdefinition guard_behavior_tuning;
			s_botpickuptuningdefinition pickup_tuning;
			c_typed_tag_block<s_botweapondeftagblock> weapon_tuning_block;
		};
		static_assert(sizeof(s_botdifficultyleveltuningdefinition) == 424, "struct s_botdifficultyleveltuningdefinition is invalid size");

		struct s_botequipmentdeftagblock
		{
			c_typed_tag_reference<EQUIPMENT_TAG> approved_equipment_definition_tag;
		};
		static_assert(sizeof(s_botequipmentdeftagblock) == 16, "struct s_botequipmentdeftagblock is invalid size");

		struct s_botadaptivetuningdefinition
		{
			// custom adaptive_difficulty
			real player_health_shooting_threshold;
			real max_movement;
			real max_aiming;
			real aiming_coefficient;
			real position_coefficient;
			real engagement_constant;
		};
		static_assert(sizeof(s_botadaptivetuningdefinition) == 24, "struct s_botadaptivetuningdefinition is invalid size");

		struct s_botglobals
		{
			s_anytag_struct_definition anytag;
			s_botbackfilltuningdefinition bot_backfill;
			c_typed_tag_block<s_botdifficultyleveltuningdefinition> difficulty_specific_tuning_block;
			c_typed_tag_block<s_botequipmentdeftagblock> approved_bot_equipment_block;
			c_typed_tag_block<s_botadaptivetuningdefinition> adaptive_difficulty_tuning_block;
			char generated_pad7603[4]; // padding
		};
		static_assert(sizeof(s_botglobals) == 72, "struct s_botglobals is invalid size");

		struct s_bitmappackagesettings
		{
			string_id name;
			string_id editor_group;
			c_flags<e_bitmappackagesettingsgroupflags, long, k_bitmappackagesettingsgroupflags_count> flags;
			c_enum<e_bitmappackagesettingsreductionrate, char> reduction_rate;
			char generated_padbb20[3]; // padding
			long minimum_texture_size;
		};
		static_assert(sizeof(s_bitmappackagesettings) == 20, "struct s_bitmappackagesettings is invalid size");

		struct s_bitmappackagetexturegroup
		{
			string_id name;
			string_id package;
		};
		static_assert(sizeof(s_bitmappackagetexturegroup) == 8, "struct s_bitmappackagetexturegroup is invalid size");

		struct s_bitmappackagesettingstable
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_bitmappackagesettings> settings_block;

			/* TEXTURE GROUPS */

			c_typed_tag_block<s_bitmappackagetexturegroup> texture_groups_block;
		};
		static_assert(sizeof(s_bitmappackagesettingstable) == 40, "struct s_bitmappackagesettingstable is invalid size");

		struct s_scenariobakedpvsvolume
		{
			string_id name;
			// custom volume_settings
			s_genericvolume volume;
			// custom value
			c_enum<e_scenariobakedpvsvolumeboolean, short> use_vertical_beam_count_override;
			c_enum<e_scenariobakedpvsvolumeboolean, short> use_beam_height_overrides;
			c_enum<e_scenariobakedpvsvolumeboolean, short> pin_the_beams_to_the_top_of_the_volume;
			c_enum<e_scenariobakedpvsvolumeboolean, short> add_beams_even_if_there_is_no_collision;
			long vertical_beam_count_override;
			real beam_1_height_override;
			real beam_2_height_override;
			real beam_3_height_override;
			real beam_4_and_above_height_override;
			long volume_importance_override_value;
			c_typed_tag_block<s_editormetadata> editormetadata_block;
			c_typed_tag_reference<SCENARIO_STRUCTURE_BSP_TAG> owner_bsp;
			short runtime_bsp_index;
			char generated_pad4130[2]; // padding
		};
		static_assert(sizeof(s_scenariobakedpvsvolume) == 140, "struct s_scenariobakedpvsvolume is invalid size");

		struct s_bspvolumes
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_scenariobakedpvsvolume> baked_pvs_volumes_block;
			char generated_pad512a[4]; // padding
		};
		static_assert(sizeof(s_bspvolumes) == 32, "struct s_bspvolumes is invalid size");

		struct s_i343cagesystemcagepoint
		{
			c_flags<e_i343cagesystemcagepointflags, char, k_i343cagesystemcagepointflags_count> flags;
			char generated_pad7a22[3]; // padding
			string_id name;
			c_enum<e_i343cagesystemcageoffsettype, char> offsettype;
			char generated_padc6d7[3]; // padding
			real_vector3d offsetposition;
			real_euler_angles3d offsetrotation;
			c_enum<e_i343cagesystemcagelocationtype, char> locationtype;
			char generated_pad138c[3]; // padding
			string_id locationname;
		};
		static_assert(sizeof(s_i343cagesystemcagepoint) == 44, "struct s_i343cagesystemcagepoint is invalid size");

		struct s_i343cagesystemcagedefinitiontag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343cagesystemcagepoint> points_block;
			char generated_pad90a9[4]; // padding
		};
		static_assert(sizeof(s_i343cagesystemcagedefinitiontag) == 32, "struct s_i343cagesystemcagedefinitiontag is invalid size");

		struct s_i343cagesystemcagepointdefault
		{
			string_id name;
			c_typed_tag_reference<CAGEDEFINITION_TAG> cage_definition;
			string_id point_name;
		};
		static_assert(sizeof(s_i343cagesystemcagepointdefault) == 24, "struct s_i343cagesystemcagepointdefault is invalid size");

		struct s_i343curvecurvereference
		{
			c_enum<e_i343curvecurvebuiltin, char> curve_type;
			char generated_pade4ec[3]; // padding
			c_typed_tag_reference<CURVEDEFINITION_TAG> curve_definition;
			string_id curve_name;
		};
		static_assert(sizeof(s_i343curvecurvereference) == 24, "struct s_i343curvecurvereference is invalid size");

		struct s_i343cagesystemcagetransitioncurve
		{
			c_typed_tag_reference<CURVEDEFINITION_TAG> animation_curve;
			string_id transform_curve_name;
			string_id focal_length_curve_name;
			string_id focus_distance_curve_name;
			string_id f_stop_curve_name;
			string_id perspective_curve_name;
			string_id variant_curve_name;
			string_id variant_name;
			real animation_time;
			real animation_playback_scalar;
		};
		static_assert(sizeof(s_i343cagesystemcagetransitioncurve) == 52, "struct s_i343cagesystemcagetransitioncurve is invalid size");

		struct s_i343cagesystemcageglobalsdefinitiontag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343cagesystemcagepointdefault> global_default_cage_points_block;
			c_typed_tag_reference<CAGEDEFINITION_TAG> default_cage_definition;
			string_id default_position_point;
			string_id default_collision_resolution_point;
			string_id default_orbit_center_point;
			string_id default_fps_point;
			real default_blend_in_time;
			real default_blend_out_time;
			real default_gaze_distance;
			angle default_gaze_outer_angle;
			angle default_gaze_inner_angle;
			angle default_gaze_velocity;
			// custom gaze_velocity_curve
			s_i343curvecurvereference default_gaze_velocity_curve;
			// custom value
			// custom transform_blend_curve
			s_i343curvecurvereference default_blend_curve_transform;
			// custom value
			// custom properties_blend_curve
			s_i343curvecurvereference default_blend_curve_properties;
			// custom value
			// custom from_gameplay_transition
			s_i343cagesystemcagetransitioncurve from_gameplay_transition;
			// custom value
			// custom to_gameplay_transition
			s_i343cagesystemcagetransitioncurve to_gameplay_transition;
			// custom value
			// custom camera_properties___old
			real default_focal_length;
			real default_focus_distance;
			real default_f_stop;
			// custom value
		};
		static_assert(sizeof(s_i343cagesystemcageglobalsdefinitiontag) == 272, "struct s_i343cagesystemcageglobalsdefinitiontag is invalid size");

		struct s_cameratrackcontrolpoint
		{
			real_vector3d position;
			real_quaternion orientation;
		};
		static_assert(sizeof(s_cameratrackcontrolpoint) == 28, "struct s_cameratrackcontrolpoint is invalid size");

		struct s_cameratracklens
		{
			c_flags<e_cameratracklensflags, char, k_cameratracklensflags_count> flags;
			char generated_pad783a[3]; // padding
			real focal_length;
			real focus_distance;
			real fstop;
			long bokeh_side_count;
		};
		static_assert(sizeof(s_cameratracklens) == 20, "struct s_cameratracklens is invalid size");

		struct s_cameratrack
		{
			c_flags<e_cameratrackflags, char, k_cameratrackflags_count> flags;
			char generated_padb652[3]; // padding
			c_typed_tag_block<s_cameratrackcontrolpoint> control_points_block;
			c_typed_tag_block<s_cameratracklens> lenses_block;
		};
		static_assert(sizeof(s_cameratrack) == 28, "struct s_cameratrack is invalid size");

		struct s_cameratrackanimation
		{
			string_id name;
			s_cameratrack track;
			long authored_fps;
		};
		static_assert(sizeof(s_cameratrackanimation) == 36, "struct s_cameratrackanimation is invalid size");

		struct s_cameraanimationgraph
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_cameratrackanimation> animations_block;
			char generated_pad38ed[4]; // padding
		};
		static_assert(sizeof(s_cameraanimationgraph) == 32, "struct s_cameraanimationgraph is invalid size");

		struct s_interfacecustomizationuicamerapresetsettings
		{
			c_enum<e_interfacecustomizationcorefocusmode, short> core_focus_mode;
			char generated_padbfbb[2]; // padding
			real camera_offset;
			real_vector3d camera_position_offset;
			real_euler_angles3d camera_facing;
			c_flags<e_interfacecustomizationuidofflags, char, k_interfacecustomizationuidofflags_count> dof_flags;
			char generated_pad7306[3]; // padding
			real dof_focal_length;
			real dof_focal_distance;
			real dof_fstop;
			string_id composer_scene_name;
		};
		static_assert(sizeof(s_interfacecustomizationuicamerapresetsettings) == 52, "struct s_interfacecustomizationuicamerapresetsettings is invalid size");

		struct s_interfacecustomizationuicamerapreset
		{
			string_id preset_name;
			c_enum<e_interfacecustomizationcoretype, short> core_type;
			c_enum<e_interfacecustomizationsocketitemtype, short> item_type;
			c_typed_tag_block<s_interfacecustomizationuicamerapresetsettings> camera_settings_block;
		};
		static_assert(sizeof(s_interfacecustomizationuicamerapreset) == 20, "struct s_interfacecustomizationuicamerapreset is invalid size");

		struct s_interfacecustomizationuicamerascenepreset
		{
			c_enum<e_interfacecustomizationspartancustomizationscenetypes, short> scene_type;
			char generated_pad0124[2]; // padding
			c_typed_tag_block<s_interfacecustomizationuicamerapreset> camera_presets_settings_block;
		};
		static_assert(sizeof(s_interfacecustomizationuicamerascenepreset) == 16, "struct s_interfacecustomizationuicamerascenepreset is invalid size");

		struct s_interfacecustomizationuicamerapresetstag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_interfacecustomizationuicamerapreset> camera_presets_settings_block;
			c_typed_tag_block<s_interfacecustomizationuicamerascenepreset> camera_scene_presets_settings_block;
		};
		static_assert(sizeof(s_interfacecustomizationuicamerapresetstag) == 40, "struct s_interfacecustomizationuicamerapresetstag is invalid size");

		struct s_collisiondamagefunction
		{
			// custom mapping_function
			s_functiondefinition mapping;
		};
		static_assert(sizeof(s_collisiondamagefunction) == 20, "struct s_collisiondamagefunction is invalid size");

		struct s_collisiondamagestruct
		{
			c_flags<e_collisiondamagestructflags, long, k_collisiondamagestructflags_count> flags;
			real minimum_velocity_for_lethal_collision;

			/* Game collision damage */

			s_collisiondamagefunction game_collision_damage$2;
			real_bounds game_acceleration;
			real minimum_velocity_for_game_damage;

			/* Game collision damage scaling */

			real apply_collision_damage_scale;
			real friendly_apply_collision_damage_scale;
			angle game_collision_damage_normal_threshold;

			/* Absolute collision damage */

			s_collisiondamagefunction absolute_collision_damage$2;
			real_bounds absolute_acceleration;
			real minimum_velocity_for_absolute_damage;

			/* Absolute collision damage scaling */

			real apply_absolute_collision_damage_scale;
			real friendly_apply_absolute_collision_damage_scale;
			angle absolute_collision_damage_normal_threshold;

			/* Alternative damage effect */

			c_typed_tag_reference<DAMAGE_EFFECT_TAG> alternative_damage_effect$2;
		};
		static_assert(sizeof(s_collisiondamagestruct) == 112, "struct s_collisiondamagestruct is invalid size");

		struct s_collisiondamagedefinition
		{
			s_anytag_struct_definition anytag;
			s_collisiondamagestruct damagestruct;
			char generated_padcb8c[4]; // padding
		};
		static_assert(sizeof(s_collisiondamagedefinition) == 132, "struct s_collisiondamagedefinition is invalid size");

		struct s_i343physicscollisiontypename
		{
			string_id name;
		};
		static_assert(sizeof(s_i343physicscollisiontypename) == 4, "struct s_i343physicscollisiontypename is invalid size");

		struct s_i343physicscollisionlayerdata
		{
			char collision;
		};
		static_assert(sizeof(s_i343physicscollisionlayerdata) == 1, "struct s_i343physicscollisionlayerdata is invalid size");

		struct s_i343physicscollisionfilterdefinition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343physicscollisiontypename> types_block;
			c_typed_tag_block<s_i343physicscollisionlayerdata> layers_block;
		};
		static_assert(sizeof(s_i343physicscollisionfilterdefinition) == 40, "struct s_i343physicscollisionfilterdefinition is invalid size");

		struct s_camera_fx_settingss_real_exposure_parameter
		{
			// custom value

			/* EXPOSURE */

			c_flags<e_camerafxparameterautoadjustflags, short, k_camerafxparameterautoadjustflags_count> flags;
			char generated_pad3d40[2]; // padding
			real exposure$2;
			real maximum_change;
			real blend_speed_0_1;
			real minimum;
			real maximum;
			// custom value
			real auto_exposure_screen_brightness;
			real exposure_offset;
			real sky_exposure_offset_stops;
			// custom value
			real prevent_fluctuation_time_range;
			// custom value
		};
		static_assert(sizeof(s_camera_fx_settingss_real_exposure_parameter) == 40, "struct s_camera_fx_settingss_real_exposure_parameter is invalid size");

		struct s_camera_fx_settingscamerafxexposuresensitivity
		{

			/* AUTO EXPOSURE SENSITIVITY */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_padf2eb[2]; // padding
			real sensitivity_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxexposuresensitivity) == 8, "struct s_camera_fx_settingscamerafxexposuresensitivity is invalid size");

		struct s_camera_fx_settingscamerafxexposurepitchinfluence
		{

			/* EXPOSURE PITCH INFLUENCE */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad3993[2]; // padding

			/* INFLUENCE FUNCTION (GROUND -> HORIZON -> SKY) */

			// custom function
			s_functiondefinition function;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxexposurepitchinfluence) == 24, "struct s_camera_fx_settingscamerafxexposurepitchinfluence is invalid size");

		struct s_camera_fx_settingscamerafxexposurecompensation
		{

			/* EXPOSURE COMPENSATION */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad19de[2]; // padding

			/* COMPENSATION FUNCTION (EXPOSURE MIN -> EXPOSURE MAX) */

			// custom function
			s_functiondefinition function;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxexposurecompensation) == 24, "struct s_camera_fx_settingscamerafxexposurecompensation is invalid size");

		struct s_camera_fx_settingscamerafxbloomhighlight
		{

			/* HIGHLIGHT BLOOM */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_paddc8c[2]; // padding
			real highlight_bloom$2;
			real maximum_change;
			real blend_speed_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxbloomhighlight) == 16, "struct s_camera_fx_settingscamerafxbloomhighlight is invalid size");

		struct s_camera_fx_settingscamerafxbloomhighlightthreshold
		{

			/* HIGHLIGHT BLOOM THRESHOLD */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_padedb3[2]; // padding
			real highlight_bloom_threshold$2;
			real maximum_change;
			real blend_speed_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxbloomhighlightthreshold) == 16, "struct s_camera_fx_settingscamerafxbloomhighlightthreshold is invalid size");

		struct s_camera_fx_settingscamerafxbloominherent
		{

			/* AMBIENT BLOOM */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_padfee3[2]; // padding
			real ambient_bloom$2;
			real maximum_change;
			real blend_speed_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxbloominherent) == 16, "struct s_camera_fx_settingscamerafxbloominherent is invalid size");

		struct s_camera_fx_settingscamerafxbloomintensity
		{

			/* BLOOM INTENSITY */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad4287[2]; // padding
			real bloom_intensity$2;
			real maximum_change;
			real blend_speed_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxbloomintensity) == 16, "struct s_camera_fx_settingscamerafxbloomintensity is invalid size");

		struct s_camera_fx_settingscamerafxbloomlayerintensity
		{
			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad8248[2]; // padding
			real large_layer_intensity;
			real medium_layer_intensity;
			real small_layer_intensity;
			real maximum_change;
			real blend_speed_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxbloomlayerintensity) == 24, "struct s_camera_fx_settingscamerafxbloomlayerintensity is invalid size");

		struct s_camera_fx_settingscamerafxbloomtintcolor
		{

			/* BLOOM TINT COLOR */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad8bf4[2]; // padding
			rgb_color tint_color;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxbloomtintcolor) == 16, "struct s_camera_fx_settingscamerafxbloomtintcolor is invalid size");

		struct s_camera_fx_settingscamerafxselfillumexposuresettings
		{

			/* SELF ILLUM EXPOSURE */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad01be[2]; // padding
			real preferred_exposure;
			real maximum_change;
			real blend_speed_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxselfillumexposuresettings) == 16, "struct s_camera_fx_settingscamerafxselfillumexposuresettings is invalid size");

		struct s_camera_fx_settingscamerafxselfillumscale
		{

			/* SELF ILLUM CHANGE */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad5a4a[2]; // padding
			real exposure_change;
			real maximum_change;
			real blend_speed_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxselfillumscale) == 16, "struct s_camera_fx_settingscamerafxselfillumscale is invalid size");

		struct s_camera_fx_settingscamerafxselfillumscaleperrace
		{
			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad7166[2]; // padding
			real parameter_value;
			real maximum_change;
			real blend_speed_0_1;
		};
		static_assert(sizeof(s_camera_fx_settingscamerafxselfillumscaleperrace) == 16, "struct s_camera_fx_settingscamerafxselfillumscaleperrace is invalid size");

		struct s_camera_fx_settingss_color_grading_parameter
		{

			/* Color Grading */

			c_flags<e_camerafxparameternoautoadjustflags, short, k_camerafxparameternoautoadjustflags_count> flags;
			char generated_pad78c0[2]; // padding
			c_typed_tag_reference<BITMAP_TAG> color_grading_texture;
			c_typed_tag_reference<BITMAP_TAG> hdr_color_grading_texture;
			real blend_time;
		};
		static_assert(sizeof(s_camera_fx_settingss_color_grading_parameter) == 40, "struct s_camera_fx_settingss_color_grading_parameter is invalid size");

		struct s_camera_fx_settingss_ssao_parameter
		{

			/* SSAO settings */

			c_flags<e_camerafxparameterenabledflags, short, k_camerafxparameterenabledflags_count> flags;
			char generated_pad4870[2]; // padding
			c_flags<e_camerafxssaoflags, short, k_camerafxssaoflags_count> ssao_flags;
			char generated_pad76e4[2]; // padding
			real radius;
			dword step_size;
			real angle_bias;
			real strength;
			real power_exponent;
			dword blur_radius;
			real blur_sharpness;
			real decorator_apply_darkening_scaler;
			real hemi_rejection_falloff;
			real gtao_intensity;
			real sun_ao;
			real spot_light_ao;
			real omni_light_ao;
		};
		static_assert(sizeof(s_camera_fx_settingss_ssao_parameter) == 60, "struct s_camera_fx_settingss_ssao_parameter is invalid size");

		struct s_speccontrolnodeint
		{
			c_enum<e_i343speccontrolgraphicsoptions, char> type;
			char generated_pad11b5[3]; // padding
			c_flags<e_speccontrolnodeoverrideflags, long, k_speccontrolnodeoverrideflags_count> flags;
			long input;
			real very_low;
			real low;
			real medium;
			real high;
			real ultra;
			c_enum<e_i343speccontrolsplitscreenlogictype, char> splitscreen_logic;
			char generated_padf7d4[3]; // padding
			real _2_player_splitscreen;
			real _3_player_splitscreen;
			real _4_player_splitscreen;
		};
		static_assert(sizeof(s_speccontrolnodeint) == 48, "struct s_speccontrolnodeint is invalid size");

		struct s_speccontrolnodefloat
		{
			c_enum<e_i343speccontrolgraphicsoptions, char> type;
			char generated_padf78c[3]; // padding
			c_flags<e_speccontrolnodeoverrideflags, long, k_speccontrolnodeoverrideflags_count> flags;
			real input;
			real very_low;
			real low;
			real medium;
			real high;
			real ultra;
			c_enum<e_i343speccontrolsplitscreenlogictype, char> splitscreen_logic;
			char generated_pad116d[3]; // padding
			real _2_player_splitscreen;
			real _3_player_splitscreen;
			real _4_player_splitscreen;
		};
		static_assert(sizeof(s_speccontrolnodefloat) == 48, "struct s_speccontrolnodefloat is invalid size");

		struct s_camera_fx_settingsdeferredreflectionsparameter
		{

			/* Deferred Reflections settings */

			c_flags<e_camerafxparameterenabledflags, short, k_camerafxparameterenabledflags_count> flags;
			char generated_padbf0e[2]; // padding
			c_flags<e_deferredreflectionflags, long, k_deferredreflectionflags_count> deferred_reflection_flags;
			real intensity;
			real intensity_first_person;
			real fade_to_cubemap;
			real border_fade_size;
			s_speccontrolnodeint ray_steps;
			real mip_blur_distance_scale;
			real depth_thickness;
			real ssr_near_fade_distance;
			real ssr_far_fade_distance;
			real ssr_roughness_threshold;
			real ssr_tonemap_strength;
			real ssr_tonemap_clamp;
			s_speccontrolnodefloat resolution;
		};
		static_assert(sizeof(s_camera_fx_settingsdeferredreflectionsparameter) == 148, "struct s_camera_fx_settingsdeferredreflectionsparameter is invalid size");

		struct s_camera_fx_settingss_camera_lens_dirt_parameter
		{

			/* Camera Lens Dirt Settings */

			c_flags<e_camerafxparameterenabledflags, short, k_camerafxparameterenabledflags_count> flags;
			char generated_pad28b2[2]; // padding
			real intensity;
			c_typed_tag_reference<BITMAP_TAG> dirt_texture;
			c_enum<e_cameralensdirtdirttype, char> dirt_type;
			char generated_pad409c[3]; // padding
		};
		static_assert(sizeof(s_camera_fx_settingss_camera_lens_dirt_parameter) == 28, "struct s_camera_fx_settingss_camera_lens_dirt_parameter is invalid size");

		struct s_speccontrolnodebool
		{
			c_enum<e_i343speccontrolgraphicsoptions, char> type;
			char generated_padfbf4[1]; // padding
			c_flags<e_speccontrolnodeboolflags, short, k_speccontrolnodeboolflags_count> flags;
		};
		static_assert(sizeof(s_speccontrolnodebool) == 4, "struct s_speccontrolnodebool is invalid size");

		struct s_camera_fx_settingscontactshadowsparameter
		{

			/* Sun Contact Shadow Settings */

			c_flags<e_camerafxparameterenabledflags, short, k_camerafxparameterenabledflags_count> flags;
			char generated_pad3bce[2]; // padding
			c_flags<e_contactshadowflags, long, k_contactshadowflags_count> contact_shadow_flags;
			s_speccontrolnodebool enabled;
			s_speccontrolnodeint ray_steps;
			real ray_steps_first_person_scalar;
			s_speccontrolnodefloat maximum_shadow_ray_length;
			real maximum_shadow_ray_length_first_person_scalar;
			s_speccontrolnodefloat ray_pixel_stride;
			real first_person_pixel_stride_first_person_scalar;
			real average_occluder_thickness;
			real average_occluder_thickness_first_person;
			real shadow_softness_scale;
			real shadow_softness_scale_first_person;
			real shadow_fade_start_distance;
			real shadow_fade_end_distance;
			real global_opacity;
			real global_opacity_first_person;
			real ray_start_bias;
			real ray_start_bias_far_distance;
			real ray_start_bias_offset_at_far_distance;
			real ray_start_bias_first_person;
			real first_person_transition_scalar;
		};
		static_assert(sizeof(s_camera_fx_settingscontactshadowsparameter) == 220, "struct s_camera_fx_settingscontactshadowsparameter is invalid size");

		struct s_c_camera_fx_settings
		{
			s_anytag_struct_definition anytag;
			// custom value
			s_camera_fx_settingss_real_exposure_parameter exposure;
			s_camera_fx_settingscamerafxexposuresensitivity auto_exposure_sensitivity;
			s_camera_fx_settingscamerafxexposurepitchinfluence exposure_pitch_influence;
			s_camera_fx_settingscamerafxexposurecompensation exposure_compensation;
			s_camera_fx_settingscamerafxbloomhighlight bloom_highlight;
			s_camera_fx_settingscamerafxbloomhighlightthreshold bloom_highlight_threshold;
			s_camera_fx_settingscamerafxbloominherent bloom_inherent;
			s_camera_fx_settingscamerafxbloomintensity bloom_intensity;
			s_camera_fx_settingscamerafxbloomlayerintensity bloom_layer_intensity;
			s_camera_fx_settingscamerafxbloomtintcolor bloom_tint_color;
			s_camera_fx_settingscamerafxselfillumexposuresettings self_illum_exposure_settings;
			s_camera_fx_settingscamerafxselfillumscale self_illum_scale;

			/* SELF ILLUM MATERIAL SHADER FUNCTION PARAMETER - (UNSC) */

			s_camera_fx_settingscamerafxselfillumscaleperrace self_illum_scale_unsc;

			/* SELF ILLUM MATERIAL SHADER FUNCTION PARAMETER - (Covenant) */

			s_camera_fx_settingscamerafxselfillumscaleperrace self_illum_scale_covenant;

			/* SELF ILLUM MATERIAL SHADER FUNCTION PARAMETER - (Forerunner) */

			s_camera_fx_settingscamerafxselfillumscaleperrace self_illum_scale_forerunner;

			/* EFFECT EXPOSURE OVERRIDE */

			c_typed_tag_reference<EFFECT_EXPOSURE_TAG> effect_exposure_override$2;
			s_camera_fx_settingss_color_grading_parameter color_grading;
			s_camera_fx_settingss_ssao_parameter ssao_settings;
			s_camera_fx_settingsdeferredreflectionsparameter deferred_reflections_settings;
			s_camera_fx_settingss_camera_lens_dirt_parameter camera_lens_dirt;
			s_camera_fx_settingscontactshadowsparameter contact_shadows;
			// custom value
		};
		static_assert(sizeof(s_c_camera_fx_settings) == 808, "struct s_c_camera_fx_settings is invalid size");

		struct s_s_character_voice_region_permutation_filter
		{
			string_id permutation_name;
		};
		static_assert(sizeof(s_s_character_voice_region_permutation_filter) == 4, "struct s_s_character_voice_region_permutation_filter is invalid size");

		struct s_s_character_voice_region_filter
		{
			string_id region_name;
			c_typed_tag_block<s_s_character_voice_region_permutation_filter> permutation_filters_block;
		};
		static_assert(sizeof(s_s_character_voice_region_filter) == 16, "struct s_s_character_voice_region_filter is invalid size");

		struct s_s_character_voice
		{
			c_typed_tag_reference<DIALOGUE_TAG> dialogue;
			string_id designator;
			real weight;
			c_typed_tag_block<s_s_character_voice_region_filter> region_filters_block;
		};
		static_assert(sizeof(s_s_character_voice) == 36, "struct s_s_character_voice is invalid size");

		struct s_character_variant
		{
			string_id variant_name;
			short variant_index;
			char generated_padedbf[2]; // padding
			string_id style_id;
			c_typed_tag_block<s_s_character_voice> voices_block;
		};
		static_assert(sizeof(s_character_variant) == 24, "struct s_character_variant is invalid size");

		struct s_c_character_voice_properties_internal
		{
			c_typed_tag_block<s_s_character_voice> voices_block;
		};
		static_assert(sizeof(s_c_character_voice_properties_internal) == 12, "struct s_c_character_voice_properties_internal is invalid size");

		struct s_c_character_development_status_properties_internal
		{
			c_enum<e_characterdevelopmentstage, short> stage;
			char padding1[2]; // padding
		};
		static_assert(sizeof(s_c_character_development_status_properties_internal) == 4, "struct s_c_character_development_status_properties_internal is invalid size");

		struct s_s_disallowed_weapons_from_trading
		{
			c_typed_tag_reference<WEAPON_TAG> weapon;
		};
		static_assert(sizeof(s_s_disallowed_weapons_from_trading) == 16, "struct s_s_disallowed_weapons_from_trading is invalid size");

		struct s_c_character_general_properties_internal
		{
			c_flags<e_charactergeneralflags, long, k_charactergeneralflags_count> general_flags;
			c_enum<e_actortype, short> type;
			short rank;
			c_typed_tag_reference<LUA_TAG> prototype_script;
			real max_leader_dist;
			real absolute_max_leader_dist;
			real max_player_dialogue_dist;
			real scariness;
			c_enum<e_unitgrenadetype, char> default_grenade_type;
			char generated_pad6d7e[1]; // padding
			c_enum<e_behaviortreeroots, short> behavior_tree_root;
			c_typed_tag_reference<BEHAVIORTREE_TAG> data_behavior_tree;
			c_typed_tag_block<s_s_disallowed_weapons_from_trading> disallowed_weapons_from_trading_block;
			c_typed_tag_reference<WEAPON_TAG> initial_primary_weapon_;
			c_typed_tag_reference<WEAPON_CONFIGURATION_TAG> primary_weapon_configuration;
			c_typed_tag_reference<WEAPON_TAG> initial_secondary_weapon_;
			c_typed_tag_reference<WEAPON_CONFIGURATION_TAG> secondary_weapon_configuration;
			c_typed_tag_reference<EQUIPMENT_TAG> initial_equipment_;
			string_id shield_frame_attachment;
			short token_priority;
			char generated_padba33[2]; // padding
			c_typed_tag_block<s_s_object_meta_label> designer_metadata_block;
			c_typed_tag_block<s_s_object_meta_label> dialogue_system_metadata_block;
		};
		static_assert(sizeof(s_c_character_general_properties_internal) == 184, "struct s_c_character_general_properties_internal is invalid size");

		struct s_c_character_proto_spawn_properties_internal
		{
			c_enum<e_protospawntype, short> proto_spawn_type_;
		};
		static_assert(sizeof(s_c_character_proto_spawn_properties_internal) == 2, "struct s_c_character_proto_spawn_properties_internal is invalid size");

		struct s_c_character_interact_properties_internal
		{
			c_flags<e_characterinteractflags, char, k_characterinteractflags_count> interact_flags;
			char generated_padb4d2[3]; // padding
			real default_maximum_object_interact_range;
		};
		static_assert(sizeof(s_c_character_interact_properties_internal) == 8, "struct s_c_character_interact_properties_internal is invalid size");

		struct s_s_ai_character_emotion_situational_danger_properties
		{
			c_enum<e_propclassification, short> highest_prop_class;
			char generated_pad78a8[2]; // padding
			real situational_danger;
		};
		static_assert(sizeof(s_s_ai_character_emotion_situational_danger_properties) == 8, "struct s_s_ai_character_emotion_situational_danger_properties is invalid size");

		struct s_c_character_emotions_properties_internal
		{
			c_typed_tag_block<s_s_ai_character_emotion_situational_danger_properties> situational_danger_block;
			real perceived_danger_increase_half_life;
			real perceived_danger_decay_half_life;
			real perceived_danger_alert_threshold;
			real perceived_danger_combat_threshold;
		};
		static_assert(sizeof(s_c_character_emotions_properties_internal) == 28, "struct s_c_character_emotions_properties_internal is invalid size");

		struct s_c_character_vitality_properties_internal
		{
			c_flags<e_charactervitalityflags, long, k_charactervitalityflags_count> vitality_flags;
			real normal_body_vitality;
			real normal_shield_vitality;
			real legendary_body_vitality;
			real legendary_shield_vitality;
			real body_recharge_fraction;
			real soft_ping_threshold_with_shields;
			real soft_ping_threshold_no_shields;
			real medium_ping_threshold_with_shields;
			real medium_ping_threshold_no_shields;
			real medium_ping_cooldown_time;
			real hard_ping_threshold_with_shields;
			real hard_ping_threshold_no_shields;
			real hard_ping_cooldown_time;
			real body_recharge_delay_time;
			real body_recharge_time;
			real shield_recharge_delay_time;
			real shield_recharge_time;
			real extended_shield_damage_threshold;
			real extended_body_damage_threshold;
			real runtime_body_recharge_velocity;
			real runtime_shield_recharge_velocity;
			c_typed_tag_reference<WEAPON_TAG> resurrect_weapon;
			real player_damage_scale;
			c_typed_tag_reference<COLLISION_DAMAGE_TAG> collision_damage_override;
			c_typed_tag_reference<COLLISION_DAMAGE_TAG> knockback_collision_damage_override;
			real stun_threshold_easy;
			real stun_threshold_normal;
			real stun_threshold_heroic;
			real stun_threshold_legendary;
			real stun_time_scale_easy;
			real stun_time_scale_normal;
			real stun_time_scale_heroic;
			real stun_time_scale_legendary;
			real stun_cooldown_easy;
			real stun_cooldown_normal;
			real stun_cooldown_heroic;
			real stun_cooldown_legendary;
		};
		static_assert(sizeof(s_c_character_vitality_properties_internal) == 188, "struct s_c_character_vitality_properties_internal is invalid size");

		struct s_c_character_placement_properties_internal
		{
			real few_upgrade_chance_easy;
			real few_upgrade_chance_normal;
			real few_upgrade_chance_heroic;
			real few_upgrade_chance_legendary;
			real normal_upgrade_chance_easy;
			real normal_upgrade_chance_normal;
			real normal_upgrade_chance_heroic;
			real normal_upgrade_chance_legendary;
			real many_upgrade_chance_easy;
			real many_upgrade_chance_normal;
			real many_upgrade_chance_heroic;
			real many_upgrade_chance_legendary;
		};
		static_assert(sizeof(s_c_character_placement_properties_internal) == 48, "struct s_c_character_placement_properties_internal is invalid size");

		struct s_c_character_base_perception_properties_internal
		{
			c_flags<e_characterbaseperceptionflags, char, k_characterbaseperceptionflags_count> flags;
			char generated_pad16e5[3]; // padding
			real silent_movement_speed_threshold;
			real perception_decay_delay;
			real moving_perception_decay_delay;
			real perception_begin_to_forget_time;
			real perception_forget_time;
			real combat_status_alert_cooldown;
			real combat_status_active_cooldown;
			real postcombat_clump_state_time;

			/* Perceived Danger Impulses */

			real weapon_impact_danger_impulse;
			real bullet_impact_danger_impulse;
			real spartan_abilitiy_impact_danger_impulse;
			real footsteps_danger_impulse;
			real jump_landing_impact_danger_impulse;
		};
		static_assert(sizeof(s_c_character_base_perception_properties_internal) == 56, "struct s_c_character_base_perception_properties_internal is invalid size");

		struct s_s_active_camo_perception_properties
		{
			real_fraction partial_invisibility_amount;
			real partial_invisibility_vision_distance;
			real_fraction full_invisibility_amount;
			real full_invisibility_vision_distance;
		};
		static_assert(sizeof(s_s_active_camo_perception_properties) == 16, "struct s_s_active_camo_perception_properties is invalid size");

		struct s_c_character_perception_properties_internal
		{
			c_enum<e_c_perception_mode, short> perception_mode;
			c_flags<e_characterperceptionflags, short, k_characterperceptionflags_count> flags;
			real maximum_vision_distance;
			real reliable_vision_distance;
			real maximum_peripheral_vision_distance;
			real reliable_peripheral_vision_distance;
			real max_peripheral_vision_distance_at_peripheral_vision_angle;
			real max_reliable_peripheral_vision_distance_at_peripheral_vision_angle;
			real maximum_unmistakable_distance;
			real surprise_distance;
			real min_distance_from_last_known_position_to_surprise;
			real min_time_from_last_clump_surprise;
			real min_time_from_last_seen_to_surprise;
			real_bounds surprise_lerp_distance_range;
			real_bounds surprise_angle_range;
			angle focus_interior_angle;
			angle focus_exterior_angle;
			angle peripheral_vision_angle;
			angle vertical_exterior_up_angle;
			angle vertical_exterior_down_angle;
			real hearing_distance;
			real max_propagation_time;
			real partial_perception_awareness_delay;
			real full_perception_awareness_delay;
			real unmistakable_perception_awareness_delay;
			real partial_perception_acknowledgement_delay;
			real full_perception_acknowledgement_delay;
			real unmistakable_perception_acknowledgement_delay;
			real awareness_glance_level;
			real_fraction identify_hologram_chance;
			real_bounds hologram_ignore_timer;
			real hologram_ignore_timer_shot_penalty;
			// custom parital_perception_distance_distribution_function
			s_functiondefinition mapping;
			// custom normal_active_camo_perception
			s_s_active_camo_perception_properties normal_active_camo_perception;
			// custom value
			// custom legendary_active_camo_perception
			s_s_active_camo_perception_properties legendary_active_camo_perception;
			// custom value
		};
		static_assert(sizeof(s_c_character_perception_properties_internal) == 188, "struct s_c_character_perception_properties_internal is invalid size");

		struct s_c_character_target_properties_internal
		{
			real player_preference;
		};
		static_assert(sizeof(s_c_character_target_properties_internal) == 4, "struct s_c_character_target_properties_internal is invalid size");

		struct s_c_character_look_properties_internal
		{
			real_euler_angles2d maximum_aiming_deviation;
			real_euler_angles2d maximum_looking_deviation;
			real_euler_angles2d runtime_aiming_deviation_cosines;
			real_euler_angles2d runtime_looking_deviation_cosines;
			angle noncombat_look_delta_l;
			angle noncombat_look_delta_r;
			angle combat_look_delta_l;
			angle combat_look_delta_r;
			real_bounds noncombat_idle_looking;
			real_bounds noncombat_idle_aiming;
			real_bounds combat_idle_looking;
			real_bounds combat_idle_aiming;
		};
		static_assert(sizeof(s_c_character_look_properties_internal) == 80, "struct s_c_character_look_properties_internal is invalid size");

		struct s_characterhopdefinition
		{
			real min_hop_distance;
			real min_hop_distance_to_path_end;
			real_bounds hop_wait_timer_min_max;
			real max_hop_distance;
			real pad;
		};
		static_assert(sizeof(s_characterhopdefinition) == 24, "struct s_characterhopdefinition is invalid size");

		struct s_characterhopdefinitionset
		{
			// custom _default
			s_characterhopdefinition _default;
			// custom value
			// custom passive
			s_characterhopdefinition passive;
			// custom value
			// custom aggressive
			s_characterhopdefinition aggressive;
			// custom value
		};
		static_assert(sizeof(s_characterhopdefinitionset) == 72, "struct s_characterhopdefinitionset is invalid size");

		struct s_c_character_hopping_properties_internal
		{
			c_flags<e_characterhoppingflags, long, k_characterhoppingflags_count> hopping_flags;
			c_typed_tag_block<s_characterhopdefinitionset> hopping_definition_block;
		};
		static_assert(sizeof(s_c_character_hopping_properties_internal) == 16, "struct s_c_character_hopping_properties_internal is invalid size");

		struct s_characterwarpdefinition
		{
			real min_warp_distance;
			real max_warp_distance;
			real warp_speed;
			real run_up_distance;
			real linear_distance_until_cooldown;
			real cooldown_duration;
			real min_jump_distance;
		};
		static_assert(sizeof(s_characterwarpdefinition) == 28, "struct s_characterwarpdefinition is invalid size");

		struct s_characterwarpdefinitionset
		{
			// custom _default
			s_characterwarpdefinition _default;
			// custom value
			// custom passive
			s_characterwarpdefinition passive;
			// custom value
			// custom aggressive
			s_characterwarpdefinition aggressive;
			// custom value
		};
		static_assert(sizeof(s_characterwarpdefinitionset) == 84, "struct s_characterwarpdefinitionset is invalid size");

		struct s_c_character_warp_properties_internal
		{
			c_typed_tag_block<s_characterwarpdefinitionset> warp_definition_block;
			c_typed_tag_reference<EFFECT_TAG> intro_effect;
			c_typed_tag_reference<EFFECT_TAG> travel_effect;
			c_typed_tag_reference<EFFECT_TAG> outro_effect;
		};
		static_assert(sizeof(s_c_character_warp_properties_internal) == 60, "struct s_c_character_warp_properties_internal is invalid size");

		struct s_s_character_movement_stationary_pause_settings
		{

			/* Inertial pause settings */

			angle direction_change_angle;
			long stationary_change;
		};
		static_assert(sizeof(s_s_character_movement_stationary_pause_settings) == 8, "struct s_s_character_movement_stationary_pause_settings is invalid size");

		struct s_s_character_movement_throttle_control_settings
		{
			real distance;
			real throttle_scale;
		};
		static_assert(sizeof(s_s_character_movement_throttle_control_settings) == 8, "struct s_s_character_movement_throttle_control_settings is invalid size");

		struct s_s_character_movement_throttle_per_combat_status_settings
		{
			c_enum<e_actorcombatstatus, short> combat_status;
			char generated_padd966[2]; // padding
			c_typed_tag_block<s_s_character_movement_throttle_control_settings> throttle_settings_block;
		};
		static_assert(sizeof(s_s_character_movement_throttle_per_combat_status_settings) == 16, "struct s_s_character_movement_throttle_per_combat_status_settings is invalid size");

		struct s_characterlocomotionsettings
		{
			// custom locomotion_settings
			real_fraction sharp_turn_throttle;
			angle sharp_turn_angle;
			real max_accel_time;
			real max_decel_time;
			// custom value
		};
		static_assert(sizeof(s_characterlocomotionsettings) == 16, "struct s_characterlocomotionsettings is invalid size");

		struct s_c_character_movement_properties_internal
		{
			c_flags<e_charactermovementflags, long, k_charactermovementflags_count> movement_flags;
			real pathfinding_radius;
			real avoidance_radius;
			real destination_radius;
			real friendly_outer_radius;
			real friendly_inner_radius;
			real friendly_player_outer_radius;
			real friendly_player_inner_radius;

			/* Danger Zone Avoidance */

			c_enum<e_objectaisize, short> obstacle_leap_min_size;
			c_enum<e_objectaisize, short> obstacle_leap_max_size;
			c_enum<e_objectaisize, short> obstacle_ignore_size;
			c_enum<e_objectaisize, short> obstacle_smashable_size;

			/* clearance cache */

			c_enum<e_clearancecachebucketsize, short> clearance_cache_bucket_size;
			char generated_pad024b[2]; // padding
			real max_jump_height;
			real max_jump_distance;
			real maximum_leap_height;
			real leap_proximity_fraction;
			real maximum_hoist_height;
			real obstacle_smash_strength;
			c_flags<e_charactermovementhintflags, long, k_charactermovementhintflags_count> movement_hints;
			// custom throttle_and_inertia
			c_typed_tag_block<s_s_character_movement_stationary_pause_settings> change_direction_pause_block;
			real maximum_throttle;
			real minimum_throttle;
			real throttle_smoothing_rate;
			c_typed_tag_block<s_s_character_movement_throttle_per_combat_status_settings> movement_throttle_control_block;
			real minimum_juke_throttle;
			angle minimum_direction_change_juke_angle;
			real non_direction_change_juke_probability;
			real non_direction_change_juke_timeout;
			long minimum_post_juke_movement_ticks;
			// custom value
			real stationary_turn_radius;
			real_bounds move_distance;
			// custom phasing
			real phase_chance;
			real phase_delay_seconds;
			// custom value
			// custom movement_facing

			/* Movement Facing */

			angle maximum_deviation_angle;
			// custom value
			s_characterlocomotionsettings locomotion_settings;
			real wall_climb_cost_multiplier_;
			// custom character_flight
			c_enum<e_i343aifpevalairnavposition, char> air_nav_firing_point_position;
			// custom value
			char generated_padb596[3]; // padding
		};
		static_assert(sizeof(s_c_character_movement_properties_internal) == 176, "struct s_c_character_movement_properties_internal is invalid size");

		struct s_c_character_aimingfacing_properties_internal
		{
			c_flags<e_characteraimingfacingflags, char, k_characteraimingfacingflags_count> flags;
			c_enum<e_i343aifacingmode, char> default_facing_mode;
			char generated_padbf57[2]; // padding
			// custom baseball_run_properties

			/* Baseball run properties */

			real strafe_to_run_rate;
			real run_to_strafe_rate;
			real start_distance_threshold;
			real end_distance_threshold;
			real path_minimum_length;
			real minimum_distance_to_target;
			// custom value
		};
		static_assert(sizeof(s_c_character_aimingfacing_properties_internal) == 28, "struct s_c_character_aimingfacing_properties_internal is invalid size");

		struct s_c_character_deceleratedturns_properties_internal
		{
			// custom turn_slerp_blend_table
			// custom turn_slerp_blend_table_table
			s_functiondefinition turn_slerp_blend_table;
			// custom value
			// custom turn_anticipation_blend_table
			// custom turn_anticipation_blend_table
			s_functiondefinition turn_anticipation_blend_table;
			// custom value
			// custom turn_reaction_blend_table
			// custom turn_reaction_blend_table
			s_functiondefinition turn_reaction_blend_table;
			// custom value
			real turn_reaction_cosine_power;
			real turn_reaction_cosine_factor;
		};
		static_assert(sizeof(s_c_character_deceleratedturns_properties_internal) == 68, "struct s_c_character_deceleratedturns_properties_internal is invalid size");

		struct s_i343bipedmodespecificlocomotionscaledefinition
		{
			string_id mode_name;
			real speed_scale;
			real acceleration_scale;
			real locomotion_turn_rate_scale;
		};
		static_assert(sizeof(s_i343bipedmodespecificlocomotionscaledefinition) == 16, "struct s_i343bipedmodespecificlocomotionscaledefinition is invalid size");

		struct s_i343bipedlocomotionpropertiesdefinition
		{

			/* Walk speed properties */

			real walking_speed;

			/* AI Sprint speed properties */

			real ai_sprinting_speed;

			/* Run speed properties */

			real running_forward_speed;
			real running_backward_speed;
			real running_sideways_speed;

			/* Crouch speed properties */

			real crouching_forward_speed;
			real crouching_backward_speed;
			real crouching_sideways_speed;

			/* Acceleration/deceleration properties */

			real maximum_run_acceleration;
			real maximum_run_deceleration;
			real maximum_crouch_acceleration;
			real maximum_crouch_deceleration;

			/* Airborne Acceleration/Deceleration */

			real maximum_airborne_acceleration;
			real maximum_airborne_deceleration;

			/* Stationary turn properties old action system */

			real low_speed_threshold;
			real high_speed_threshold;
			real acceleration;

			/* Stationary turn properties new action system */

			real stationary_turn_trigger_range_factor;
			real stationary_turn_max_anim_playback_speed_up_factor;

			/* Stationary turn properties new action system (DEPRECATED) */

			angle min_stationary_turn_angle;
			real stationary_turn_max_speed_threshold;
			angle stationary_turn_min_yaw_threshold;
			angle stationary_turn_max_speed_yaw;
			angle min_stationary_turn_speed;
			angle max_stationary_turn_speed;
			real stationary_turn_acceleration_rate;
			real stationary_turn_decceleration_rate;

			/* Non stationary turn properties */

			angle max_angular_velocity_clamp;
			angle turn_accel_decel_rate;

			/* Speed/acceleration scales based on mode */

			c_typed_tag_block<s_i343bipedmodespecificlocomotionscaledefinition> mode_specific_scaling_block;
		};
		static_assert(sizeof(s_i343bipedlocomotionpropertiesdefinition) == 128, "struct s_i343bipedlocomotionpropertiesdefinition is invalid size");

		struct s_c_character_locomotionoverrides_properties_internal
		{
			s_i343bipedlocomotionpropertiesdefinition locomotion_overrides;
		};
		static_assert(sizeof(s_c_character_locomotionoverrides_properties_internal) == 128, "struct s_c_character_locomotionoverrides_properties_internal is invalid size");

		struct s_c_character_movementtweak_properties_internal
		{
			real dive_grenade_chance;
			real brace_grenade_chance;
			real dive_vehicle_chance;
			real brace_vehicle_chance;
			real stand_ground_chance;
			real stand_ground_anticipation_time;
			real brace_for_grenade_time;
			real brace_for_vehicle_impact_time;
			real brace_for_vehicle_impact_prediction_time;
			real brace_for_vehicle_impact_velocity_threshold;
			c_enum<e_characterjumpheight, short> jump_height;
			char generated_pad113f[2]; // padding
		};
		static_assert(sizeof(s_c_character_movementtweak_properties_internal) == 44, "struct s_c_character_movementtweak_properties_internal is invalid size");

		struct s_c_character_throttle_style_properties_internal
		{
			string_id style_name;
			real_fraction desired_throttle;
			real acceleration_time;
			s_scalarfunctionname acceleration_function;
			real deceleration_distance;
			s_scalarfunctionname deceleration_function;
			string_id stance;
		};
		static_assert(sizeof(s_c_character_throttle_style_properties_internal) == 60, "struct s_c_character_throttle_style_properties_internal is invalid size");

		struct s_character_movement_mapping
		{
			real chance;

			/* MAPPING */

			string_id idle;
			string_id alert;
			string_id engage;
			string_id self_preserve;
			string_id search;
			string_id retreat;
			string_id panic;
			string_id flank;
			string_id _protected;
			string_id stunned;
			string_id post_combat;
			string_id hurry;
			string_id custom_1;
			string_id custom_2;
			string_id custom_3;
			string_id custom_4;
		};
		static_assert(sizeof(s_character_movement_mapping) == 68, "struct s_character_movement_mapping is invalid size");

		struct s_character_movement_set
		{
			string_id name;
			c_typed_tag_block<s_character_movement_mapping> variants_block;
		};
		static_assert(sizeof(s_character_movement_set) == 16, "struct s_character_movement_set is invalid size");

		struct s_c_character_flocking_properties_internal
		{

			/* Jaime, don't touch this */

			real deceleration_distance;
			real normalized_speed;
			real buffer_distance;
			real_bounds throttle_threshold_bounds;
			real deceleration_stop_time;
		};
		static_assert(sizeof(s_c_character_flocking_properties_internal) == 24, "struct s_c_character_flocking_properties_internal is invalid size");

		struct s_c_character_swarm_properties_internal
		{
			short scatter_killed_count;
			char generated_pad8e1a[2]; // padding
			real scatter_radius;
			real scatter_time;
			real hound_min_distance;
			real hound_max_distance;
			real perlin_offset_scale;
			real_bounds offset_period;
			real perlin_idle_movement_threshold;
			real perlin_combat_movement_threshold;
			real stuck_time;
			real stuck_distance;
		};
		static_assert(sizeof(s_c_character_swarm_properties_internal) == 48, "struct s_c_character_swarm_properties_internal is invalid size");

		struct s_c_character_ready_properties_internal
		{
			real_bounds ready_time_bounds;
		};
		static_assert(sizeof(s_c_character_ready_properties_internal) == 8, "struct s_c_character_ready_properties_internal is invalid size");

		struct s_animationexception
		{
			string_id animation_exception_name;
		};
		static_assert(sizeof(s_animationexception) == 4, "struct s_animationexception is invalid size");

		struct s_c_character_engage_properties_internal
		{
			c_flags<e_characterengageflags, long, k_characterengageflags_count> flags;
			real_bounds reposition_bounds;
			real_bounds bunkering_reposition_bounds;

			/* Danger Crouch */

			real crouch_danger_threshold;
			real crouch_max_path_distance;
			real stand_danger_threshold;
			real fight_danger_move_threshold;
			short_bounds fight_danger_move_threshold_cooldown;
			c_typed_tag_reference<PROJECTILE_TAG> override_grenade_projectile;
			real_bounds default_combat_range;
			real_bounds default_firing_range;
			real_fraction preferred_engage_fraction_;
			real active_shield_fire_cutoff_delay;
			real friendly_avoid_distance;
			real friendly_close_avoid_distance;
			real teamlead_flocking_distance;
			real enemy_avoid_distance;
			real scary_enemy_avoid_distance;
			c_typed_tag_block<s_animationexception> full_body_animation_exceptions_for_firing_reset_block;

			/* Flying */

			angle max_angle_from_level;
		};
		static_assert(sizeof(s_c_character_engage_properties_internal) == 116, "struct s_c_character_engage_properties_internal is invalid size");

		struct s_kamikazeattachmentmarkers
		{
			string_id attachment_marker;
		};
		static_assert(sizeof(s_kamikazeattachmentmarkers) == 4, "struct s_kamikazeattachmentmarkers is invalid size");

		struct s_character_charge_difficulty_limits
		{

			/* Difficulty Limits */

			short max_kamikaze_count;
			short max_berserk_count;
			short min_berserk_count;
		};
		static_assert(sizeof(s_character_charge_difficulty_limits) == 6, "struct s_character_charge_difficulty_limits is invalid size");

		struct s_c_character_berserk_properties_internal
		{
			c_flags<e_c_character_berserk_properties_internalberserkflags, long, k_c_character_berserk_properties_internalberserkflags_count> flags;
			c_typed_tag_reference<WEAPON_TAG> berserk_weapon;
			real timeout;
			real_bounds shield_down_chance;
			real_bounds shield_down_range;
			real friendly_killed_distance;
			real_fraction peer_killed_chance;
			real_fraction leader_killed_chance;
			real chance_to_play_berserk_anim;
			real chance_to_play_berserk_anim_when_stuck;
			real_fraction proximity_chance;
			real proximity_check_cooldown;
			real proximity_abort_distance;
			real_fraction broken_kamikaze_chance;
			real_fraction surprise_kamikaze_chance;
			c_typed_tag_block<s_kamikazeattachmentmarkers> kamikaze_attachment_markers_block;
			real broken_kamikaze_stuck_delay;
			real max_kamikaze_time;
			real last_man_trigger_distance;
			c_typed_tag_block<s_character_charge_difficulty_limits> difficulty_limits_block;
		};
		static_assert(sizeof(s_c_character_berserk_properties_internal) == 116, "struct s_c_character_berserk_properties_internal is invalid size");

		struct s_c_character_weaponpickup_properties_internal
		{
			real search_range;
			real minimum_target_range;
			real desired_target_range;
			real_fraction search_chance;
			real range_threshold;
			real vehicle_threshold;
			real search_delay_min;
			real search_delay_max;
			c_enum<e_c_character_weaponpickup_properties_internalpickupbias, char> bias;
			char generated_pad5304[3]; // padding
			real danger_threshold;
		};
		static_assert(sizeof(s_c_character_weaponpickup_properties_internal) == 40, "struct s_c_character_weaponpickup_properties_internal is invalid size");

		struct s_c_character_evasion_properties_internal
		{
			real evasion_danger_threshold;
			real evasion_delay_timer;
			real evasion_chance;
			real evasion_proximity_threshold;
			real dive_retreat_chance;
		};
		static_assert(sizeof(s_c_character_evasion_properties_internal) == 20, "struct s_c_character_evasion_properties_internal is invalid size");

		struct s_c_character_dodge_properties_internal
		{
			real danger_threshold;
			real cooldown;
			real chance;
			real stop_proximity;
		};
		static_assert(sizeof(s_c_character_dodge_properties_internal) == 16, "struct s_c_character_dodge_properties_internal is invalid size");

		struct s_characterrunawayfromvehiclepropertiesinternal
		{
			real chance;
			real minimum_time_to_flee;
			real time_to_flee;
			real time_to_keep_path;
		};
		static_assert(sizeof(s_characterrunawayfromvehiclepropertiesinternal) == 16, "struct s_characterrunawayfromvehiclepropertiesinternal is invalid size");

		struct s_c_character_cover_properties_internal
		{
			c_flags<e_coverpropertiesflags, long, k_coverpropertiesflags_count> cover_flags;
			real_bounds hide_behind_cover_time;

			/* Cover conditions */

			real cover_shield_fraction;
			real cover_vitality_threshold;
			real cover_danger_threshold;
			real leave_cover_danger_threshold;
			// custom aggresive_defensive_cover_properties
			real minimum_defensive_distance_from_target;
			real minimum_defensive_distance_from_cover;
			real always_defensive_scary_threshold;
			// custom value

			/* Other */

			real cover_check_delay;
			real cover_pinned_down_check_delay;
			real emerge_from_cover_when_shield_fraction_reaches_threshold;
			real body_vitality_exit_threshold;
			real proximity_self_preserve;
			real unreachable_enemy_danger_threshold;
			real scary_target_threshold;
			real minimum_enemy_distance;
		};
		static_assert(sizeof(s_c_character_cover_properties_internal) == 72, "struct s_c_character_cover_properties_internal is invalid size");

		struct s_c_character_retreat_properties_internal
		{
			c_flags<e_characterretreatflags, long, k_characterretreatflags_count> retreat_flags;
			real shield_threshold;
			real scary_target_threshold;
			real danger_threshold;
			real proximity_threshold;
			real_bounds min_max_forced_cower_time_bounds;
			real_bounds min_max_cower_timeout_bounds;
			real proximity_ambush_threshold;
			real awareness_ambush_threshold;
			real leader_dead_retreat_chance;
			real peer_dead_retreat_chance;
			real second_peer_dead_retreat_chance;
			real flee_timeout;
			angle zig_zag_angle;
			real zig_zag_period;
			real retreat_grenade_chance;
		};
		static_assert(sizeof(s_c_character_retreat_properties_internal) == 72, "struct s_c_character_retreat_properties_internal is invalid size");

		struct s_c_character_search_properties_internal
		{
			c_flags<e_charactersearchflags, long, k_charactersearchflags_count> search_flags;
			real_bounds search_time;
			real search_distance;
			real max_searcher_count_;

			/* Uncover */

			real_bounds uncover_distance_bounds;

			/* Investigate */

			real_bounds vocalization_time;
		};
		static_assert(sizeof(s_c_character_search_properties_internal) == 36, "struct s_c_character_search_properties_internal is invalid size");

		struct s_c_character_presearch_properties_internal
		{
			c_flags<e_presearchgenericflags, long, k_presearchgenericflags_count> pre_search_flags;
			real_bounds min_presearch_time;
			real_bounds max_presearch_time;
			real_bounds peek_time;
			real max_certainty_radius;
			real max_presearcher_count_;
			real max_suppressing_count;
			real max_uncover_count;
			long max_destroy_cover_count;
			real max_suppress_time;
			real fire_to_uncover_chance_;
			real max_destroy_cover_time;
			// custom child_weights
			real suppressing_fire_weight;
			real uncover_weight;
			real leap_on_cover_weight;
			real destroy_cover_weight;
			real guard_weight;
			real investigate_weight;
			real search_by_fire_weight;
			// custom value
		};
		static_assert(sizeof(s_c_character_presearch_properties_internal) == 88, "struct s_c_character_presearch_properties_internal is invalid size");

		struct s_characterrecognizingpropertiesinternal
		{

			/* Recognizing */

			real recognize_min_time;
			real recognize_max_time;
		};
		static_assert(sizeof(s_characterrecognizingpropertiesinternal) == 8, "struct s_characterrecognizingpropertiesinternal is invalid size");

		struct s_c_character_idle_properties_internal
		{
			real_bounds idle_pose_delay_time;
			real_bounds wander_delay_time;
		};
		static_assert(sizeof(s_c_character_idle_properties_internal) == 16, "struct s_c_character_idle_properties_internal is invalid size");

		struct s_systematicrecreationsettings
		{
			string_id required_weapon_class;
			real_bounds cooldown;
			real_bounds duration;
		};
		static_assert(sizeof(s_systematicrecreationsettings) == 20, "struct s_systematicrecreationsettings is invalid size");

		struct s_c_character_precombat_properties_internal
		{
			c_typed_tag_block<s_systematicrecreationsettings> systematic_recreation_settings_block;
		};
		static_assert(sizeof(s_c_character_precombat_properties_internal) == 12, "struct s_c_character_precombat_properties_internal is invalid size");

		struct s_c_character_vocalization_properties_internal
		{

			/* Skip Fraction */

			real character_skip_fraction;
			real speaker_weight_bonus;
			real look_trigger_distance;
			real look_cooldown_time;
			real look_comment_time;
			real look_long_comment_time;
			real look_respond_max_time;
			real look_respond_early_out_time;
		};
		static_assert(sizeof(s_c_character_vocalization_properties_internal) == 32, "struct s_c_character_vocalization_properties_internal is invalid size");

		struct s_s_character_vehicle_boarding_properties
		{
			c_typed_tag_reference<UNIT_TAG> vehicle;
			c_flags<e_charactervehicleboardingflags, long, k_charactervehicleboardingflags_count> flags;
		};
		static_assert(sizeof(s_s_character_vehicle_boarding_properties) == 20, "struct s_s_character_vehicle_boarding_properties is invalid size");

		struct s_charactervehicleboardingpullproperties
		{
			c_typed_tag_reference<UNIT_TAG> vehicle;
			real max_pull;
			real min_linear_acceleration;
			real pull_history_factor;
		};
		static_assert(sizeof(s_charactervehicleboardingpullproperties) == 28, "struct s_charactervehicleboardingpullproperties is invalid size");

		struct s_c_character_boarding_properties_internal
		{
			string_id rule_name;
			c_flags<e_characterboardingflags, long, k_characterboardingflags_count> flags;
			real boarding_distance;
			real abort_distance;
			real minimum_entry_distance;
			real maximum_entry_distance;
			real max_speed;
			real board_time;
			real_bounds boarding_timeout;
			c_typed_tag_block<s_s_character_vehicle_boarding_properties> vehicle_specific_properties_block;
			c_typed_tag_block<s_charactervehicleboardingpullproperties> vehicle_specific_pull_properties_block;

			/* New boarding behavior */

			real max_danger;
			real max_pull;
			real min_linear_acceleration;
			real pull_history_factor;
			real ejection_knockback_time;
			real entry_timeout;
			real boarding_chance;
			real hijack_max_wait_time;
			real min_vehicle_vitality;
			real_bounds melee_cooldown;
		};
		static_assert(sizeof(s_c_character_boarding_properties_internal) == 108, "struct s_c_character_boarding_properties_internal is invalid size");

		struct s_c_character_kungfu_properties_internal
		{
			real kungfu_override_distance;
			real kungfu_cover_danger_threshold;
			real min_allowed_time;
			real min_disallowed_time;
		};
		static_assert(sizeof(s_c_character_kungfu_properties_internal) == 16, "struct s_c_character_kungfu_properties_internal is invalid size");

		struct s_s_bunker_timings
		{
			real_bounds open_time;
			real closed_min_time;
			real close_danger_level;
			real open_chance;
			real peek_chance;
		};
		static_assert(sizeof(s_s_bunker_timings) == 24, "struct s_s_bunker_timings is invalid size");

		struct s_c_character_bunker_properties_internal
		{
			c_flags<e_c_character_bunker_properties_internalflags, long, k_c_character_bunker_properties_internalflags_count> flags;

			/* DEFAULT TIMINGS */

			s_s_bunker_timings _default;

			/* FIGHT TIMINGS */

			s_s_bunker_timings fight;

			/* COVER TIMINGS */

			s_s_bunker_timings cover;

			/* GUARD TIMINGS */

			s_s_bunker_timings guard;
		};
		static_assert(sizeof(s_c_character_bunker_properties_internal) == 100, "struct s_c_character_bunker_properties_internal is invalid size");

		struct s_i343aiformationdescription
		{

			/* Procedural */

			c_enum<e_i343aiformationdescriptionshape, long> shape;
			angle yaw;
			real spacing;
			long max_rectangle_width;

			/* Custom */

			c_typed_tag_reference<FORMATION_TAG> formation_reference;

			/* Common */

			real max_speed;
			angle max_yaw_rate;
		};
		static_assert(sizeof(s_i343aiformationdescription) == 40, "struct s_i343aiformationdescription is invalid size");

		struct s_c_character_shield_wall_properties_internal
		{
			real raise_shield_delay;
			real relocate_delay;
			real max_leader_protect_distance;
			// custom formation
			s_i343aiformationdescription formation_description;
			// custom value
		};
		static_assert(sizeof(s_c_character_shield_wall_properties_internal) == 52, "struct s_c_character_shield_wall_properties_internal is invalid size");

		struct s_c_character_firing_wall_properties_internal
		{
			// custom activation_chance
			real_fraction activation_chance_easy;
			real_fraction activation_chance_normal;
			real_fraction activation_chance_heroic;
			real_fraction activation_chance_legendary;
			// custom value
			real max_distance;
			long min_member_count;
			long max_member_count;
			real_bounds fire_time;
			real cooldown;
			real warp_in_time;
			real min_arrival_time_variation;
			real max_arrival_time_variation;
			real warp_out_time;
			real min_departure_time_variation;
			real max_departure_time_variation;
			angle max_angle_between_formation_and_target;
			// custom formation
			s_i343aiformationdescription formation_description;
			// custom value
		};
		static_assert(sizeof(s_c_character_firing_wall_properties_internal) == 108, "struct s_c_character_firing_wall_properties_internal is invalid size");

		struct s_characterinterposerequestpropertiesinternal
		{
			real danger_level;
			real_bounds wait_time;
			real cooldown;
		};
		static_assert(sizeof(s_characterinterposerequestpropertiesinternal) == 16, "struct s_characterinterposerequestpropertiesinternal is invalid size");

		struct s_characterinterposepropertiesinternal
		{
			real_bounds protect_time;
			real distance_from_protect;
			string_id firing_style;
		};
		static_assert(sizeof(s_characterinterposepropertiesinternal) == 16, "struct s_characterinterposepropertiesinternal is invalid size");

		struct s_c_character_bounding_properties_internal
		{
			real max_wait_time;
			real advance_time;
			real reposition_search_range;
			real max_destination_age;
			byte max_cover_agents;
			char generated_pada6c0[3]; // padding
		};
		static_assert(sizeof(s_c_character_bounding_properties_internal) == 20, "struct s_c_character_bounding_properties_internal is invalid size");

		struct s_projectiledeflectionzone
		{
			real_bounds time_to_target_window;
			real_vector3d target_offset;
			real target_radius;
			angle max_incoming_angle;
			string_id animation_name;
		};
		static_assert(sizeof(s_projectiledeflectionzone) == 32, "struct s_projectiledeflectionzone is invalid size");

		struct s_c_character_deflection_properties_internal
		{

			/* Deflection areas */

			c_typed_tag_block<s_projectiledeflectionzone> target_areas_block;
		};
		static_assert(sizeof(s_c_character_deflection_properties_internal) == 12, "struct s_c_character_deflection_properties_internal is invalid size");

		struct s_c_character_bot_properties_internal
		{
			c_flags<e_botpropertiesflags, long, k_botpropertiesflags_count> movement_flags;

			/* Bot info */

			real crouch_time;
			real_fraction crouch_low_shield_threshold;
			real_fraction jump_chance;
			real_fraction evade_low_shield_threshold;
			real strafing_influence_vector_radius;
			real strafing_influence_vector_weight;
			real firing_point_refresh_distance;
			real influence_rejection_radius;
			real movement_cooldown_min;
			real movement_cooldown_max;
			real min_reload_chance;
			real max_reload_chance;
		};
		static_assert(sizeof(s_c_character_bot_properties_internal) == 52, "struct s_c_character_bot_properties_internal is invalid size");

		struct s_c_character_evasivefight_properties_internal
		{
			real engage_fraction;
			real_bounds stationary_time;
			real move_danger_threshold;
			real shield_threshold;
			real dive_cooldown;
			real dive_shield_threshold;
			real dive_danger_threshold;
		};
		static_assert(sizeof(s_c_character_evasivefight_properties_internal) == 32, "struct s_c_character_evasivefight_properties_internal is invalid size");

		struct s_c_character_aggressivefight_properties_internal
		{
			c_flags<e_aggressivefightflags, char, k_aggressivefightflags_count> flags;
			char generated_padcd38[3]; // padding
			real engage_fraction;
			real_bounds stationary_time;
			real move_danger_threshold;
			real max_speed_percent;
		};
		static_assert(sizeof(s_c_character_aggressivefight_properties_internal) == 24, "struct s_c_character_aggressivefight_properties_internal is invalid size");

		struct s_c_character_linearadvancefight_properties_internal
		{
			real_bounds stationary_time;
			real advance_distance;
		};
		static_assert(sizeof(s_c_character_linearadvancefight_properties_internal) == 12, "struct s_c_character_linearadvancefight_properties_internal is invalid size");

		struct s_characterstaticfightpropertiesinternal
		{
			real_bounds stationary_time;
			real danger_move_threshold;
		};
		static_assert(sizeof(s_characterstaticfightpropertiesinternal) == 12, "struct s_characterstaticfightpropertiesinternal is invalid size");

		struct s_characterstandgroundpropertiesinternal
		{
			real_bounds target_distance;
			real ally_distance;
			real ally_attacker_distance;
			real behavior_linger_time;
		};
		static_assert(sizeof(s_characterstandgroundpropertiesinternal) == 20, "struct s_characterstandgroundpropertiesinternal is invalid size");

		struct s_charactergrenadefightpropertiesinternal
		{
			real_bounds stationary_time;
			real minimum_movement;
			real_fraction ideal_fraction;
		};
		static_assert(sizeof(s_charactergrenadefightpropertiesinternal) == 16, "struct s_charactergrenadefightpropertiesinternal is invalid size");

		struct s_c_character_coversequence_properties_internal
		{
			real shield_start_threshold;
			real shield_end_threshold;
			real danger_start_threshold;
			real danger_end_threshold;
			real minimum_hide_duration;
		};
		static_assert(sizeof(s_c_character_coversequence_properties_internal) == 20, "struct s_c_character_coversequence_properties_internal is invalid size");

		struct s_c_character_covermove_properties_internal
		{
			c_flags<e_covermoveflags, long, k_covermoveflags_count> flags;
			real cover_failed_duration;
		};
		static_assert(sizeof(s_c_character_covermove_properties_internal) == 8, "struct s_c_character_covermove_properties_internal is invalid size");

		struct s_c_character_coverhide_properties_internal
		{
			real minimum_hide_duration;
		};
		static_assert(sizeof(s_c_character_coverhide_properties_internal) == 4, "struct s_c_character_coverhide_properties_internal is invalid size");

		struct s_c_character_longrangeattack_properties_internal
		{
			c_flags<e_longrangeattackflags, long, k_longrangeattackflags_count> flags;
			real potshot_duration;
			real peek_duration;
			real time_between_potshots;
		};
		static_assert(sizeof(s_c_character_longrangeattack_properties_internal) == 16, "struct s_c_character_longrangeattack_properties_internal is invalid size");

		struct s_c_character_hoistattack_properties_internal
		{
			real max_danger_threshold;
			real hoist_attack_chance;
		};
		static_assert(sizeof(s_c_character_hoistattack_properties_internal) == 8, "struct s_c_character_hoistattack_properties_internal is invalid size");

		struct s_c_character_hunkerdown_properties_internal
		{
			real danger_start_threshold;
			real distance_abort_threshold;
			real_fraction shield_health_threshold;
			real_bounds hunker_time;
		};
		static_assert(sizeof(s_c_character_hunkerdown_properties_internal) == 20, "struct s_c_character_hunkerdown_properties_internal is invalid size");

		struct s_c_character_shieldraise_properties_internal
		{
			real danger_threshold;
		};
		static_assert(sizeof(s_c_character_shieldraise_properties_internal) == 4, "struct s_c_character_shieldraise_properties_internal is invalid size");

		struct s_sharedvehiclefightproperties
		{
			real_fraction engage_fraction;
			real max_speed_percent;
		};
		static_assert(sizeof(s_sharedvehiclefightproperties) == 8, "struct s_sharedvehiclefightproperties is invalid size");

		struct s_c_character_vehicleaggressivefight_properties_internal
		{
			s_sharedvehiclefightproperties fight_properties;
			c_flags<e_vehicleboostflags, long, k_vehicleboostflags_count> flags;
			real max_danger_to_boost;
		};
		static_assert(sizeof(s_c_character_vehicleaggressivefight_properties_internal) == 16, "struct s_c_character_vehicleaggressivefight_properties_internal is invalid size");

		struct s_c_character_vehicledefensivefight_properties_internal
		{
			s_sharedvehiclefightproperties fight_properties;
		};
		static_assert(sizeof(s_c_character_vehicledefensivefight_properties_internal) == 8, "struct s_c_character_vehicledefensivefight_properties_internal is invalid size");

		struct s_c_character_engineer_properties_internal
		{
			real death_height;
			real death_rise_time;
			real death_detonation_time;
			real shield_boost_radius_max;
			real shield_boost_period;
			string_id shield_boost_damage_section_name;

			/* Detonation Thresholds */

			real detonation_shield_threshold;
			real detonation_body_vitality;
			real proximity_radius;
			real proximity_detonation_chance;
			c_typed_tag_reference<EQUIPMENT_TAG> proximity_equipment;
		};
		static_assert(sizeof(s_c_character_engineer_properties_internal) == 56, "struct s_c_character_engineer_properties_internal is invalid size");

		struct s_c_character_inspect_properties_internal
		{
			real stop_distance;
			real_bounds inspect_time;
			real_bounds search_range;
		};
		static_assert(sizeof(s_c_character_inspect_properties_internal) == 20, "struct s_c_character_inspect_properties_internal is invalid size");

		struct s_c_character_vehicleentranceexit_properties_internal
		{
			real max_distance_from_actor;
			real minimum_distance_from_player;
			real minimum_distance_from_vehicle;
			real perceived_danger_threshold;

			/* Total Health Percentage */

			real minimum_health_to_enter;
			real health_percentage_to_exit;

			/* Remaining Damage Sections Percentage */

			real threshold_to_enter;
			real threshold_to_exit;
			real chance_to_exit_vehicle;
			real vehicle_exit_impulse_timer;
		};
		static_assert(sizeof(s_c_character_vehicleentranceexit_properties_internal) == 40, "struct s_c_character_vehicleentranceexit_properties_internal is invalid size");

		struct s_characterweaponpreferences
		{
			c_enum<e_characterweaponpreferencestier, char> tier_category;
			char generated_padb31f[3]; // padding
			long weight;
			long multi_tier_multiplier;
		};
		static_assert(sizeof(s_characterweaponpreferences) == 12, "struct s_characterweaponpreferences is invalid size");

		struct s_characterweaponmodeselector
		{
			c_flags<e_characterweaponmodeselectorinitiatorflags, long, k_characterweaponmodeselectorinitiatorflags_count> initiators;
			c_flags<e_characterweaponmodeselectorrequirementflags, long, k_characterweaponmodeselectorrequirementflags_count> required_conditions;
			real cluster_radius;
			long min_cluster_count;
			real_bounds target_range_bounds;
			real_bounds danger_bounds;
			real activation_chance;
			real activation_check_delay;
			real projectile_error;
			real_bounds lifetime;
			long max_burst_count;
			c_enum<e_characterweaponmodeselectortriggerbehavior, char> trigger_behavior;
			char generated_padabe7[3]; // padding
		};
		static_assert(sizeof(s_characterweaponmodeselector) == 60, "struct s_characterweaponmodeselector is invalid size");

		struct s_characterfiringprogram
		{

			/* Precision */

			// custom target_position
			real_bounds tracking;
			real_bounds matching_fraction;
			real_bounds matching_spring_force;
			real_bounds leading;
			// custom value
			// custom aiming_error
			real_bounds error_distance;
			angle_bounds error_angle;
			angle_bounds error_max_angle;
			// custom value
			// custom linear_burst_geo
			c_enum<e_characterfiringprogramlinearburststyle, char> burst_line_style;
			char generated_paddb86[3]; // padding
			angle_bounds burst_line_angle;
			real_bounds burst_origin_radius;
			angle_bounds burst_origin_angle;
			real_bounds burst_return_length_min;
			real_bounds burst_return_length_max;
			angle_bounds burst_return_angle;
			real_bounds burst_maximum_angular_vel;
			angle_bounds burst_maximum_error_angle;
			// custom value

			/* Hostility */

			real_bounds rate_of_fire;
			real_bounds weapon_damage_mod;
			// custom burst_pattern
			real_bounds duration_min;
			real_bounds duration_max;
			real_bounds separation_min;
			real_bounds separation_max;
			// custom value
			// custom burst_noise
			real_bounds amount;
			real_bounds min_period;
			real_bounds max_period;
			// custom value
		};
		static_assert(sizeof(s_characterfiringprogram) == 196, "struct s_characterfiringprogram is invalid size");

		struct s_vehiclevelocitytargeting
		{
			real vehicle_velocity_override_preference;
			real velocity_threshold;
		};
		static_assert(sizeof(s_vehiclevelocitytargeting) == 8, "struct s_vehiclevelocitytargeting is invalid size");

		struct s_characterweaponunittargeting
		{
			c_enum<e_i343modelmodeltargetcategory, char> category;
			char generated_pad0052[3]; // padding
			real preference;

			/* Vehicle Velocity Targeting Prefernces */

			c_typed_tag_block<s_vehiclevelocitytargeting> vehicle_velocity_based_targeting_block;
		};
		static_assert(sizeof(s_characterweaponunittargeting) == 20, "struct s_characterweaponunittargeting is invalid size");

		struct s_characterweaponmodeprefirebeam
		{
			angle initial_error_angle;

			/* Radius Decay */

			// custom radius_decay_function
			s_functiondefinition radius_decay_function;

			/* Beam Spin */

			// custom beam_spin_function
			s_functiondefinition beam_spin_function;
			c_typed_tag_reference<EFFECT_TAG> beam_effect;
			c_typed_tag_reference<AREA_SCREEN_EFFECT_TAG> full_screen_effect;

			/* Marker overrides */

			string_id start_marker;
			string_id fallback_marker;
		};
		static_assert(sizeof(s_characterweaponmodeprefirebeam) == 84, "struct s_characterweaponmodeprefirebeam is invalid size");

		struct s_characterweaponmode
		{
			string_id mode_name;
			c_flags<e_weaponpropertiesflags, long, k_weaponpropertiesflags_count> weapons_flags;

			/* Combat ranges */

			real maximum_firing_range;
			real minimum_firing_range;
			real_bounds normal_combat_range;
			real bombardment_range;
			real max_special_target_distance;
			real max_extreme_target_distance;
			c_enum<e_combatrangeignorelowerboundoption, char> lower_bound_option;
			char generated_pad6ff4[3]; // padding

			/* Ballistic Firing */

			real_bounds ballistic_firing_bounds;
			real_bounds ballistic_fraction_bounds;

			/* Use Preferences */

			real_vector3d favored_ranges;
			real_vector3d range_ratings;
			real anti_vehicle_rating_;
			real scariness_threshold;

			/* Behavior */

			real_bounds first_burst_delay_time;
			real death_fire_wildly_chance;
			real death_fire_wildly_time;
			real_fraction heat_vent_min_percent;
			real_fraction ammo_reload_min_percent;
			real_fraction reload_chance_if_not_empty;
			real heat_vent_cooldown;
			real_vector3d custom_stand_gun_offset;
			real_vector3d custom_crouch_gun_offset;
			long blocked_shot_count;
			real max_pre_fire_time_normal;
			real max_pre_fire_time_heroic;
			real max_pre_fire_time_legendary;
			c_typed_tag_block<s_characterweaponmodeselector> selection_properties_block;
			c_enum<e_i343aitokensystemlevel, char> threat_level;
			char generated_pad89d5[3]; // padding
			real effectiveness_token_close_player_distance;
			c_typed_tag_block<s_characterfiringprogram> firing_program_block;

			/* Unit Target Preference */

			c_typed_tag_block<s_characterweaponunittargeting> unit_target_preference_block;
			c_typed_tag_block<s_characterweaponmodeprefirebeam> prefire_beam_block;
		};
		static_assert(sizeof(s_characterweaponmode) == 216, "struct s_characterweaponmode is invalid size");

		struct s_characterprototypeweaponpropertiesinternal
		{
			c_typed_tag_reference<WEAPON_TAG> weapon;

			/* Weapon drop when killed */

			real_bounds drop_weapon_loaded;
			short_bounds drop_weapon_ammo;
			c_typed_tag_reference<DAMAGE_EFFECT_TAG> weapon_melee_damage;

			/* Accuracy */

			real_bounds normal_accuracy_bounds;
			real normal_accuracy_time;
			real_bounds heroic_accuracy_bounds;
			real heroic_accuracy_time;
			real_bounds legendary_accuracy_bounds;
			real legendary_accuracy_time;
			c_typed_tag_block<s_characterweaponpreferences> weapon_preferences_block;
			c_typed_tag_block<s_characterweaponmode> weapon_modes_block;
		};
		static_assert(sizeof(s_characterprototypeweaponpropertiesinternal) == 104, "struct s_characterprototypeweaponpropertiesinternal is invalid size");

		struct s_prototypecharacterstyle
		{
			string_id style_name;
			real precision;
			real hostility;
			real_bounds precision_range;
			real_bounds hostility_range;
		};
		static_assert(sizeof(s_prototypecharacterstyle) == 28, "struct s_prototypecharacterstyle is invalid size");

		struct s_c_character_grenade_properties_internal
		{
			c_flags<e_charactergrenadesflags, long, k_charactergrenadesflags_count> grenades_flags;
			c_enum<e_unitgrenadetype, char> grenade_type;
			char generated_padcce0[1]; // padding
			c_enum<e_grenadetrajectorytypes, short> trajectory_type;
			short minimum_enemy_count;
			char generated_pade6c1[2]; // padding
			real enemy_radius;
			// custom throw_error
			angle throw_error_easy;
			angle throw_error_normal;
			angle throw_error_heroic;
			angle throw_error_legendary;
			// custom value
			// custom damage_modifier
			real damage_modifier_easy;
			real damage_modifier_normal;
			real damage_modifier_heroic;
			real damage_modifier_legendary;
			// custom value
			real grenade_ideal_velocity;
			real grenade_velocity;
			real_bounds grenade_ranges;
			real collateral_damage_radius;
			real_fraction grenade_chance;
			real active_shield_modifier;
			real grenade_throw_delay;
			real global_grenade_delay;
			real_fraction grenade_uncover_chance;
			real_fraction anti_vehicle_grenade_chance;

			/* Grenade drop when killed */

			short_bounds grenade_count;
			real dont_drop_grenades_chance;
		};
		static_assert(sizeof(s_c_character_grenade_properties_internal) == 100, "struct s_c_character_grenade_properties_internal is invalid size");

		struct s_vehiclestrafingproperties
		{
			real strafe_min_distance;
			real strafe_abort_distance;
			real defensive_strafe_abort_distance;
		};
		static_assert(sizeof(s_vehiclestrafingproperties) == 12, "struct s_vehiclestrafingproperties is invalid size");

		struct s_vehicleflyingholdingpatternproperties
		{
			real holding_pattern_elevation;
			real_fraction holding_pattern_speed_percentage;
			real holding_pattern_radius;
			real_fraction max_turn_angle_percentage;
		};
		static_assert(sizeof(s_vehicleflyingholdingpatternproperties) == 16, "struct s_vehicleflyingholdingpatternproperties is invalid size");

		struct s_vehicleflyingpreengageproperties
		{
			real_bounds pre_engage_time;
			real pre_engage_elevation;
			real pre_engage_radius;
		};
		static_assert(sizeof(s_vehicleflyingpreengageproperties) == 16, "struct s_vehicleflyingpreengageproperties is invalid size");

		struct s_vehicleflyingsuppressedproperties
		{
			real_bounds suppressed_time;
			real suppressed_damage_threshold;
			real suppressed_retreat_distance;
			real suppressed_elevation;
			real suppressed_radius;
		};
		static_assert(sizeof(s_vehicleflyingsuppressedproperties) == 24, "struct s_vehicleflyingsuppressedproperties is invalid size");

		struct s_vehicleflyingaggressiveengageproperties
		{
			short_bounds aggressive_loops;
		};
		static_assert(sizeof(s_vehicleflyingaggressiveengageproperties) == 4, "struct s_vehicleflyingaggressiveengageproperties is invalid size");

		struct s_vehicleflyingdefensiveengageproperties
		{
			real_bounds defensive_time;
		};
		static_assert(sizeof(s_vehicleflyingdefensiveengageproperties) == 8, "struct s_vehicleflyingdefensiveengageproperties is invalid size");

		struct s_vehicleflyingfallbackproperties
		{
			real_bounds combat_elevation;
			real fallback_minimum_distance;
			real flyby_distance;
		};
		static_assert(sizeof(s_vehicleflyingfallbackproperties) == 16, "struct s_vehicleflyingfallbackproperties is invalid size");

		struct s_c_character_vehicle_properties_internal
		{
			c_typed_tag_reference<UNIT_TAG> unit;
			c_typed_tag_reference<STYLE_TAG> style;
			c_typed_tag_reference<BEHAVIORTREE_TAG> behavior_tree;
			c_typed_tag_reference<BEHAVIORTREE_TAG> nondriver_behavior_tree;

			/* Flying Avoidance */

			real lookahead_time;
			real roll_change_magnitude;
			real roll_decay_multiplier;
			real throttle_grace_period;
			real minimum_throttle;

			/* Vehicle flags */

			c_flags<e_charactervehicleflags, long, k_charactervehicleflags_count> vehicle_flags$2;

			/* Hover Perturbation New */

			real hover_deceleration_distance;
			real hover_offset_distance;

			/* Hover Perturbation Fallback */

			real hover_allow_perturbation_speed;
			real hover_random_x_axis_period;
			real hover_random_y_axis_period;
			real hover_random_z_axis_period;
			real hover_random_radius;
			real hover_anchor_approach_speed_limit;
			real_bounds hover_anchor_throttle_scale_distance;
			real_bounds hover_anchor_xy_throttle_scale;
			real_bounds hover_anchor_z_throttle_scale;
			real hover_throttle_min_z;

			/* Pathfinding */

			real ai_pathfinding_radius;
			real ai_avoidance_radius;
			real ai_destination_radius;
			real ai_deceleration_distance;
			real roughly_the_time_it_would_take_this_vehicle_to_stop_default_is_2_seconds;

			/* Turning */

			real ai_turning_radius;

			/* Steering */

			angle ai_banshee_steering_maximum;
			real ai_max_steering_angle;
			real ai_max_steering_delta;
			real ai_oversteering_scale;
			real ai_sideslip_distance_combat;
			real ai_sideslip_distance_non_combat;
			real ai_avoidance_distance;
			real ai_min_urgency;
			angle destination_behind_angle;
			real skid_scale;
			angle aiming_velocity_maximum;
			angle aiming_acceleration_maximum;

			/* Throttle */

			real ai_throttle_maximum;
			real ai_reverse_throttle_maximum;
			real ai_goal_min_throttle_scale;
			real ai_turn_min_throttle_scale;
			real ai_direction_min_throttle_scale;
			real ai_skid_min_throttle_scale;
			angle skid_attentuation_max_angle;
			real ai_acceleration_scale;
			real ai_throttle_blend;
			real theoretical_max_speed;
			real error_scale;
			real throttle_ramp_step;

			/* Speed */

			real target_speed;

			/* Boost For Locomotion - Directional Ground Vehicles */

			real_fraction ai_boost_forward_facing_angle;
			real ai_min_throttle_to_boost;

			/* Combat */

			angle ai_allowable_aim_deviation_angle;
			real melee_cooldown;

			/* Behavior */

			real ai_charge_tight_angle_distance;
			real ai_charge_tight_angle;
			real ai_charge_repeat_timeout;
			real ai_charge_look_ahead_time;
			real ai_charge_consider_distance;
			real ai_charge_abort_distance;
			real ai_charge_abort_close_distance;
			real ai_charge_max_out_of_area_distance;
			real vehicle_ram_timeout;
			real ram_paralysis_time;
			real ai_cover_damage_threshold;
			real ai_cover_shield_damage_threshold;
			real ai_cover_min_distance;
			real ai_cover_time;
			real ai_cover_min_boost_distance;
			real turtling_recent_damage_threshold;
			real turtling_min_time;
			real turtling_timeout;
			c_typed_tag_block<s_vehiclestrafingproperties> vehicle_strafing_properties_block;
			c_typed_tag_block<s_vehicleflyingholdingpatternproperties> vehicle_flying_holding_pattern_properties_block;
			c_typed_tag_block<s_vehicleflyingpreengageproperties> vehicle_flying_preengage_properties_block;
			c_typed_tag_block<s_vehicleflyingsuppressedproperties> vehicle_flying_suppressed_properties_block;
			c_typed_tag_block<s_vehicleflyingaggressiveengageproperties> vehicle_flying_aggressive_engage_properties_block;
			c_typed_tag_block<s_vehicleflyingdefensiveengageproperties> vehicle_flying_defensive_engage_properties_block;
			c_typed_tag_block<s_vehicleflyingfallbackproperties> vehicle_flying_fallback_properties_block;
			c_enum<e_objectaisize, short> obstacle_ignore_size;
			char generated_pad354a[2]; // padding
		};
		static_assert(sizeof(s_c_character_vehicle_properties_internal) == 448, "struct s_c_character_vehicle_properties_internal is invalid size");

		struct s_c_character_flying_movement_properties_internal
		{
			c_typed_tag_reference<UNIT_TAG> vehicle;
			// custom default_values

			/* Vector Weights */

			real facing;
			real perturbation;
			real volume_avoidance;
			real volume_perturbation;
			real volume_cover;
			real flocking;
			real target;
			real target_tail;

			/* Area Selection */

			real_bounds area_reselect_time;

			/* Idle */

			real_bounds idle_time;

			/* Cover */

			real_bounds unsafe_cover_reselect_time;
			real_bounds cover_heading_reselect_time;
			real max_cover_search_distance;
			real max_cover_impulse_distance;
			real_bounds spline_cooldown_time;

			/* Volume Avoidance */

			real volume_influence_distance;
			real volume_perturbation_phase;
			real volume_bounding_distance;

			/* Approach */

			real volume_approach_distance;
			real volume_break_off_distance;
			real minimum_approach_distance;
			real_bounds collision_avoidance_range;

			/* Evasion */

			real_bounds evade_time;
			real_fraction evade_body_damage_threshold;
			real_fraction evade_shield_damage_threshold;
			real bogey_retreat_time;
			real bogey_retreat_distance;

			/* Flocking */

			real_bounds flock_radius;
			angle forward_follow_angle;
			angle behind_follow_angle;

			/* Tailing */

			real min_tailing_time;
			real_bounds tailing_radius;
			angle tailing_cone_angle;

			/* Strafing */

			real volume_strafe_distance;
			real strafe_min_distance;
			real strafe_above_distance;
			real strafe_abort_distance;
			real strafe_timeout;

			/* Attitude Control */

			angle max_descend_angle;
			angle max_ascend_angle;

			/* Shooting */

			angle shooting_cone_angle;

			/* Evasive Maneuvers */

			real_fraction missile_dodge_change;
			real ideal_missile_dodge_distance;
			real_bounds dodge_timeout;
		};
		static_assert(sizeof(s_c_character_flying_movement_properties_internal) == 232, "struct s_c_character_flying_movement_properties_internal is invalid size");

		struct s_characterequipmentuseconditions
		{

			/* Use Conditions */

			c_enum<e_equipmentusewhen, short> use_when;
			char generated_padd2ce[2]; // padding
			real health_shield_use_threshold;
		};
		static_assert(sizeof(s_characterequipmentuseconditions) == 8, "struct s_characterequipmentuseconditions is invalid size");

		struct s_characterequipmentusage
		{

			/* Equipment Use */

			c_typed_tag_block<s_characterequipmentuseconditions> use_conditions_block;
			c_enum<e_equipmentusehow, short> use_how;
			char generated_padd6c8[2]; // padding

			/* Skip Fraction */

			real easy_normal;
			real legendary;
			real chance_per_second;
		};
		static_assert(sizeof(s_characterequipmentusage) == 28, "struct s_characterequipmentusage is invalid size");

		struct s_character_equipment_definition
		{

			/* Equipment */

			c_typed_tag_reference<EQUIPMENT_TAG> equipment$2;
			c_flags<e_characterequipmentflags, long, k_characterequipmentflags_count> flags;
			real relative_drop_chance;
			string_id animation;
			c_typed_tag_block<s_characterequipmentusage> equipment_use_block;
		};
		static_assert(sizeof(s_character_equipment_definition) == 40, "struct s_character_equipment_definition is invalid size");

		struct s_s_character_stimuli_response_definition
		{

			/* Stimulus Response */

			string_id stimulus_name;
			c_typed_tag_reference<CHARACTER_TAG> override_character;
			char resolved_stimulus[8]; // skip
		};
		static_assert(sizeof(s_s_character_stimuli_response_definition) == 28, "struct s_s_character_stimuli_response_definition is invalid size");

		struct s_s_campaign_metagame_bucket
		{
			c_flags<e_c_campaign_metagame_bucket_flags, char, k_c_campaign_metagame_bucket_flags_count> flags;
			c_enum<e_c_campaign_metagame_bucket_type, char> type;
			c_enum<e_c_campaign_metagame_bucket_class, char> _class;
			char generated_pad6695[1]; // padding
			short point_count;
		};
		static_assert(sizeof(s_s_campaign_metagame_bucket) == 6, "struct s_s_campaign_metagame_bucket is invalid size");

		struct s_character_activity_objects
		{
			string_id activity_name;
			c_typed_tag_reference<CRATE_TAG> crate;
			// custom value
			string_id crate_marker_name;
			// custom value
			string_id unit_marker_name;
		};
		static_assert(sizeof(s_character_activity_objects) == 28, "struct s_character_activity_objects is invalid size");

		struct s_c_character_pain_screen_properties_internal
		{

			/* Pain Reactions */

			real pain_screen_duration;
			real pain_screen_region_fade_out_duration;
			real_fraction pain_screen_region_fade_out_weight_threshold;
			angle pain_screen_angle_tolerance;
			angle pain_screen_angle_randomness;

			/* Defensive Reactions */

			real defensive_screen_duration;
			real_fraction defensive_screen_scrub_fallback_fraction;
		};
		static_assert(sizeof(s_c_character_pain_screen_properties_internal) == 28, "struct s_c_character_pain_screen_properties_internal is invalid size");

		struct s_charactermeleeanimationscalingpropertiesinternal
		{

			/* Easy Scaling */

			real easy_windup_scaling;
			real easy_recovery_scaling;

			/* Normal Scaling */

			real normal_windup_scaling;
			real normal_recovery_scaling;

			/* Heroic Scaling */

			real heroic_windup_scaling;
			real heroic_recovery_scaling;

			/* Legendary Scaling */

			real legendary_windup_scaling;
			real legendary_recovery_scaling;
		};
		static_assert(sizeof(s_charactermeleeanimationscalingpropertiesinternal) == 32, "struct s_charactermeleeanimationscalingpropertiesinternal is invalid size");

		struct s_c_character_closequartersdefenseblast_properties_internal
		{
			// custom close_quarters_defense_blast_parameters
			// custom activation_chance
			real_fraction activation_chance_easy;
			real_fraction activation_chance_normal;
			real_fraction activation_chance_heroic;
			real_fraction activation_chance_legendary;
			// custom value
			real cooldown;
			real_bounds attack_range;
			string_id marker;
			c_typed_tag_reference<DAMAGE_EFFECT_TAG> damage_effect;
			c_typed_tag_reference<EFFECT_TAG> effect;
			// custom value
		};
		static_assert(sizeof(s_c_character_closequartersdefenseblast_properties_internal) == 64, "struct s_c_character_closequartersdefenseblast_properties_internal is invalid size");

		struct s_c_character_bishop_properties_internal
		{

			/* Repair */

			c_typed_tag_reference<EFFECT_TAG> repair_beam_effect;

			/* Protect Allies */

			real min_follow_distance_;

			/* Resurrect Allies */

			real resurrection_initiation_delay_time_seconds_;
			real resurrection_charge_up_time_seconds_;
			real resurrection_give_up_time_seconds_;
			c_typed_tag_reference<EFFECT_TAG> resurrection_ground_effect_;
			c_typed_tag_reference<EFFECT_TAG> res_area_scan_start_effect_;
			c_typed_tag_reference<EFFECT_TAG> res_area_scan_success_effect_;
			c_typed_tag_reference<EFFECT_TAG> res_area_scan_failure_effect_;

			/* Shard Spawning */

			c_typed_tag_reference<EFFECT_TAG> shard_spawn_ground_effect_;
			real shard_creation_delay_seconds_;
			real_bounds spawn_delay_seconds_;

			/* Healing Allies */

			real healing_time;
		};
		static_assert(sizeof(s_c_character_bishop_properties_internal) == 128, "struct s_c_character_bishop_properties_internal is invalid size");

		struct s_characterhealingpropertiesinternal
		{
			real healing_delay_time;
			real healing_standby_time;
		};
		static_assert(sizeof(s_characterhealingpropertiesinternal) == 8, "struct s_characterhealingpropertiesinternal is invalid size");

		struct s_c_character_packmaster_properties_internal
		{
			c_typed_tag_reference<CHARACTER_TAG> pack_character_ancestor_;
			real command_radius;
			long group_fire_min_count;
			long group_fire_max_count;
			// custom group_fire_chance
			real_fraction group_fire_chance_easy;
			real_fraction group_fire_chance_normal;
			real_fraction group_fire_chance_heroic;
			real_fraction group_fire_chance_legendary;
			// custom value
			real group_fire_burst_time;
			real group_fire_cooldown_time;
			long group_fire_burst_count;
			real group_fire_burst_delay;
			real group_fire_target_range;
			real lion_charge_max_range;
			real lion_charge_chance;
			real lion_charge_melee_range;
			real lion_charge_fire_duration;
			real lion_charge_throttle_override;
			real lion_charge_abort_range;
			real pack_charge_distance;
			real pack_charge_cooldown;
		};
		static_assert(sizeof(s_c_character_packmaster_properties_internal) == 96, "struct s_c_character_packmaster_properties_internal is invalid size");

		struct s_c_character_dynamic_task_properties_internal
		{
			c_flags<e_i343aiopportunityrequirementflags, long, k_i343aiopportunityrequirementflags_count> agent_filter_flags_;
			c_flags<e_taskgenerationflags, long, k_taskgenerationflags_count> task_generation_flags_;
			real_fraction protect_request_shield_level_;
			real_fraction protect_request_body_level_;
			real_fraction resurrection_req_chance_;
			real shield_task_priority_;
			real_bounds protect_task_priorities_min_health___max_health_;
			real resurrection_task_priority_;
			real shield_during_resurrection_task_priority_;
			c_typed_tag_reference<CRATE_TAG> shield_crate_override_;
			real heal_request_shield_level_;
			real heal_request_body_level_;
		};
		static_assert(sizeof(s_c_character_dynamic_task_properties_internal) == 64, "struct s_c_character_dynamic_task_properties_internal is invalid size");

		struct s_slowadvance
		{

			/* Slow Advance */

			real slow_range;
			string_id slow_throttle_style;
			real exit_range;
		};
		static_assert(sizeof(s_slowadvance) == 12, "struct s_slowadvance is invalid size");

		struct s_genericadvanceattack
		{
			c_flags<e_genericadvanceattackadvanceattackflags, long, k_genericadvanceattackadvanceattackflags_count> flags;
			real_bounds range;
			real max_scariness;
			c_enum<e_i343aitokensystemlevel, char> threat_level;
			char generated_pad8a75[3]; // padding
			// custom activation_chance
			real_fraction activation_chance_easy;
			real_fraction activation_chance_normal;
			real_fraction activation_chance_heroic;
			real_fraction activation_chance_legendary;
			// custom value
			real attack_timeout;
			real melee_range;
			real_fraction shield_down_threshold;
			real abort_danger_threshold;
			real abort_distance;
			real outside_area_range;
			real berserk_abort_distance;
			real cooldown;
			real_fraction tell_animation_chance;
			real tell_animation_cooldown;
			string_id throttle_style;
			s_slowadvance slow_advance;
		};
		static_assert(sizeof(s_genericadvanceattack) == 92, "struct s_genericadvanceattack is invalid size");

		struct s_meleeattackdefinition
		{
			c_flags<e_meleeattackdefinitiondirectionflags, long, k_meleeattackdefinitiondirectionflags_count> direction_flags;
			string_id animation_name;
			c_typed_tag_reference<DAMAGE_EFFECT_TAG> damage_override;
		};
		static_assert(sizeof(s_meleeattackdefinition) == 24, "struct s_meleeattackdefinition is invalid size");

		struct s_meleecombodefinition
		{
			c_flags<e_meleecombodefinitionflags, long, k_meleecombodefinitionflags_count> combo_flags;
			real weight_modifier;
			c_typed_tag_block<s_meleeattackdefinition> attacks_block;
		};
		static_assert(sizeof(s_meleecombodefinition) == 20, "struct s_meleecombodefinition is invalid size");

		struct s_c_character_rushattack_properties_internal
		{

			/* Rush Attack */

			s_genericadvanceattack generic_advance_attack;

			/* Rush specific settings */

			c_flags<e_c_character_rushattack_properties_internalrushflags, long, k_c_character_rushattack_properties_internalrushflags_count> rush_flags;
			real leader_abandoned_chance;
			real_fraction berserk_chance;
			real berserk_recheck_cooldown;
			real min_abort_time;
			real min_abort_dist_travelled;
			real_fraction zig_zag_chance;
			angle zig_zag_angle;
			real zig_zag_period;
			angle tackle_angle;
			real tackle_wait;
			c_typed_tag_block<s_meleecombodefinition> combo_definitions_block;
			string_id taunt_animation_name;
		};
		static_assert(sizeof(s_c_character_rushattack_properties_internal) == 152, "struct s_c_character_rushattack_properties_internal is invalid size");

		struct s_c_character_leapattack_properties_internal
		{

			/* Leap Attack */

			s_genericadvanceattack generic_advance_attack;

			/* Leap specific settings */

			c_flags<e_c_character_leapattack_properties_internalleapflags, long, k_c_character_leapattack_properties_internalleapflags_count> leap_flags;
			real ideal_leap_speed;
			real max_leap_speed;
			real_fraction ballistic_fraction;
			real prediction_percent;
			real shortfall;
			real swoop_accel_rate;
			real swoop_accel_time;
			angle swoop_max_deviation;
		};
		static_assert(sizeof(s_c_character_leapattack_properties_internal) == 128, "struct s_c_character_leapattack_properties_internal is invalid size");

		struct s_c_character_teleportattack_properties_internal
		{

			/* Teleport attack */

			s_genericadvanceattack generic_advance_attack;

			/* Teleport specific settings */

			real destination_distance;
			real side_step_distance;
			real forward_distance;
			real tracking_distance;
			real runup_time;
			real position_pause;
			real escape_cooldown;
			real lock_distance;
			c_typed_tag_reference<EFFECT_TAG> launch_effect;
			c_typed_tag_reference<EFFECT_TAG> land_effect;
		};
		static_assert(sizeof(s_c_character_teleportattack_properties_internal) == 156, "struct s_c_character_teleportattack_properties_internal is invalid size");

		struct s_characterjinkandshootpropertiesinternal
		{

			/* Jink and Shoot */

			real_bounds start_distance;
			real start_max_offset_angle;
			real min_start_teleport_distance;
			long number_of_intermediate_teleports;
			real max_offset_angle;
			real_bounds side_step_distance;
			real_bounds forward_distance;
			c_typed_tag_reference<EFFECT_TAG> launch_effect;
			c_typed_tag_reference<EFFECT_TAG> land_effect;
			string_id effect_marker;
			c_typed_tag_reference<WEAPON_TAG> jink_and_shoot_weapon;
		};
		static_assert(sizeof(s_characterjinkandshootpropertiesinternal) == 92, "struct s_characterjinkandshootpropertiesinternal is invalid size");

		struct s_characterteleportandtacklepropertiesinternal
		{

			/* Teleport and Tackle */

			real_bounds destination_distance;
			real max_offset_angle;
			real duration_to_align;
			real min_teleport_distance;
			c_typed_tag_reference<EFFECT_TAG> launch_effect;
			c_typed_tag_reference<EFFECT_TAG> land_effect;
			string_id effect_marker;
			c_typed_tag_reference<WEAPON_TAG> teleport_and_tackle_weapon;
		};
		static_assert(sizeof(s_characterteleportandtacklepropertiesinternal) == 72, "struct s_characterteleportandtacklepropertiesinternal is invalid size");

		struct s_characterteleportandtauntpropertiesinternal
		{

			/* Teleport and Taunt Behavior */

			string_id custom_animation_name;
			real taunt_frequency;
			real taunt_chance;
			real_bounds destination_distance;
			real max_offset_angle;
			real min_teleport_distance;
			c_typed_tag_reference<EFFECT_TAG> launch_effect;
			c_typed_tag_reference<EFFECT_TAG> land_effect;
			string_id effect_marker;
		};
		static_assert(sizeof(s_characterteleportandtauntpropertiesinternal) == 64, "struct s_characterteleportandtauntpropertiesinternal is invalid size");

		struct s_c_character_desperationrush_properties_internal
		{
			c_flags<e_c_character_desperationrush_properties_internalflags, long, k_c_character_desperationrush_properties_internalflags_count> properties;
			real range;
		};
		static_assert(sizeof(s_c_character_desperationrush_properties_internal) == 8, "struct s_c_character_desperationrush_properties_internal is invalid size");

		struct s_characterproximitymeleepropertiesinternal
		{

			/* Proximity Melee Impulse */

			real range;
			real cooldown;
			real outside_area_range;
		};
		static_assert(sizeof(s_characterproximitymeleepropertiesinternal) == 12, "struct s_characterproximitymeleepropertiesinternal is invalid size");

		struct s_characterdivebombkamikazepropertiesinternal
		{
			real_fraction ally_target_chance;
			real_fraction enemy_target_chance;
			real_bounds travel_distance;
			real travel_time_before_exploding;
			c_typed_tag_reference<PROJECTILE_TAG> impact_detonation_projectile;
			real_bounds target_error_range;
			c_flags<e_divebombkamikazeflags, char, k_divebombkamikazeflags_count> behavior_flags;
			char generated_pad94ce[3]; // padding
			real_fraction kamikaze_below_health_percentage;
			real_fraction chance_to_kamikaze_at_low_health_per_second;
			real_fraction chance_to_kamikaze_when_last_man_per_second;
			real a_pause_between_kamikaze_anim_and_dive_bomb_actiondefault_2_seconds;
		};
		static_assert(sizeof(s_characterdivebombkamikazepropertiesinternal) == 64, "struct s_characterdivebombkamikazepropertiesinternal is invalid size");

		struct s_characterpostcombatpropertiesinternal
		{
			real_fraction shoot_corpse_chance;
			real_bounds postcombat_phase_1_time;
		};
		static_assert(sizeof(s_characterpostcombatpropertiesinternal) == 12, "struct s_characterpostcombatpropertiesinternal is invalid size");

		struct s_c_character_pack_stalk_properties_internal
		{
			real min_wander_distance_;
			real outside_area_border_;
			real_bounds position_update_delay_;
			real_fraction throttle_in_cover_;
		};
		static_assert(sizeof(s_c_character_pack_stalk_properties_internal) == 20, "struct s_c_character_pack_stalk_properties_internal is invalid size");

		struct s_c_character_fight_circle_properties_internal
		{
			real_bounds strafe_time_;
			real_bounds extra_firing_time_;
			real target_patience_time_;
			angle max_angle_from_threataxis_;
			angle nearby_inner_angle_;
			angle nearby_outer_angle_;
			string_id strafe_throttle_style_;
			string_id move_throttle_style_;
		};
		static_assert(sizeof(s_c_character_fight_circle_properties_internal) == 40, "struct s_c_character_fight_circle_properties_internal is invalid size");

		struct s_c_character_hamstring_charge_properties_internal
		{
			angle flank_angle_;
			real flank_distance_;
			real outer_engage_distance_;
			real hamstring_delay_;
			real initiate_chance_;
			real max_rush_time_;
			real melee_attack_time_min_;
			real melee_attack_time_max_;
			real max_charge_range;
		};
		static_assert(sizeof(s_c_character_hamstring_charge_properties_internal) == 36, "struct s_c_character_hamstring_charge_properties_internal is invalid size");

		struct s_c_character_forerunner_properties_internal
		{
			c_flags<e_forerunnerflags, long, k_forerunnerflags_count> forerunner_flags;
			real order_minion_charge_chance_;
			real order_minion_charge_radius_;
			real minion_charge_min_time_;
			real minion_charge_max_time_;
			real_bounds phase_to_position_distance_bounds_;
			real_bounds phase_to_position_probability_range_;
		};
		static_assert(sizeof(s_c_character_forerunner_properties_internal) == 36, "struct s_c_character_forerunner_properties_internal is invalid size");

		struct s_c_character_gravity_jump_properties_internal
		{
			// custom activation_chance
			real_fraction activation_chance_easy;
			real_fraction activation_chance_normal;
			real_fraction activation_chance_heroic;
			real_fraction activation_chance_legendary;
			// custom value
			real float_time_;
			real float_gravity_scale;
			// custom descent_gravity_scale_function
			s_functiondefinition descendgravityscalefunction;
			real slow_descend_time_;
			real jump_target_height_;
			real cooldown_;
			real trigger_distance_;
		};
		static_assert(sizeof(s_c_character_gravity_jump_properties_internal) == 60, "struct s_c_character_gravity_jump_properties_internal is invalid size");

		struct s_c_character_coop_modifier_properties_internal
		{
			real body_vitality_scale_for_2_3_players;
			real body_vitality_scale_for_4_players;
			real shield_vitality_scale_for_2_3_players;
			real shield_vitality_scale_for_4_players;
		};
		static_assert(sizeof(s_c_character_coop_modifier_properties_internal) == 16, "struct s_c_character_coop_modifier_properties_internal is invalid size");

		struct s_charactermultitargettrackedattackpropertiesinternal
		{
			// custom activation_chance
			real_fraction activation_chance_easy;
			real_fraction activation_chance_normal;
			real_fraction activation_chance_heroic;
			real_fraction activation_chance_legendary;
			// custom value
			angle targeting_angle;
			real_bounds activation_range;
			byte min_targets_in_range;
			byte bursts;
			c_enum<e_i343weapontriggerslot, char> trigger;
			char generated_pade74f[1]; // padding
			real cooldown;
		};
		static_assert(sizeof(s_charactermultitargettrackedattackpropertiesinternal) == 36, "struct s_charactermultitargettrackedattackpropertiesinternal is invalid size");

		struct s_dropobject
		{
			real_fraction easy_normal_drop_chance;
			real_fraction heroic_drop_chance;
			real_fraction legendary_drop_chance;
			c_typed_tag_reference<OBJECT_TAG> drop_object;
		};
		static_assert(sizeof(s_dropobject) == 28, "struct s_dropobject is invalid size");

		struct s_c_character_drop_objects_properties_internal
		{
			long number_of_rolls;
			real min_item_launch_velocity;
			real max_item_launch_velocity;
			real_fraction max_trajectory_radius;
			c_typed_tag_block<s_dropobject> drop_objects_block;
		};
		static_assert(sizeof(s_c_character_drop_objects_properties_internal) == 28, "struct s_c_character_drop_objects_properties_internal is invalid size");

		struct s_thresholdscript
		{

			/* Scripted Thresholds */

			c_flags<e_thresholdscriptthresholdscriptflags, long, k_thresholdscriptthresholdscriptflags_count> flags;
			c_enum<e_thresholdscriptattributetype, short> tracked_attribute;
			c_enum<e_thresholdscriptcomparisontype, short> trigger_when;
			real threshold_value;
			real recheck_buffer;
			real recheck_cooldown;
			c_static_string<256> function;
		};
		static_assert(sizeof(s_thresholdscript) == 276, "struct s_thresholdscript is invalid size");

		struct s_c_character_customscript_properties_internal
		{
			c_typed_tag_block<s_thresholdscript> scripted_threshold_block;
		};
		static_assert(sizeof(s_c_character_customscript_properties_internal) == 12, "struct s_c_character_customscript_properties_internal is invalid size");

		struct s_character_definition
		{
			s_anytag_struct_definition anytag;
			c_flags<e_characterflags, long, k_characterflags_count> character_flags;
			c_typed_tag_reference<CHARACTER_TAG> parent_character;
			c_typed_tag_reference<UNIT_TAG> unit;
			c_typed_tag_reference<CREATURE_TAG> creature;
			c_typed_tag_reference<STYLE_TAG> style;
			c_typed_tag_reference<CHARACTER_TAG> major_character;
			c_typed_tag_reference<CHARACTER_TAG> mythic_skull_character;
			c_typed_tag_block<s_character_variant> variants_block;
			c_typed_tag_block<s_c_character_voice_properties_internal> voice_block;
			c_typed_tag_block<s_c_character_development_status_properties_internal> development_status_block;
			c_typed_tag_block<s_c_character_general_properties_internal> general_properties_block;
			c_typed_tag_block<s_c_character_proto_spawn_properties_internal> proto_spawn_properties_block;
			c_typed_tag_block<s_c_character_interact_properties_internal> interact_properties_block;
			c_typed_tag_block<s_c_character_emotions_properties_internal> emotion_properties_block;
			c_typed_tag_block<s_c_character_vitality_properties_internal> vitality_properties_block;
			c_typed_tag_block<s_c_character_placement_properties_internal> placement_properties_block;
			c_typed_tag_block<s_c_character_base_perception_properties_internal> base_perception_properties_block;
			c_typed_tag_block<s_c_character_perception_properties_internal> perception_properties_block;
			c_typed_tag_block<s_c_character_target_properties_internal> target_properties_block;
			c_typed_tag_block<s_c_character_look_properties_internal> look_properties_block;
			c_typed_tag_block<s_c_character_hopping_properties_internal> hopping_properties_block;
			c_typed_tag_block<s_c_character_warp_properties_internal> warp_properties_block;
			c_typed_tag_block<s_c_character_movement_properties_internal> movement_properties_block;
			c_typed_tag_block<s_c_character_aimingfacing_properties_internal> aiming_facing_properties_block;
			c_typed_tag_block<s_c_character_deceleratedturns_properties_internal> decelerated_turns_properties_block;
			c_typed_tag_block<s_c_character_locomotionoverrides_properties_internal> locomotion_overrides_block;
			c_typed_tag_block<s_c_character_movementtweak_properties_internal> movement_tweak_properties_block;
			c_typed_tag_block<s_c_character_throttle_style_properties_internal> throttle_styles_block;
			c_typed_tag_block<s_character_movement_set> movement_sets_block;
			c_typed_tag_block<s_c_character_flocking_properties_internal> flocking_properties_block;
			c_typed_tag_block<s_c_character_swarm_properties_internal> swarm_properties_block;
			c_typed_tag_block<s_c_character_ready_properties_internal> ready_properties_block;
			c_typed_tag_block<s_c_character_engage_properties_internal> engage_properties_block;
			c_typed_tag_block<s_c_character_berserk_properties_internal> berserk_properties_block;
			c_typed_tag_block<s_c_character_weaponpickup_properties_internal> weapon_pickup_properties_block;

			/* Danger Values */

			c_typed_tag_block<s_c_character_evasion_properties_internal> evasion_properties_block;
			c_typed_tag_block<s_c_character_dodge_properties_internal> dodge_properties_block;
			c_typed_tag_block<s_characterrunawayfromvehiclepropertiesinternal> run_away_from_vehicle_properties_block;
			c_typed_tag_block<s_c_character_cover_properties_internal> cover_properties_block;
			c_typed_tag_block<s_c_character_retreat_properties_internal> retreat_properties_block;
			c_typed_tag_block<s_c_character_search_properties_internal> search_properties_block;
			c_typed_tag_block<s_c_character_presearch_properties_internal> pre_search_properties_block;
			c_typed_tag_block<s_characterrecognizingpropertiesinternal> recognizing_properties_block;
			c_typed_tag_block<s_c_character_idle_properties_internal> idle_properties_block;
			c_typed_tag_block<s_c_character_precombat_properties_internal> precombat_properties_block;
			c_typed_tag_block<s_c_character_vocalization_properties_internal> vocalization_properties_block;
			c_typed_tag_block<s_c_character_boarding_properties_internal> boarding_properties_block;
			c_typed_tag_block<s_c_character_kungfu_properties_internal> kungfu_properties_block;
			c_typed_tag_block<s_c_character_bunker_properties_internal> bunker_properties_block;
			c_typed_tag_block<s_c_character_shield_wall_properties_internal> shield_wall_properties_block;
			c_typed_tag_block<s_c_character_firing_wall_properties_internal> firing_wall_properties_block;
			c_typed_tag_block<s_characterinterposerequestpropertiesinternal> interpose_request_properties_block;
			c_typed_tag_block<s_characterinterposepropertiesinternal> interpose_properties_block;
			c_typed_tag_block<s_c_character_bounding_properties_internal> bounding_properties_block;
			c_typed_tag_block<s_c_character_deflection_properties_internal> projectile_deflection_properties_block;
			c_typed_tag_block<s_c_character_bot_properties_internal> bot_properties_block;
			c_typed_tag_block<s_c_character_evasivefight_properties_internal> evasive_fight_properties_block;
			c_typed_tag_block<s_c_character_aggressivefight_properties_internal> aggressive_fight_properties_block;
			c_typed_tag_block<s_c_character_linearadvancefight_properties_internal> linear_advance_fight_properties_block;
			c_typed_tag_block<s_characterstaticfightpropertiesinternal> static_fight_properties_block;
			c_typed_tag_block<s_characterstandgroundpropertiesinternal> stand_ground_properties_block;
			c_typed_tag_block<s_charactergrenadefightpropertiesinternal> grenade_fight_properties_block;
			c_typed_tag_block<s_c_character_coversequence_properties_internal> cover_sequence_properties_block;
			c_typed_tag_block<s_c_character_covermove_properties_internal> cover_move_properties_block;
			c_typed_tag_block<s_c_character_coverhide_properties_internal> cover_hide_properties_block;
			c_typed_tag_block<s_c_character_longrangeattack_properties_internal> long_range_attack_properties_block;
			c_typed_tag_block<s_c_character_hoistattack_properties_internal> hoist_attack_properties_block;
			c_typed_tag_block<s_c_character_hunkerdown_properties_internal> hunker_down_properties_block;
			c_typed_tag_block<s_c_character_shieldraise_properties_internal> shield_raise_properties_block;
			c_typed_tag_block<s_c_character_vehicleaggressivefight_properties_internal> vehicle_aggressive_fight_properties_block;
			c_typed_tag_block<s_c_character_vehicledefensivefight_properties_internal> vehicle_defensive_fight_properties_block;
			c_typed_tag_block<s_c_character_engineer_properties_internal> engineer_properties_block;
			c_typed_tag_block<s_c_character_inspect_properties_internal> inspect_properties_block;
			c_typed_tag_block<s_c_character_vehicleentranceexit_properties_internal> vehicle_entrance_properties_block;
			c_typed_tag_block<s_characterprototypeweaponpropertiesinternal> test_only_weapons_properties_block;
			c_typed_tag_block<s_prototypecharacterstyle> firing_styles_block;
			c_typed_tag_block<s_c_character_grenade_properties_internal> grenades_properties_block;
			c_typed_tag_block<s_c_character_vehicle_properties_internal> vehicle_properties_block;
			c_typed_tag_block<s_c_character_flying_movement_properties_internal> flying_movement_properties_block;
			c_typed_tag_block<s_character_equipment_definition> equipment_definitions_block;
			c_typed_tag_block<s_s_character_stimuli_response_definition> stimuli_responses_block;
			c_typed_tag_block<s_s_campaign_metagame_bucket> campaign_metagame_bucket_block;
			c_typed_tag_block<s_character_activity_objects> activity_objects_block;
			c_typed_tag_block<s_c_character_pain_screen_properties_internal> pain_screen_properties_block;
			c_typed_tag_block<s_charactermeleeanimationscalingpropertiesinternal> melee_animation_scaling_properties_block;
			c_typed_tag_block<s_c_character_closequartersdefenseblast_properties_internal> close_quarters_defense_blast_block;
			c_typed_tag_block<s_c_character_bishop_properties_internal> bishop_properties_block;
			c_typed_tag_block<s_characterhealingpropertiesinternal> healing_properties_block;
			c_typed_tag_block<s_c_character_packmaster_properties_internal> packmaster_properties_block;
			c_typed_tag_block<s_c_character_dynamic_task_properties_internal> dynamic_task_block;
			c_typed_tag_block<s_c_character_rushattack_properties_internal> rush_attack_block;
			c_typed_tag_block<s_c_character_leapattack_properties_internal> leap_attack_block;
			c_typed_tag_block<s_c_character_teleportattack_properties_internal> teleport_attack_block;
			c_typed_tag_block<s_characterjinkandshootpropertiesinternal> jink_and_shoot_block;
			c_typed_tag_block<s_characterteleportandtacklepropertiesinternal> teleport_and_tackle_block;
			c_typed_tag_block<s_characterteleportandtauntpropertiesinternal> teleport_and_taunt_animation_block;
			c_typed_tag_block<s_c_character_desperationrush_properties_internal> desperation_rush_block;
			c_typed_tag_block<s_characterproximitymeleepropertiesinternal> proximity_melee_block;
			c_typed_tag_block<s_characterdivebombkamikazepropertiesinternal> dive_bomb_kamikaze_block;
			c_typed_tag_block<s_characterpostcombatpropertiesinternal> post_combat_block;
			c_typed_tag_block<s_c_character_pack_stalk_properties_internal> pack_stalk_block;
			c_typed_tag_block<s_c_character_fight_circle_properties_internal> fight_circle_block;
			c_typed_tag_block<s_c_character_hamstring_charge_properties_internal> hamstring_block;
			c_typed_tag_block<s_c_character_forerunner_properties_internal> forerunner_block;
			c_typed_tag_block<s_c_character_gravity_jump_properties_internal> gravity_jump_block;
			c_typed_tag_block<s_c_character_coop_modifier_properties_internal> co_op_modifiers_block;
			c_typed_tag_block<s_charactermultitargettrackedattackpropertiesinternal> multi_target_tracked_attack_block;
			c_typed_tag_block<s_c_character_drop_objects_properties_internal> drop_objects_block;
			c_typed_tag_block<s_c_character_customscript_properties_internal> custom_scripting_block;
			char generated_pad539d[4]; // padding
		};
		static_assert(sizeof(s_character_definition) == 1344, "struct s_character_definition is invalid size");

		struct s_chromaeventdevicefiles
		{
			c_typed_tag_reference<CHROMA_TAG> keyboard_file;
			c_typed_tag_reference<CHROMA_TAG> mouse_file;
			c_typed_tag_reference<CHROMA_TAG> headset_file;
			c_typed_tag_reference<CHROMA_TAG> keypad_file;
			c_typed_tag_reference<CHROMA_TAG> mousepad_file;
			c_typed_tag_reference<CHROMA_TAG> chromalink_file;
		};
		static_assert(sizeof(s_chromaeventdevicefiles) == 96, "struct s_chromaeventdevicefiles is invalid size");

		struct s_chromaeventanimation
		{
			c_enum<e_i343chromasupporteventtype, short> event;
			c_enum<e_i343chromasupportlayering, short> layering;
			short priority;
			char generated_padd53a[2]; // padding
			// custom files
			s_chromaeventdevicefiles event_files;
			// custom value
		};
		static_assert(sizeof(s_chromaeventanimation) == 104, "struct s_chromaeventanimation is invalid size");

		struct s_chromaanimationsdefinition
		{
			s_anytag_struct_definition anytag;
			s_chromaeventanimation event_animations[15];
		};
		static_assert(sizeof(s_chromaanimationsdefinition) == 1576, "struct s_chromaanimationsdefinition is invalid size");

		struct s_chromafiletag
		{
			s_anytag_struct_definition anytag;
			s_tag_data file_data;
		};
		static_assert(sizeof(s_chromafiletag) == 36, "struct s_chromafiletag is invalid size");

		struct s_i343physicscollisionlayerauditconfigstring
		{
			c_static_string<256> _string;
		};
		static_assert(sizeof(s_i343physicscollisionlayerauditconfigstring) == 256, "struct s_i343physicscollisionlayerauditconfigstring is invalid size");

		struct s_i343physicscollisionlayerauditconfigurationtag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343physicscollisionlayerauditconfigstring> ignored_directories_block;
			c_typed_tag_block<s_i343physicscollisionlayerauditconfigstring> ignored_files_block;
		};
		static_assert(sizeof(s_i343physicscollisionlayerauditconfigurationtag) == 40, "struct s_i343physicscollisionlayerauditconfigurationtag is invalid size");

		struct s_animtranslation
		{
			long beginframe;
			long endframe;
			real_point3d value;
		};
		static_assert(sizeof(s_animtranslation) == 20, "struct s_animtranslation is invalid size");

		struct s_animrotation
		{
			long beginframe;
			long endframe;
			real_quaternion value;
		};
		static_assert(sizeof(s_animrotation) == 24, "struct s_animrotation is invalid size");

		struct s_animfloat
		{
			long beginframe;
			long endframe;
			real value;
		};
		static_assert(sizeof(s_animfloat) == 12, "struct s_animfloat is invalid size");

		struct s_animjoint
		{
			string_id name;
			c_typed_tag_block<s_animtranslation> perframetranslations_block;
			c_typed_tag_block<s_animrotation> perframerotations_block;
			c_typed_tag_block<s_animfloat> perframescales_block;
			long processingperframetranslationcount;
			long processingperframerotationcount;
			long processingperframescalecount;
		};
		static_assert(sizeof(s_animjoint) == 52, "struct s_animjoint is invalid size");

		struct s_animuserparameter
		{
			string_id name;
			c_typed_tag_block<s_animfloat> perframevalues_block;
			long processingperframevaluecount;
		};
		static_assert(sizeof(s_animuserparameter) == 20, "struct s_animuserparameter is invalid size");

		struct s_animikevent
		{
			string_id targetmarkername;
			string_id chainname;
			c_enum<e_animikusagetype, char> usagetype;
			char generated_pade6b5[3]; // padding
			c_typed_tag_block<s_animfloat> perframeeffect_block;
			c_typed_tag_block<s_animtranslation> targetmarkertranslations_block;
			c_typed_tag_block<s_animrotation> targetmarkerrotations_block;
			c_typed_tag_block<s_animfloat> targetmarkerscales_block;
			long processingperframeeffectcount;
			long processingperframetranslationcount;
			long processingperframerotationcount;
			long processingperframescalecount;
		};
		static_assert(sizeof(s_animikevent) == 76, "struct s_animikevent is invalid size");

		struct s_animjointreference
		{
			short jointreferenceindex;
		};
		static_assert(sizeof(s_animjointreference) == 2, "struct s_animjointreference is invalid size");

		struct s_animcamera
		{
			string_id name;
			c_typed_tag_block<s_animtranslation> perframetranslations_block;
			c_typed_tag_block<s_animrotation> perframerotations_block;
			c_typed_tag_block<s_animfloat> perframefocallengths_block;
			c_typed_tag_block<s_animfloat> perframefocusdistances_block;
			c_typed_tag_block<s_animfloat> perframefstops_block;
			long processingperframetranslationcount;
			long processingperframerotationcount;
			long processingperframefocallengthcount;
			long processingperframefocusdistancecount;
			long processingperframefstopcount;
		};
		static_assert(sizeof(s_animcamera) == 84, "struct s_animcamera is invalid size");

		struct s_animcliptag
		{
			s_anytag_struct_definition anytag;
			long framecount;
			real fps;
			c_typed_tag_block<s_animjoint> joints_block;
			c_typed_tag_block<s_animuserparameter> userparameters_block;
			c_typed_tag_reference<ASSET_TAG> asset;
			c_typed_tag_block<s_animikevent> ikevents_block;
			c_typed_tag_block<s_animjointreference> objectspaceoffsetjoint_block;
			c_typed_tag_block<s_animjointreference> replacementcorrectionjoint_block;
			c_typed_tag_block<s_animjointreference> fikanchorjoint_block;
			c_typed_tag_block<s_animcamera> cameras_block;
		};
		static_assert(sizeof(s_animcliptag) == 124, "struct s_animcliptag is invalid size");

		struct s_s_cloth_collision_sphere
		{
			string_id object_marker_name;
			real radius;
		};
		static_assert(sizeof(s_s_cloth_collision_sphere) == 8, "struct s_s_cloth_collision_sphere is invalid size");

		struct s_cloth_properties
		{
			c_enum<e_clothintegrationtype, short> integration_type;
			short number_iterations;
			real weight;
			real drag;
			real wind_scale;
			real wind_flappiness_scale;
			real longest_rod;
		};
		static_assert(sizeof(s_cloth_properties) == 24, "struct s_cloth_properties is invalid size");

		struct s_cloth_vertex_definition
		{
			real_point3d initial_position;
			real_vector2d uv;
		};
		static_assert(sizeof(s_cloth_vertex_definition) == 20, "struct s_cloth_vertex_definition is invalid size");

		struct s_cloth_index_definition
		{
			short index;
		};
		static_assert(sizeof(s_cloth_index_definition) == 2, "struct s_cloth_index_definition is invalid size");

		struct s_cloth_link_definition
		{
			real default_distance;
			long index1;
			long index2;
			char pad[4]; // padding
		};
		static_assert(sizeof(s_cloth_link_definition) == 16, "struct s_cloth_link_definition is invalid size");

		struct s_cloth_definition
		{
			s_anytag_struct_definition anytag;
			c_flags<e_clothflags, long, k_clothflags_count> flags;
			string_id marker_attachment_name;
			string_id secondary_axis_attachment_name;
			c_typed_tag_reference<MATERIAL_TAG> shader;

			/* Default cloth vertices */

			short grid_x_dimension;
			short grid_y_dimension;
			real grid_spacing_x;
			real grid_spacing_y;
			c_typed_tag_block<s_s_cloth_collision_sphere> collision_spheres_block;

			/* Cloth Properties */

			s_cloth_properties properties;

			/* Import or grid data */

			c_typed_tag_block<s_cloth_vertex_definition> vertices_block;
			c_typed_tag_block<s_cloth_index_definition> indices_block;
			c_typed_tag_block<s_cloth_index_definition> strip_indices_block;
			c_typed_tag_block<s_cloth_link_definition> links_block;
			long long m_pipelinestates;
		};
		static_assert(sizeof(s_cloth_definition) == 148, "struct s_cloth_definition is invalid size");

		struct s_camoscalarfunction
		{
			string_id input_variable;
			string_id range_variable;
			// custom mapping
			s_functiondefinition mapping;
		};
		static_assert(sizeof(s_camoscalarfunction) == 28, "struct s_camoscalarfunction is invalid size");

		struct s_s_camo_effect_definition
		{
			s_anytag_struct_definition anytag;

			/* Active Camo Controls */

			c_flags<e_s_camo_effect_definitionflag, short, k_s_camo_effect_definitionflag_count> flags;
			char generated_padb4a4[2]; // padding
			s_camoscalarfunction active_camo_amount;
			s_camoscalarfunction shadow_amount;
			char generated_padce85[4]; // padding
		};
		static_assert(sizeof(s_s_camo_effect_definition) == 80, "struct s_s_camo_effect_definition is invalid size");

		struct s_i343s_campaign_mission_map_definition
		{
			long map_id;
			string_id map_name;
		};
		static_assert(sizeof(s_i343s_campaign_mission_map_definition) == 8, "struct s_i343s_campaign_mission_map_definition is invalid size");

		struct s_i343s_game_globals_campaign
		{
			c_typed_tag_block<s_i343s_campaign_mission_map_definition> maps_block;
			string_id mission_name;
			string_id mission_description;
			string_id mission_background_image_uri;
			string_id mission_cms_guid;
			string_id mission_team;
		};
		static_assert(sizeof(s_i343s_game_globals_campaign) == 32, "struct s_i343s_game_globals_campaign is invalid size");

		struct s_i343campaignglobals
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343s_game_globals_campaign> campaign_globals_block;
			c_typed_tag_reference<SPAWNSETTINGS_TAG> influencer_default_spawn_settings;
			c_typed_tag_reference<CAMPAIGNUPGRADES_TAG> campaign_upgrades_definition;
			c_typed_tag_reference<COLLECTIBLESDEFINITION_TAG> collectibles;
			c_typed_tag_reference<VALORUNLOCKS_TAG> valor_rewards_definition;
			c_typed_tag_reference<GAMEPLAYMENUUIINFO_TAG> gameplay_menu_ui_info;
		};
		static_assert(sizeof(s_i343campaignglobals) == 108, "struct s_i343campaignglobals is invalid size");

		struct s_soundeventdefinitionreference
		{
			c_typed_tag_reference<SOUND_TAG> soundevent;
		};
		static_assert(sizeof(s_soundeventdefinitionreference) == 16, "struct s_soundeventdefinitionreference is invalid size");

		struct s_composerscript
		{
			c_flags<e_composerscriptflags, char, k_composerscriptflags_count> flags;
			char generated_pad585d[3]; // padding
			s_tag_data data;
			byte boolean_expression;
			char generated_pad3e7c[3]; // padding
			s_tag_data runtime_script_binary;
			c_static_string<32> runtime_script_name;
			dword runtime_script_crc;
		};
		static_assert(sizeof(s_composerscript) == 84, "struct s_composerscript is invalid size");

		struct s_composeraction
		{
			string_id name;
			long id;
			long blend_in;
			c_enum<e_i343curvecurvebuiltin, char> blend_in_curve;
			char generated_pad61be[3]; // padding
			long length;
			c_flags<e_composeractionflags, char, k_composeractionflags_count> flags;
			c_enum<e_composeractiontypeenum, char> type;
			c_enum<e_composersimulationtypeenum, char> simulation_type;
			char generated_padae73[1]; // padding
			short data_index;
			short condition_check_rate;
			s_composerscript condition_script;
		};
		static_assert(sizeof(s_composeraction) == 112, "struct s_composeraction is invalid size");

		struct s_composertextdata
		{
			s_tag_data data;
			dword script_crc;
		};
		static_assert(sizeof(s_composertextdata) == 24, "struct s_composertextdata is invalid size");

		struct s_composereditoraction
		{
			c_static_string<256> comment;
			dword color;
			c_flags<e_composereditorflags, char, k_composereditorflags_count> editor_flags;
			char generated_padd075[3]; // padding
			// custom condition_script
			s_composertextdata condition_script;
			// custom value
		};
		static_assert(sizeof(s_composereditoraction) == 288, "struct s_composereditoraction is invalid size");

		struct s_levelobjectreferenceelement
		{
			long guid;
			string_id name;
		};
		static_assert(sizeof(s_levelobjectreferenceelement) == 8, "struct s_levelobjectreferenceelement is invalid size");

		struct s_levelobjectreference
		{
			c_typed_tag_block<s_levelobjectreferenceelement> path_block;
			long guid;
		};
		static_assert(sizeof(s_levelobjectreference) == 16, "struct s_levelobjectreference is invalid size");

		struct s_composersubject
		{
			string_id object_name;
			s_tag_data raw_object_name;
			s_levelobjectreference object;
			c_enum<e_composerobjectresolutiontypeenum, char> object_resolution_type;
			char generated_padc9c6[3]; // padding
		};
		static_assert(sizeof(s_composersubject) == 44, "struct s_composersubject is invalid size");

		struct s_composerpathpoint
		{
			c_enum<e_composerpathpointtypeenum, short> type;
			c_flags<e_composerpathpointflags, char, k_composerpathpointflags_count> flags;
			char generated_pad5f87[1]; // padding
			s_composersubject subject;
			string_id marker;
			real_point3d position;
			real_euler_angles3d rotation;
		};
		static_assert(sizeof(s_composerpathpoint) == 76, "struct s_composerpathpoint is invalid size");

		struct s_composeractioncamera
		{
			c_flags<e_composercameraflags, char, k_composercameraflags_count> flags;
			char generated_padb1af[3]; // padding
			string_id animation_name;
			long animation_index;
			// custom position
			s_composerpathpoint position;
			// custom value
			long start_frame;
			long end_frame;
			long repeat_count;
			real scale;
		};
		static_assert(sizeof(s_composeractioncamera) == 104, "struct s_composeractioncamera is invalid size");

		struct s_composercagepoint
		{
			s_composersubject subject;
			c_typed_tag_reference<CAGEDEFINITION_TAG> cage;
			string_id cage_point;
			real weight;
		};
		static_assert(sizeof(s_composercagepoint) == 68, "struct s_composercagepoint is invalid size");

		struct s_composeractioncageblendsettings
		{
			long blend_time;
			c_enum<e_i343curvecurvebuiltin, char> transform_curve;
			c_enum<e_i343curvecurvebuiltin, char> properties_curve;
			char generated_paddf02[2]; // padding
		};
		static_assert(sizeof(s_composeractioncageblendsettings) == 8, "struct s_composeractioncageblendsettings is invalid size");

		struct s_i343curvecurve1dcontrolpoint
		{
			real value;
			real tangent_in;
			real tangent_out;
			real curviness;
			c_enum<e_i343curvesegmenttype, char> segment_type;
			c_enum<e_i343curvetangentmode, char> tangent_mode;
			char generated_pad7103[2]; // padding
		};
		static_assert(sizeof(s_i343curvecurve1dcontrolpoint) == 20, "struct s_i343curvecurve1dcontrolpoint is invalid size");

		struct s_i343curvecurve1ddefinition
		{
			c_typed_tag_block<s_i343curvecurve1dcontrolpoint> control_points_block;
		};
		static_assert(sizeof(s_i343curvecurve1ddefinition) == 12, "struct s_i343curvecurve1ddefinition is invalid size");

		struct s_i343curveanimatedcurvemetadata
		{
			real time;
		};
		static_assert(sizeof(s_i343curveanimatedcurvemetadata) == 4, "struct s_i343curveanimatedcurvemetadata is invalid size");

		struct s_i343curveanimatedcurve1d
		{
			string_id name;
			c_flags<e_i343curveanimatedcurveflags, char, k_i343curveanimatedcurveflags_count> flags;
			char generated_pad94fd[3]; // padding
			s_i343curvecurve1ddefinition value_curve;
			c_typed_tag_block<s_i343curveanimatedcurvemetadata> animatedcurvemetadata_block;
		};
		static_assert(sizeof(s_i343curveanimatedcurve1d) == 32, "struct s_i343curveanimatedcurve1d is invalid size");

		struct s_composeractioncagecameraproperties
		{
			real focal_length;
			real focus_distance;
			real f_stop;
			long bokeh_side_count;
			s_i343curveanimatedcurve1d focal_length_curve;
			s_i343curveanimatedcurve1d focus_distance_curve;
			s_i343curveanimatedcurve1d f_stop_curve;
		};
		static_assert(sizeof(s_composeractioncagecameraproperties) == 112, "struct s_composeractioncagecameraproperties is invalid size");

		struct s_i343narrativestringandspring
		{
			c_enum<e_i343curvecurvebuiltin, char> curve_type;
			char generated_padc5da[3]; // padding
			string_id curve_name;
			byte dampen_percentage;
			char generated_pad128f[3]; // padding
			real dampen_time;
		};
		static_assert(sizeof(s_i343narrativestringandspring) == 16, "struct s_i343narrativestringandspring is invalid size");

		struct s_i343narrativecagecamerazoomsettings
		{
			c_typed_tag_reference<CURVEDEFINITION_TAG> curve_definition;
			s_i343narrativestringandspring positional_curve_adjustments;
			s_i343narrativestringandspring focal_length_curve_adjustments;
		};
		static_assert(sizeof(s_i343narrativecagecamerazoomsettings) == 48, "struct s_i343narrativecagecamerazoomsettings is invalid size");

		struct s_composeractioncameracage
		{
			// custom placement
			s_composerpathpoint placement;
			// custom value
			s_composersubject position_subject;
			s_tag_reference position_cage_or_abc;
			long start_frame;
			long end_frame;
			long repeat_count;
			real scale;
			angle max_look_drift_angle;
			real_euler_angles2d look_drift_speed;
			byte look_drift_dampen_percentage;
			char generated_pad2bb7[3]; // padding
			real look_drift_dampen_time;
			real look_drift_no_input_delay;
			string_id position_cage_point;
			string_id camera_name;
			c_typed_tag_block<s_composercagepoint> target_points_block;
			s_composeractioncageblendsettings blend_settings;
			s_composeractioncagecameraproperties camera_properties;
			real blur_amount;
			c_flags<e_cameracagevibrationflags, char, k_cameracagevibrationflags_count> vibration_flags;
			c_flags<e_cameracageplayercontrolflags, char, k_cameracageplayercontrolflags_count> player_control_flags;
			char generated_paddf02[2]; // padding
			real walk_run_weight;
			real camera_weight;
			c_flags<e_composercameracageflags, char, k_composercameracageflags_count> flags;
			char generated_pad924d[3]; // padding
			s_tag_reference resolved_camera_position;
			// custom player_controlled_zoom
			c_typed_tag_block<s_i343narrativecagecamerazoomsettings> zoom_settings_block;
			// custom value
		};
		static_assert(sizeof(s_composeractioncameracage) == 364, "struct s_composeractioncameracage is invalid size");

		struct s_composeranimation
		{
			string_id name;
			long weight;
			string_id ikpointset;
			string_id weapon_class;
			string_id abc_anim_token;
		};
		static_assert(sizeof(s_composeranimation) == 20, "struct s_composeranimation is invalid size");

		struct s_composerpuppetgraph
		{
			s_tag_reference puppet_object_type;
			s_tag_reference model_animation_graph;
			c_enum<e_animationtype, char> abc_animation_type;
			c_enum<e_animationcompressiontype, char> abc_compression_type;
			char generated_padfe48[2]; // padding
			c_typed_tag_reference<SKELETON_TAG> abc_skeleton_tag_optional;
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> generatedmodelanimationinternal;
		};
		static_assert(sizeof(s_composerpuppetgraph) == 68, "struct s_composerpuppetgraph is invalid size");

		struct s_composeractiontransitionsettings
		{
			c_enum<e_composeractiontransitiontypes, char> type;
			char generated_pad6308[3]; // padding
			long interpolation_time;
			string_id interpolator_set;
		};
		static_assert(sizeof(s_composeractiontransitionsettings) == 12, "struct s_composeractiontransitionsettings is invalid size");

		struct s_composeranimationeventdata
		{
			short event_type;
			short frame_index;
			short data_index;
			c_flags<e_composeranimationeventflags, char, k_composeranimationeventflags_count> event_flags;
			char generated_pad2246[1]; // padding
			string_id data_identifier;
			string_id anim_data_identifier;
		};
		static_assert(sizeof(s_composeranimationeventdata) == 16, "struct s_composeranimationeventdata is invalid size");

		struct s_composeroverlaychanneldata
		{
			c_enum<e_i343composercomposeroverlaychanneltypes, char> type;
			char generated_pad2a65[3]; // padding
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> channel_graph;
			string_id overlay_name;
			real playback_data;
			long frame_start;
			long frame_end;
			s_composerpathpoint proximity_object;
			real radius;
		};
		static_assert(sizeof(s_composeroverlaychanneldata) == 116, "struct s_composeroverlaychanneldata is invalid size");

		struct s_composeractionanimation
		{
			c_typed_tag_block<s_composeranimation> animations_block;
			c_typed_tag_block<s_composerpuppetgraph> model_animation_graphs_block;
			// custom point
			s_composerpathpoint position;
			// custom value
			c_enum<e_composeranimpositiontypeenum, char> position_type;
			char generated_pad0dd6[1]; // padding
			c_flags<e_composeranimationflags, short, k_composeranimationflags_count> flags;
			string_id sync_puppet;
			long start_frame;
			long end_frame;
			long repeat_count;
			real scale;
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> overlay_group_graph;
			string_id overlay_group_name;
			string_id animation_mode;
			s_composeractiontransitionsettings override_transition_settings;
			c_typed_tag_block<s_composeranimationeventdata> override_animation_events_block;
			c_typed_tag_block<s_composeroverlaychanneldata> overlay_channels_block;
		};
		static_assert(sizeof(s_composeractionanimation) == 184, "struct s_composeractionanimation is invalid size");

		struct s_composeralembicanimation
		{
			c_typed_tag_reference<ABC_TAG> animation_source;
			c_enum<e_animationtype, char> abc_animation_type;
			c_enum<e_animationcompressiontype, char> abc_compression_type;
			char generated_padbc6d[2]; // padding
			long weight;
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> generatedmodelanimationinternal;
		};
		static_assert(sizeof(s_composeralembicanimation) == 40, "struct s_composeralembicanimation is invalid size");

		struct s_composeractionalembicanimation
		{
			c_typed_tag_block<s_composeralembicanimation> animations_block;
			// custom point
			s_composerpathpoint position;
			// custom value
			c_enum<e_composeranimpositiontypeenum, char> position_type;
			char generated_pad49af[1]; // padding
			c_flags<e_composeranimationflags, short, k_composeranimationflags_count> flags;
			string_id sync_puppet;
			long start_frame;
			long end_frame;
			long repeat_count;
			real scale;
			string_id animation_mode;
			s_composeractiontransitionsettings override_transition_settings;
			c_typed_tag_block<s_composeranimationeventdata> override_animation_events_block;
			c_typed_tag_block<s_composeroverlaychanneldata> overlay_channels_block;
		};
		static_assert(sizeof(s_composeractionalembicanimation) == 152, "struct s_composeractionalembicanimation is invalid size");

		struct s_composeranimatedmesh
		{
			string_id name;
			long weight;
		};
		static_assert(sizeof(s_composeranimatedmesh) == 8, "struct s_composeranimatedmesh is invalid size");

		struct s_composeractionanimatedmesh
		{
			c_typed_tag_block<s_composeranimatedmesh> animated_meshes_block;
			c_flags<e_composeranimatedmeshflags, short, k_composeranimatedmeshflags_count> flags;
			char generated_pad65ba[2]; // padding
			real scale;
			long start_frame;
			long end_frame;
		};
		static_assert(sizeof(s_composeractionanimatedmesh) == 28, "struct s_composeractionanimatedmesh is invalid size");

		struct s_composeractionpath
		{
			real throttle;
			c_typed_tag_block<s_composerpathpoint> points_block;
			real destination_tolerance;
			string_id animation_mode;
			c_typed_tag_block<s_composeroverlaychanneldata> overlay_channels_block;
		};
		static_assert(sizeof(s_composeractionpath) == 36, "struct s_composeractionpath is invalid size");

		struct s_composeractionunitrecording
		{
			string_id recording_unit_type;
			string_id recording_name;
			real scale;
			long start_frame;
			long end_frame;
			short smoothing_time;
			c_flags<e_composerunitrecordingflags, char, k_composerunitrecordingflags_count> flags;
			char generated_pad3413[1]; // padding
		};
		static_assert(sizeof(s_composeractionunitrecording) == 24, "struct s_composeractionunitrecording is invalid size");

		struct s_composeractioncommandscript
		{
			s_composerscript script;
		};
		static_assert(sizeof(s_composeractioncommandscript) == 84, "struct s_composeractioncommandscript is invalid size");

		struct s_subtracksreference
		{
			c_typed_tag_reference<COMPOSER_SUBTRACKS_TAG> subtracks_reference;
		};
		static_assert(sizeof(s_subtracksreference) == 16, "struct s_subtracksreference is invalid size");

		struct s_composersubaction
		{
			c_enum<e_composersubactiontypeenum, long> type;
			c_enum<e_composertimetypeenum, char> start_type;
			c_enum<e_composertimetypeenum, char> end_type;
			short data_index;
			long start_action;
			long start_offset;
			s_composerscript start_condition_script;
			s_composerscript end_condition_script;
			long end_action;
			long end_offset;
			c_flags<e_composersubactionflags, char, k_composersubactionflags_count> subaction_flags;
			char generated_pad6d2e[3]; // padding
		};
		static_assert(sizeof(s_composersubaction) == 196, "struct s_composersubaction is invalid size");

		struct s_composereditorsubaction
		{
			c_static_string<256> comment;
			dword color;
			byte subtrack;
			c_flags<e_composereditorflags, char, k_composereditorflags_count> editor_flags;
			char generated_pad8687[2]; // padding
			// custom start_condition_script
			s_composertextdata start_condition_script;
			// custom value
			// custom end_condition_script
			s_composertextdata end_condition_script;
			// custom value
			// custom custom_script
			s_composertextdata custom_script;
			// custom value
			c_typed_tag_block<s_composertextdata> branch_scripts_block;
		};
		static_assert(sizeof(s_composereditorsubaction) == 348, "struct s_composereditorsubaction is invalid size");

		struct s_subactionpoint
		{
			c_flags<e_subactionflags, char, k_subactionflags_count> flags;
			char generated_pad00d4[3]; // padding
			// custom point
			s_composerpathpoint point;
			// custom value
			s_tag_reference asset;
		};
		static_assert(sizeof(s_subactionpoint) == 96, "struct s_subactionpoint is invalid size");

		struct s_composerbranchelement
		{
			long target_action;
			s_composerscript condition_script;
		};
		static_assert(sizeof(s_composerbranchelement) == 88, "struct s_composerbranchelement is invalid size");

		struct s_subactionbranch
		{
			c_typed_tag_block<s_composerbranchelement> elements_block;
			short check_rate;
			char generated_padb7d8[2]; // padding
		};
		static_assert(sizeof(s_subactionbranch) == 16, "struct s_subactionbranch is invalid size");

		struct s_composerdialog
		{
			c_typed_tag_reference<SOUND_TAG> dialog;
			long weight;
			real scale;
			s_composerscript dialog_script;
		};
		static_assert(sizeof(s_composerdialog) == 108, "struct s_composerdialog is invalid size");

		struct s_subactiondialog
		{

			/* Dialog Sub-Action information */

			c_typed_tag_block<s_composerdialog> dialogs_block;
			s_composersubject subject;
		};
		static_assert(sizeof(s_subactiondialog) == 56, "struct s_subactiondialog is invalid size");

		struct s_subactionsubtitle
		{
			string_id subtitle;
			string_id character;
		};
		static_assert(sizeof(s_subactionsubtitle) == 8, "struct s_subactionsubtitle is invalid size");

		struct s_subactioneffect
		{

			/* Effect Sub-Action information */

			c_flags<e_composereffectflags, char, k_composereffectflags_count> flags;
			char generated_pad6b33[3]; // padding
			c_typed_tag_reference<EFFECT_TAG> effect;
			// custom point
			s_composerpathpoint point;
			// custom value
			real scale;
			string_id function_a;
			string_id function_b;
		};
		static_assert(sizeof(s_subactioneffect) == 108, "struct s_subactioneffect is invalid size");

		struct s_subactionlensflare
		{
			c_typed_tag_reference<LENS_FLARE_TAG> lens_flare;
			// custom point
			s_composerpathpoint point;
			// custom value
			string_id function;
			c_flags<e_composerlensflareflags, char, k_composerlensflareflags_count> flags;
			char generated_pad13c6[3]; // padding
		};
		static_assert(sizeof(s_subactionlensflare) == 100, "struct s_subactionlensflare is invalid size");

		struct s_i343curveroadcurvecontrolpointmetadata
		{
			real width;
			real opacity;
			real falloffleft;
			real falloffright;
			real bank;
		};
		static_assert(sizeof(s_i343curveroadcurvecontrolpointmetadata) == 20, "struct s_i343curveroadcurvecontrolpointmetadata is invalid size");

		struct s_i343curveroaddecalbitmapreference
		{
			c_typed_tag_reference<BITMAP_TAG> reference;
		};
		static_assert(sizeof(s_i343curveroaddecalbitmapreference) == 16, "struct s_i343curveroaddecalbitmapreference is invalid size");

		struct s_i343curveroaddecalcontrolpointmetadata
		{
			c_typed_tag_block<s_i343curveroaddecalbitmapreference> road_decal_textures_block;
			real_vector2d road_decal_scale;
			real_vector2d road_decal_offset;
			real road_decal_tile_repeat_count;
			real road_decal_height_strength;
			real road_decal_mask_strength;
			real road_decal_height_contrast;
			real road_decal_mask_contrast;
			real road_decal_edge_fade;
			long road_decal_random_seed;
		};
		static_assert(sizeof(s_i343curveroaddecalcontrolpointmetadata) == 56, "struct s_i343curveroaddecalcontrolpointmetadata is invalid size");

		struct s_i343curveanimatedsplinecontrolpointmetadata
		{
			real time;
		};
		static_assert(sizeof(s_i343curveanimatedsplinecontrolpointmetadata) == 4, "struct s_i343curveanimatedsplinecontrolpointmetadata is invalid size");

		struct s_i343curvecurvecontrolpointmetadata
		{
			c_typed_tag_block<s_i343curveroadcurvecontrolpointmetadata> spline_road_metadata_block;
			c_typed_tag_block<s_i343curveroaddecalcontrolpointmetadata> road_decal_metadata_block;
			c_typed_tag_block<s_i343curveanimatedsplinecontrolpointmetadata> animated_spline_metadata_block;
		};
		static_assert(sizeof(s_i343curvecurvecontrolpointmetadata) == 36, "struct s_i343curvecurvecontrolpointmetadata is invalid size");

		struct s_i343curvecurve3dcontrolpoint
		{
			real_vector3d value;
			real_vector3d tangent_in;
			real_vector3d tangent_out;
			real curviness;
			c_enum<e_i343curvesegmenttype, char> segment_type_x;
			c_enum<e_i343curvesegmenttype, char> segment_type_y;
			c_enum<e_i343curvesegmenttype, char> segment_type_z;
			c_enum<e_i343curvetangentmode, char> tangent_mode_x;
			c_enum<e_i343curvetangentmode, char> tangent_mode_y;
			c_enum<e_i343curvetangentmode, char> tangent_mode_z;
			char generated_pad30cd[2]; // padding
			c_typed_tag_block<s_i343curvecurvecontrolpointmetadata> pointmetadata_block;
		};
		static_assert(sizeof(s_i343curvecurve3dcontrolpoint) == 60, "struct s_i343curvecurve3dcontrolpoint is invalid size");

		struct s_i343curvecurve3ddefinition
		{
			c_typed_tag_block<s_i343curvecurve3dcontrolpoint> control_points_block;
		};
		static_assert(sizeof(s_i343curvecurve3ddefinition) == 12, "struct s_i343curvecurve3ddefinition is invalid size");

		struct s_i343curveanimatedcurve3d
		{
			c_flags<e_i343curveanimatedcurveflags, char, k_i343curveanimatedcurveflags_count> flags;
			char generated_padc23f[3]; // padding
			s_i343curvecurve3ddefinition value_curve;
		};
		static_assert(sizeof(s_i343curveanimatedcurve3d) == 16, "struct s_i343curveanimatedcurve3d is invalid size");

		struct s_transformcurve
		{
			c_enum<e_transformcurvetranslationtypeenum, char> translation_type;
			c_enum<e_transformcurverotationtypeenum, char> rotation_type;
			char generated_paddcfb[2]; // padding
			s_i343curveanimatedcurve3d translation_curve;
			s_i343curveanimatedcurve3d rotation_curve;
			s_i343curveanimatedcurve1d blend_curve;
			// custom translation_point
			s_composerpathpoint translation_point;
			// custom value
			// custom rotation_point
			s_composerpathpoint rotation_point;
			// custom value
		};
		static_assert(sizeof(s_transformcurve) == 220, "struct s_transformcurve is invalid size");

		struct s_i343curvecurve2dcontrolpoint
		{
			real_vector2d value;
			real_vector2d tangent_in;
			real_vector2d tangent_out;
			real curviness;
			c_enum<e_i343curvesegmenttype, char> segment_type_x;
			c_enum<e_i343curvesegmenttype, char> segment_type_y;
			c_enum<e_i343curvetangentmode, char> tangent_mode_x;
			c_enum<e_i343curvetangentmode, char> tangent_mode_y;
		};
		static_assert(sizeof(s_i343curvecurve2dcontrolpoint) == 32, "struct s_i343curvecurve2dcontrolpoint is invalid size");

		struct s_i343curvecurve2ddefinition
		{
			c_typed_tag_block<s_i343curvecurve2dcontrolpoint> control_points_block;
		};
		static_assert(sizeof(s_i343curvecurve2ddefinition) == 12, "struct s_i343curvecurve2ddefinition is invalid size");

		struct s_i343curveanimatedcurve2d
		{
			c_flags<e_i343curveanimatedcurveflags, char, k_i343curveanimatedcurveflags_count> flags;
			char generated_paddf2c[3]; // padding
			s_i343curvecurve2ddefinition value_curve;
			c_typed_tag_block<s_i343curveanimatedcurvemetadata> animatedcurvemetadata_block;
		};
		static_assert(sizeof(s_i343curveanimatedcurve2d) == 28, "struct s_i343curveanimatedcurve2d is invalid size");

		struct s_i343curveanimatedcurvekeyframe
		{
			real_vector2d position;
			real leftslope;
			real rightslope;
			c_enum<e_i343curvesegmenttype, char> segmenttype;
			c_enum<e_i343curvetangentmode, char> tangentmode;
			char generated_pad4bfe[2]; // padding
		};
		static_assert(sizeof(s_i343curveanimatedcurvekeyframe) == 20, "struct s_i343curveanimatedcurvekeyframe is invalid size");

		struct s_i343curveanimatedcurve
		{
			c_typed_tag_block<s_i343curveanimatedcurvekeyframe> keyframes_block;
			c_flags<e_i343curveanimatedcurvecurveflags, char, k_i343curveanimatedcurvecurveflags_count> flags;
			char generated_pad5cd6[3]; // padding
		};
		static_assert(sizeof(s_i343curveanimatedcurve) == 16, "struct s_i343curveanimatedcurve is invalid size");

		struct s_i343curvedepthoffieldcurve
		{
			c_flags<e_i343curvedepthoffieldcurvecurveflags, char, k_i343curvedepthoffieldcurvecurveflags_count> flags;
			char generated_pad134b[3]; // padding
			s_i343curveanimatedcurve focallength;
			s_i343curveanimatedcurve focusdistance;
			s_i343curveanimatedcurve fstop;
			s_i343curveanimatedcurve gameplay_fov_blend;
		};
		static_assert(sizeof(s_i343curvedepthoffieldcurve) == 68, "struct s_i343curvedepthoffieldcurve is invalid size");

		struct s_i343curvepropertycurve
		{
			string_id name;
			c_enum<e_i343curvecurvestructtype, char> curve_type;
			char generated_pad711a[3]; // padding
			s_i343curveanimatedcurve2d animated_curve_2d;
			s_i343curveanimatedcurve3d animated_curve_3d;
			s_i343curvedepthoffieldcurve depth_of_field_curve;
			s_i343curveanimatedcurve1d animated_curve_1d;
		};
		static_assert(sizeof(s_i343curvepropertycurve) == 152, "struct s_i343curvepropertycurve is invalid size");

		struct s_subactionlight
		{
			s_levelobjectreference light;
			string_id light_name;
			long light_guid;
			c_typed_tag_block<s_composersubject> linked_objects_block;
			s_transformcurve transform_curve;
			c_flags<e_composerlightcurveflags, char, k_composerlightcurveflags_count> curves;
			char generated_pad018e[3]; // padding
			c_typed_tag_block<s_i343curvepropertycurve> curve_list_block;
			c_flags<e_subactionlightflags, char, k_subactionlightflags_count> light_flags;
			char generated_pad4e43[3]; // padding
		};
		static_assert(sizeof(s_subactionlight) == 276, "struct s_subactionlight is invalid size");

		struct s_subactionclipplane
		{
			real_point3d plane_center;
			real_point3d plane_direction;
			c_typed_tag_block<s_composersubject> subjects_block;
		};
		static_assert(sizeof(s_subactionclipplane) == 36, "struct s_subactionclipplane is invalid size");

		struct s_subactionfunction
		{

			/* Function Sub-Action information */

			c_flags<e_composerfunctionflags, char, k_composerfunctionflags_count> flags;
			char generated_pade2ec[3]; // padding
			string_id function_name;
			s_scalarfunctionnamedefaultone function;
		};
		static_assert(sizeof(s_subactionfunction) == 28, "struct s_subactionfunction is invalid size");

		struct s_subactionfunctioncurve
		{

			/* Function Sub-Action information */

			c_flags<e_composerfunctionflags, char, k_composerfunctionflags_count> flags;
			char generated_pade687[3]; // padding
			s_i343curveanimatedcurve1d curve;
		};
		static_assert(sizeof(s_subactionfunctioncurve) == 36, "struct s_subactionfunctioncurve is invalid size");

		struct s_subactionuserinputconstraints
		{
			s_rectangle2d maximum_look_angles;
			real frictional_force;
		};
		static_assert(sizeof(s_subactionuserinputconstraints) == 12, "struct s_subactionuserinputconstraints is invalid size");

		struct s_subactiongeneric
		{
			s_tag_reference asset;
			long blend_frames;
		};
		static_assert(sizeof(s_subactiongeneric) == 20, "struct s_subactiongeneric is invalid size");

		struct s_subactionobject
		{
			s_composersubject subject;
			long object_guid;
			s_transformcurve transform_curve;
			c_flags<e_subactionobjectflags, char, k_subactionobjectflags_count> flags;
			c_flags<e_composersubactionobjectcurveflags, char, k_composersubactionobjectcurveflags_count> curves;
			char generated_pad69f5[2]; // padding
			c_typed_tag_block<s_i343curvepropertycurve> curve_list_block;
		};
		static_assert(sizeof(s_subactionobject) == 284, "struct s_subactionobject is invalid size");

		struct s_subactionvalue
		{
			c_enum<e_subactionvaluetypeenum, char> type;
			char generated_pad0885[3]; // padding
			real start_value;
			real end_value;
			s_i343curveanimatedcurve1d value_curve;
		};
		static_assert(sizeof(s_subactionvalue) == 44, "struct s_subactionvalue is invalid size");

		struct s_subactioncamerafadescreen
		{
			c_flags<e_composercamerafadescreenflags, char, k_composercamerafadescreenflags_count> fade_screen_flags;
			char generated_pad8ae3[3]; // padding
			rgb_color fade_color;
			s_i343curveanimatedcurve1d fade_curve;
		};
		static_assert(sizeof(s_subactioncamerafadescreen) == 48, "struct s_subactioncamerafadescreen is invalid size");

		struct s_subactioncameratrigger
		{
			c_flags<e_subactioncameratriggerflags, char, k_subactioncameratriggerflags_count> flags;
		};
		static_assert(sizeof(s_subactioncameratrigger) == 1, "struct s_subactioncameratrigger is invalid size");

		struct s_composerplayerdata
		{
			c_enum<e_composerplayerpuppettypeenum, char> player_type;
			c_enum<e_i343netprotocolgameoptionsmultiplayerteamdesignatorenum, char> multiplayer_team;
			c_flags<e_composerplayerpuppetflags, char, k_composerplayerpuppetflags_count> flags;
			char generated_padf92f[1]; // padding
			long player_index;
			long forge_spectator_player_index;
		};
		static_assert(sizeof(s_composerplayerdata) == 12, "struct s_composerplayerdata is invalid size");

		struct s_subactionuiscene
		{
			c_flags<e_composeruisceneflags, char, k_composeruisceneflags_count> flags;
			char generated_pad2864[3]; // padding
			c_typed_tag_reference<NODE_GRAPH_STACK_TAG> ui_scene;
			// custom point
			s_composerpathpoint point;
			// custom value
			real scale;
			c_typed_tag_block<s_composerplayerdata> player_data_block;
		};
		static_assert(sizeof(s_subactionuiscene) == 112, "struct s_subactionuiscene is invalid size");

		struct s_subactionnodegraphevent
		{
			string_id event_name;
			c_flags<e_composernodegrapheventflags, char, k_composernodegrapheventflags_count> flags;
			char generated_pad5d68[3]; // padding
		};
		static_assert(sizeof(s_subactionnodegraphevent) == 8, "struct s_subactionnodegraphevent is invalid size");

		struct s_subactiongameenginevignetteevent
		{
			string_id event_name;
		};
		static_assert(sizeof(s_subactiongameenginevignetteevent) == 4, "struct s_subactiongameenginevignetteevent is invalid size");

		struct s_subactioncameralensdirt
		{
			real intensity;
			c_typed_tag_reference<BITMAP_TAG> dirt_texture;
			c_enum<e_cameralensdirtdirttype, char> dirt_type;
			char generated_pad40de[3]; // padding
		};
		static_assert(sizeof(s_subactioncameralensdirt) == 24, "struct s_subactioncameralensdirt is invalid size");

		struct s_subactiontransform
		{
			c_flags<e_subactiontransformflags, char, k_subactiontransformflags_count> flags;
			char generated_pad6ca2[3]; // padding
			// custom point_1
			s_composerpathpoint point_1;
			// custom value
			// custom point_2
			s_composerpathpoint point_2;
			// custom value
			s_scalarfunctionname mapping;
		};
		static_assert(sizeof(s_subactiontransform) == 176, "struct s_subactiontransform is invalid size");

		struct s_subactiontransformcurve
		{
			s_transformcurve transform_curve;
		};
		static_assert(sizeof(s_subactiontransformcurve) == 220, "struct s_subactiontransformcurve is invalid size");

		struct s_subactiongenericai
		{
			// custom point
			s_composerpathpoint point;
			// custom value
			real scalar;
			word flags;
			char generated_pade30f[2]; // padding
		};
		static_assert(sizeof(s_subactiongenericai) == 84, "struct s_subactiongenericai is invalid size");

		struct s_subactionikinfluencer
		{
			// custom target
			s_composerpathpoint ik_target;
			// custom value
			string_id chain_name;
			real weight;
			real current_influence_scale;
			real influence_priority;
		};
		static_assert(sizeof(s_subactionikinfluencer) == 92, "struct s_subactionikinfluencer is invalid size");

		struct s_subactioncameradofcurve
		{
			s_i343curvedepthoffieldcurve camera_dof_curve;
			long bokeh_side_count;
		};
		static_assert(sizeof(s_subactioncameradofcurve) == 72, "struct s_subactioncameradofcurve is invalid size");

		struct s_subactionscriptcurves
		{
			s_composerscript script;
			s_i343curveanimatedcurve1d script_curve_value_1;
			s_i343curveanimatedcurve1d script_curve_value_2;
			s_i343curveanimatedcurve1d script_curve_value_3;
			s_i343curveanimatedcurve1d script_curve_value_4;
		};
		static_assert(sizeof(s_subactionscriptcurves) == 212, "struct s_subactionscriptcurves is invalid size");

		struct s_subactionpuppetvariant
		{
			string_id variant_name;
			string_id style_id;
		};
		static_assert(sizeof(s_subactionpuppetvariant) == 8, "struct s_subactionpuppetvariant is invalid size");

		struct s_subactioncolorrgba
		{
			c_enum<e_subactionvaluetypeenum, char> type;
			char generated_padc5f1[3]; // padding
			real red_start_value;
			real red_end_value;
			real green_start_value;
			real green_end_value;
			real blue_start_value;
			real blue_end_value;
			real alpha_start_value;
			real alpha_end_value;
			s_i343curveanimatedcurve1d red_curve;
			s_i343curveanimatedcurve1d green_curve;
			s_i343curveanimatedcurve1d blue_curve;
			s_i343curveanimatedcurve1d alpha_curve;
		};
		static_assert(sizeof(s_subactioncolorrgba) == 164, "struct s_subactioncolorrgba is invalid size");

		struct s_subactiondwscolorgrading
		{
			c_flags<e_composerdwscolorgradingcurveflags, short, k_composerdwscolorgradingcurveflags_count> curves;
			char generated_padc74f[2]; // padding
			c_typed_tag_block<s_i343curvepropertycurve> curve_list_block;
			s_i343curveanimatedcurve1d blending_curve;
		};
		static_assert(sizeof(s_subactiondwscolorgrading) == 48, "struct s_subactiondwscolorgrading is invalid size");

		struct s_subactiondwschromaticaberration
		{
			s_i343curveanimatedcurve1d weight;
			s_i343curveanimatedcurve1d blending_curve;
		};
		static_assert(sizeof(s_subactiondwschromaticaberration) == 64, "struct s_subactiondwschromaticaberration is invalid size");

		struct s_subactionrumble
		{
			c_typed_tag_reference<RUMBLE_TAG> rumble_definition;
			// custom basic
			real low_frequency_level;
			real high_frequency_level;
			real primary_trigger_level;
			real secondary_trigger_level;
			// custom value
		};
		static_assert(sizeof(s_subactionrumble) == 32, "struct s_subactionrumble is invalid size");

		struct s_i343narrativecagedampingproperties
		{
			byte position_dampen_percentage;
			char generated_pad6a9e[3]; // padding
			real position_dampen_time;
			byte rotation_dampen_percentage;
			char generated_padb753[3]; // padding
			real rotation_dampen_time;
		};
		static_assert(sizeof(s_i343narrativecagedampingproperties) == 16, "struct s_i343narrativecagedampingproperties is invalid size");

		struct s_i343narrativecageshakeproperties
		{
			s_i343narrativecagedampingproperties scale_damping;
			// custom position
			real_vector3d position_sample_values;
			real_vector3d position_offset_scale;
			real_vector2d position_offset_velocity_range;
			real_vector3d position_offset_velocity_scale_min;
			real_vector3d position_offset_velocity_scale_max;
			real_vector2d position_time_velocity_scale;
			// custom value
			// custom rotation
			real_vector3d rotation_sample_values;
			real_euler_angles3d rotation_offset_scale;
			real_vector2d rotation_offset_velocity_range;
			real_vector3d rotation_offset_velocity_scale_min;
			real_vector3d rotation_offset_velocity_scale_max;
			real_vector2d rotation_time_velocity_scale;
			// custom value
		};
		static_assert(sizeof(s_i343narrativecageshakeproperties) == 144, "struct s_i343narrativecageshakeproperties is invalid size");

		struct s_subactioncamerashake
		{
			s_i343curveanimatedcurve1d blending_curve;
			s_i343narrativecageshakeproperties camera_shake_properties;
		};
		static_assert(sizeof(s_subactioncamerashake) == 176, "struct s_subactioncamerashake is invalid size");

		struct s_composersubtrack
		{
			string_id name;
			dword color;
			c_enum<e_composersubactioncategoryenum, char> category;
			char generated_padbc0b[3]; // padding
			c_typed_tag_block<s_composersubaction> subactions_block;
			c_typed_tag_block<s_composereditorsubaction> editor_subactions_block;
			c_typed_tag_block<s_subactionpoint> points_block;
			c_typed_tag_block<s_subactionbranch> branches_block;
			c_typed_tag_block<s_subactiondialog> dialog_block;
			c_typed_tag_block<s_subactionsubtitle> subtitles_block;
			c_typed_tag_block<s_subactioneffect> effects_block;
			c_typed_tag_block<s_subactionlensflare> lens_flares_block;
			c_typed_tag_block<s_subactionlight> lights_block;
			c_typed_tag_block<s_subactionclipplane> clip_planes_block;
			c_typed_tag_block<s_subactionfunction> functions_block;
			c_typed_tag_block<s_subactionfunctioncurve> function_curves_block;
			c_typed_tag_block<s_subactionuserinputconstraints> input_constraints_block;
			c_typed_tag_block<s_subactiongeneric> generic_subactions_block;
			c_typed_tag_block<s_subactionobject> object_subactions_block;
			c_typed_tag_block<s_subactionvalue> value_subactions_block;
			c_typed_tag_block<s_subactioncamerafadescreen> camera_fade_screens_block;
			c_typed_tag_block<s_subactioncameratrigger> camera_trigger_subactions_block;
			c_typed_tag_block<s_composerscript> scripts_block;
			c_typed_tag_block<s_subactionuiscene> ui_scenes_block;
			c_typed_tag_block<s_subactionnodegraphevent> nodegraph_events_block;
			c_typed_tag_block<s_subactiongameenginevignetteevent> game_engine_vignette_events_block;
			c_typed_tag_block<s_subactioncameralensdirt> camera_lens_dirt_block;
			c_typed_tag_block<s_subactiontransform> transform_subactions_block;
			c_typed_tag_block<s_subactiontransformcurve> transform_curve_subactions_block;
			c_typed_tag_block<s_subactiongenericai> generic_ai_subactions_block;
			c_typed_tag_block<s_subactionikinfluencer> ik_influencer_subactions_block;
			c_typed_tag_block<s_subactioncameradofcurve> camera_dof_curve_subactions_block;
			c_typed_tag_block<s_subactionscriptcurves> script_curves_subactions_block;
			c_typed_tag_block<s_subactionpuppetvariant> puppet_variant_subactions_block;
			c_typed_tag_block<s_subactioncolorrgba> color_rgba_subactions_block;
			c_typed_tag_block<s_subactiondwscolorgrading> dws_color_grading_subactions_block;
			c_typed_tag_block<s_subactiondwschromaticaberration> dws_chromatic_aberration_subactions_block;
			c_typed_tag_block<s_subactionrumble> rumble_subactions_block;
			c_typed_tag_block<s_subactioncamerashake> camera_shake_subactions_block;
		};
		static_assert(sizeof(s_composersubtrack) == 432, "struct s_composersubtrack is invalid size");

		struct s_composersubtracks
		{
			c_typed_tag_block<s_subtracksreference> subtracks_references_block;
			c_typed_tag_block<s_composersubtrack> subtracks_block;
		};
		static_assert(sizeof(s_composersubtracks) == 24, "struct s_composersubtracks is invalid size");

		struct s_composertrack
		{
			string_id name;
			c_enum<e_composertracktypeenum, char> type;
			char generated_padec1b[3]; // padding
			long id;
			short data_index;
			short subaction_count;
			c_typed_tag_block<s_composeraction> actions_block;
			c_typed_tag_block<s_composereditoraction> editor_actions_block;
			c_typed_tag_block<s_composeractioncamera> cameras_block;
			c_typed_tag_block<s_composeractioncameracage> camera_cages_block;
			c_typed_tag_block<s_composeractionanimation> animations_block;
			c_typed_tag_block<s_composeractionalembicanimation> alembic_animations_block;
			c_typed_tag_block<s_composeractionanimatedmesh> animated_meshes_block;
			c_typed_tag_block<s_composeractionpath> paths_block;
			c_typed_tag_block<s_composeractionunitrecording> unit_recordings_block;
			c_typed_tag_block<s_composeractioncommandscript> command_scripts_block;
			s_composersubtracks subtracks;
			s_composerscript start_script;
			s_composerscript end_script;
		};
		static_assert(sizeof(s_composertrack) == 328, "struct s_composertrack is invalid size");

		struct s_guidbyte
		{
			byte byte_value;
		};
		static_assert(sizeof(s_guidbyte) == 1, "struct s_guidbyte is invalid size");

		struct s_tagguid
		{
			s_guidbyte guid_bytes[16];
		};
		static_assert(sizeof(s_tagguid) == 16, "struct s_tagguid is invalid size");

		struct s_composereditortrack
		{
			c_static_string<256> comment;
			dword color;
			short height;
			c_flags<e_composereditorflags, char, k_composereditorflags_count> editor_flags;
			char generated_padf616[1]; // padding
			// custom start_script
			s_composertextdata start_script;
			// custom value
			// custom end_script
			s_composertextdata end_script;
			// custom value
			s_tagguid editor_guid_bytes;
		};
		static_assert(sizeof(s_composereditortrack) == 328, "struct s_composereditortrack is invalid size");

		struct s_composertrackpuppet
		{
			string_id variant_name;
			string_id style_id;
			string_id object_attachment_name;
			string_id graphics_scene_override;
			c_typed_tag_reference<CAGEDEFINITION_TAG> cage_definition_tag_handle;
			s_composersubject subject;
			c_flags<e_composerpuppetflags, long, k_composerpuppetflags_count> flags;
			s_tag_reference type;
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> parent_model_animation_graph;
			c_typed_tag_block<s_composerpuppetgraph> model_animation_graphs_block;
			// custom position
			s_composerpathpoint position;
			// custom value
			// custom bounding_sphere_override
			string_id bone_for_bounding_sphere_center;
			real bounding_sphere_radius;
			// custom value
			c_typed_tag_block<s_composerplayerdata> player_puppet_data_block;
			c_typed_tag_reference<RUNTIMEANIMSET_TAG> runtime_animset_used_by_code_only;
			c_typed_tag_reference<MODEL_ANIMATION_GRAPH_TAG> reference_to_generated_anim_pool_tag;
		};
		static_assert(sizeof(s_composertrackpuppet) == 252, "struct s_composertrackpuppet is invalid size");

		struct s_composertrackcamera
		{
			c_typed_tag_reference<CAMERA_ANIMATION_GRAPH_TAG> camera_animation_graph;
			s_composersubject subject;
			// custom position
			s_composerpathpoint position;
			// custom value
			c_enum<e_i343netprotocolgameoptionsmultiplayerteamdesignatorenum, char> team_camera;
			char generated_pad8b2a[3]; // padding
		};
		static_assert(sizeof(s_composertrackcamera) == 140, "struct s_composertrackcamera is invalid size");

		struct s_composerscene
		{
			string_id name;
			string_id anchor_marker;
			real_point3d anchor_position;
			real_euler_angles3d anchor_rotation;
			c_enum<e_composerresetlightingtypeenum, char> reset_lighting;
			c_flags<e_composersceneflags, char, k_composersceneflags_count> flags;
			char generated_padd502[2]; // padding
			c_typed_tag_reference<SOUND_TAG> skip_sound_event;
			c_typed_tag_reference<SOUND_TAG> start_sound_event;
			c_typed_tag_reference<SOUND_TAG> end_sound_event;
			c_typed_tag_reference<MUSIC_CONTROL_TAG> skip_music_event;
			c_typed_tag_reference<MUSIC_CONTROL_TAG> start_music_event;
			c_typed_tag_reference<MUSIC_CONTROL_TAG> end_music_event;
			c_typed_tag_reference<SOUND_TAG> skip_dialog_event;
			c_typed_tag_reference<SOUND_TAG> start_dialog_event;
			c_typed_tag_reference<SOUND_TAG> end_dialog_event;
			c_typed_tag_block<s_soundeventdefinitionreference> synced_audio_tracks_block;
			c_typed_tag_block<s_composertrack> tracks_block;
			c_typed_tag_block<s_composereditortrack> editor_tracks_block;
			c_typed_tag_block<s_composertrackpuppet> puppet_tracks_block;
			c_typed_tag_block<s_composertrackcamera> camera_tracks_block;
			long lastactionid;
			long lasttrackid;
		};
		static_assert(sizeof(s_composerscene) == 248, "struct s_composerscene is invalid size");

		struct s_compositionscene
		{
			s_anytag_struct_definition anytag;
			s_composerscene scene;
			char generated_pad059c[4]; // padding
		};
		static_assert(sizeof(s_compositionscene) == 268, "struct s_compositionscene is invalid size");

		struct s_composertransitionelement
		{
			c_flags<e_composertransitionflags, char, k_composertransitionflags_count> flags;
			char generated_pad569d[1]; // padding
			short fade_hold;
			long fade_time;
			rgb_color fade_color;
		};
		static_assert(sizeof(s_composertransitionelement) == 20, "struct s_composertransitionelement is invalid size");

		struct s_composertransition
		{
			s_anytag_struct_definition anytag;
			// custom fade_out_from_game
			s_composertransitionelement fade_out_from_game;
			// custom value
			// custom fade_in
			s_composertransitionelement fade_in;
			// custom value
			// custom fade_out
			s_composertransitionelement fade_out;
			// custom value
			// custom fade_post_load
			s_composertransitionelement fade_post_load;
			// custom value
			// custom fade_in_to_game
			s_composertransitionelement fade_in_to_game;
			// custom value
			char generated_padb275[4]; // padding
		};
		static_assert(sizeof(s_composertransition) == 120, "struct s_composertransition is invalid size");

		struct s_interfaceuiiteminfo
		{
			string_id name;
			string_id alt_name_;
			string_id description;
			string_id help_text;
			string_id icon_string_id;
			c_typed_tag_reference<BITMAP_TAG> sprite;
			long sprite_index;
			c_typed_tag_reference<BITMAP_TAG> alt_sprite;
			long alt_sprite_index;
			long damage_sprite_index;
			c_typed_tag_reference<CUI_SCREEN_TAG> ui_vehicle_screen_reference;
		};
		static_assert(sizeof(s_interfaceuiiteminfo) == 80, "struct s_interfaceuiiteminfo is invalid size");

		struct s_i343equipmentupgradenode
		{
			string_id node_name;
		};
		static_assert(sizeof(s_i343equipmentupgradenode) == 4, "struct s_i343equipmentupgradenode is invalid size");

		struct s_i343equipmentupgradepath
		{
			string_id path_name;
			c_enum<e_i343equipmentupgradeequipmentupgradetype, short> path_upgrade_type;
			char generated_pad72a0[2]; // padding
			string_id path_description;
			string_id persistence_key_levels;
			string_id persistence_key_read_levels;
			string_id persistence_key_discovered;
			c_flags<e_equipmentunlockedbydefault, char, k_equipmentunlockedbydefault_count> unlocked_by_default;
			char generated_pad8c81[3]; // padding
			// custom ui_info
			s_interfaceuiiteminfo uiinfo;
			// custom value
			c_typed_tag_block<s_i343equipmentupgradenode> nodes_block;
		};
		static_assert(sizeof(s_i343equipmentupgradepath) == 120, "struct s_i343equipmentupgradepath is invalid size");

		struct s_i343equipmentupgradepoints
		{
			string_id persistence_key;
		};
		static_assert(sizeof(s_i343equipmentupgradepoints) == 4, "struct s_i343equipmentupgradepoints is invalid size");

		struct s_i343equipmentupgradeshieldupgrade
		{
			string_id persistence_key;
		};
		static_assert(sizeof(s_i343equipmentupgradeshieldupgrade) == 4, "struct s_i343equipmentupgradeshieldupgrade is invalid size");

		struct s_i343equipmentupgradecampaignupgrades
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343equipmentupgradepath> equipment_paths_block;
			c_typed_tag_block<s_i343equipmentupgradepoints> equipment_points_block;
			c_typed_tag_block<s_i343equipmentupgradeshieldupgrade> shield_upgrades_block;
			char generated_pad9564[4]; // padding
		};
		static_assert(sizeof(s_i343equipmentupgradecampaignupgrades) == 56, "struct s_i343equipmentupgradecampaignupgrades is invalid size");

		struct s_s_controller_mapping_definition
		{
			s_anytag_struct_definition anytag;

			/* Start/Back */

			c_enum<e_e_gamepad_button, short> jump;
			c_enum<e_e_gamepad_button, short> switch_weapon;
			c_enum<e_e_gamepad_button, short> switch_ability_0;
			c_enum<e_e_gamepad_button, short> switch_ability_1;
			c_enum<e_e_gamepad_button, short> switch_ability_2;
			c_enum<e_e_gamepad_button, short> switch_ability_3;
			c_enum<e_e_gamepad_button, short> switch_grenade;
			c_enum<e_e_gamepad_button, short> switch_grenade_prev;
			c_enum<e_e_gamepad_button, short> equipment_grenade_next;
			c_enum<e_e_gamepad_button, short> equipment_grenade_prev;
			c_enum<e_e_gamepad_button, short> contextual_action;
			c_enum<e_e_gamepad_button, short> melee_attack;
			c_enum<e_e_gamepad_button, short> equipment;
			c_enum<e_e_gamepad_button, short> throw_grenade;
			c_enum<e_e_gamepad_button, short> primary_fire;
			c_enum<e_e_gamepad_button, short> secondary_fire;
			c_enum<e_e_gamepad_button, short> crouch;
			c_enum<e_e_gamepad_button, short> zoom_zoom_scope;
			c_enum<e_e_gamepad_button, short> mobility;
			c_enum<e_e_gamepad_button, short> suit;
			c_enum<e_e_gamepad_button, short> toggle_quick_drop_hud;
			c_enum<e_e_gamepad_button, short> request_quick_drop_1;
			c_enum<e_e_gamepad_button, short> request_quick_drop_2;
			c_enum<e_e_gamepad_button, short> request_quick_drop_3;
			c_enum<e_e_gamepad_button, short> vehicle_ability_primary;
			c_enum<e_e_gamepad_button, short> vehicle_ability_secondary;
			c_enum<e_e_gamepad_button, short> vehicle_ability_tertiary;
			c_enum<e_e_gamepad_button, short> secondary_contextual_action;
			c_enum<e_e_gamepad_button, short> player_callout;
			char start[2]; // skip
			char back[2]; // skip
			c_enum<e_e_gamepad_button, short> accept;
			c_enum<e_e_gamepad_button, short> cancel;
			c_enum<e_e_gamepad_button, short> machinima_lower_weapon;
			c_enum<e_e_gamepad_button, short> machinima_camera_enable;
			c_enum<e_e_gamepad_button, short> machinima_camera_control;
			c_enum<e_e_gamepad_button, short> machinima_camera_debug;
			c_enum<e_e_gamepad_button, short> lift_editor;
			c_enum<e_e_gamepad_button, short> drop_editor;
			c_enum<e_e_gamepad_button, short> cinematic_skip;
			c_enum<e_e_gamepad_button, short> loadout_menu;
			c_enum<e_e_gamepad_button, short> sprint;
			c_enum<e_e_gamepad_button, short> skip_killcam;
			c_enum<e_e_gamepad_button, short> change_zoom_level;

			/* Button Labels */

			string_id button_preset_display_name;
			string_id button_preset_help_text;
			string_id unassigned;
			string_id dpad_up;
			string_id dpad_down;
			string_id dpad_left;
			string_id dpad_right;
			string_id start_button;
			string_id back_button;
			string_id left_thumb_stick;
			string_id right_thumb_stick;
			string_id button_a;
			string_id button_b;
			string_id button_x;
			string_id button_y;
			string_id left_bumper;
			string_id right_bumper;
			string_id left_trigger;
			string_id right_trigger;
			char generated_pad4ce3[4]; // padding
		};
		static_assert(sizeof(s_s_controller_mapping_definition) == 184, "struct s_s_controller_mapping_definition is invalid size");

		struct s_i343narrativeconversationtag
		{
			s_anytag_struct_definition anytag;
			c_flags<e_i343narrativeconversationflags, short, k_i343narrativeconversationflags_count> flags;
			c_enum<e_i343narrativeconversationtype, char> conversation_type;
			char generated_pad56e4[1]; // padding
			short relative_priority;
			short timeout_duration;
			short maximum_duration;
			char generated_pad70c5[2]; // padding
			real pre_convo_delay;
			real pre_convo_delay_max;
			real post_convo_delay;
			real post_convo_delay_max;
			char generated_padbd7a[4]; // padding
		};
		static_assert(sizeof(s_i343narrativeconversationtag) == 48, "struct s_i343narrativeconversationtag is invalid size");

		struct s_i343narrativeconversationtypeitem
		{
			c_enum<e_i343narrativeconversationtype, char> conversation_type;
			char generated_padc653[1]; // padding
			short priority;
			c_flags<e_i343narrativeconversationtypeflags, short, k_i343narrativeconversationtypeflags_count> flags;
		};
		static_assert(sizeof(s_i343narrativeconversationtypeitem) == 6, "struct s_i343narrativeconversationtypeitem is invalid size");

		struct s_i343narrativeconversationtypestag
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343narrativeconversationtypeitem> type_items_block;
			char generated_pad0e0f[4]; // padding
		};
		static_assert(sizeof(s_i343narrativeconversationtypestag) == 32, "struct s_i343narrativeconversationtypestag is invalid size");

		struct s_i343collectiblesquicktipdata
		{
			string_id title_id;
			string_id text_id;
		};
		static_assert(sizeof(s_i343collectiblesquicktipdata) == 8, "struct s_i343collectiblesquicktipdata is invalid size");

		struct s_i343collectiblesgameskullunlock
		{
			c_enum<e_i343collectiblesgameskull, char> game_skull;
		};
		static_assert(sizeof(s_i343collectiblesgameskullunlock) == 1, "struct s_i343collectiblesgameskullunlock is invalid size");

		struct s_i343collectiblesunlockedequipment
		{
			string_id frame_attachment_name;
			long input_slot;
		};
		static_assert(sizeof(s_i343collectiblesunlockedequipment) == 8, "struct s_i343collectiblesunlockedequipment is invalid size");

		struct s_i343collectiblesunlockedpoi
		{
			string_id intel_poi_key;
		};
		static_assert(sizeof(s_i343collectiblesunlockedpoi) == 4, "struct s_i343collectiblesunlockedpoi is invalid size");

		struct s_i343collectiblesgameplayunlocks
		{
			c_typed_tag_block<s_i343collectiblesgameskullunlock> skull_unlock_block;
			c_typed_tag_block<s_i343collectiblesunlockedequipment> equipment_unlock_block;
			c_typed_tag_block<s_i343collectiblesunlockedpoi> poi_unlock_block;
		};
		static_assert(sizeof(s_i343collectiblesgameplayunlocks) == 36, "struct s_i343collectiblesgameplayunlocks is invalid size");

		struct s_i343collectiblescollectibleentry
		{
			c_enum<e_i343collectiblescollectibletype, char> collectible_type;
			char generated_padea46[3]; // padding
			string_id persistence_key;
			short codex_list_entry_reference;
			char generated_pad36fb[2]; // padding
			c_typed_tag_block<s_i343collectiblesquicktipdata> quick_tip_override_block;
			c_typed_tag_block<s_i343collectiblesgameplayunlocks> gameplay_unlocks_block;
		};
		static_assert(sizeof(s_i343collectiblescollectibleentry) == 36, "struct s_i343collectiblescollectibleentry is invalid size");

		struct s_i343collectiblescodexpercategoryinfo
		{
			c_enum<e_i343collectiblescodexcategory, char> codex_category;
			char generated_pad598a[3]; // padding
			c_enum<e_i343collectiblescodexunlockkeytype, long> unlock_persistence_key_type;
			c_enum<e_i343collectiblescodexunlockfunctype, long> unlock_function;
			long unlock_compare_value;
			c_typed_tag_reference<BITMAP_TAG> sprite;
		};
		static_assert(sizeof(s_i343collectiblescodexpercategoryinfo) == 32, "struct s_i343collectiblescodexpercategoryinfo is invalid size");

		struct s_i343collectiblesfirstacquisitiondata
		{
			string_id first_acquisition_persistence_key;
			string_id tutorial_title_id;
			string_id tutorial_text_id;
		};
		static_assert(sizeof(s_i343collectiblesfirstacquisitiondata) == 12, "struct s_i343collectiblesfirstacquisitiondata is invalid size");

		struct s_i343collectiblessplashbannerdata
		{
			string_id banner_text_override;
		};
		static_assert(sizeof(s_i343collectiblessplashbannerdata) == 4, "struct s_i343collectiblessplashbannerdata is invalid size");

		struct s_i343collectiblesbackmenuscreentabindex
		{
			long back_menu_screen_tab_index;
		};
		static_assert(sizeof(s_i343collectiblesbackmenuscreentabindex) == 4, "struct s_i343collectiblesbackmenuscreentabindex is invalid size");

		struct s_i343collectiblespercollectipletypedata
		{
			c_enum<e_i343collectiblescollectibletype, char> collectible_type;
			char generated_pad2d83[3]; // padding

			/* Quick Tip Data */

			s_i343collectiblesquicktipdata defualt_tip_data;

			/* First Acquisition Data */

			s_i343collectiblesfirstacquisitiondata first_acquisition_data$2;

			/* Splash Banner Data */

			s_i343collectiblessplashbannerdata splash_banner_data$2;
			c_typed_tag_block<s_i343collectiblesbackmenuscreentabindex> back_menu_screen_tab_index_block;
		};
		static_assert(sizeof(s_i343collectiblespercollectipletypedata) == 40, "struct s_i343collectiblespercollectipletypedata is invalid size");

		struct s_i343collectiblescodexentrydesctext
		{
			string_id paragraph_id;
		};
		static_assert(sizeof(s_i343collectiblescodexentrydesctext) == 4, "struct s_i343collectiblescodexentrydesctext is invalid size");

		struct s_i343collectiblescodexentry
		{
			string_id title;
			string_id read_key_id;
			c_typed_tag_block<s_i343collectiblescodexentrydesctext> description_block;
			long sprite_index;
			c_static_string<256> audio_log_id_as_string;
			string_id audio_log_id;
			long display_order;
			c_enum<e_i343gameplaymenufaction, char> faction;
			char generated_padf1c7[3]; // padding
			// custom uiiteminfo
			s_interfaceuiiteminfo uiiteminfo;
			// custom value
		};
		static_assert(sizeof(s_i343collectiblescodexentry) == 372, "struct s_i343collectiblescodexentry is invalid size");

		struct s_i343collectiblescollectibleentryblockindex
		{
			short collectibleentryindex;
		};
		static_assert(sizeof(s_i343collectiblescollectibleentryblockindex) == 2, "struct s_i343collectiblescollectibleentryblockindex is invalid size");

		struct s_i343collectiblescodexentrylist
		{
			string_id name;
			c_enum<e_i343collectiblescodexcategory, char> codex_screen_category;
			char generated_padc51f[3]; // padding
			string_id codex_screen_category_name;
			c_typed_tag_block<s_i343collectiblescodexentry> codex_entries_block;
			c_typed_tag_block<s_i343collectiblescollectibleentryblockindex> unlock_collectibles_block;
			byte unlock_compare_value;
			c_enum<e_i343collectiblescodexunlock, char> unlockmethod;
			char generated_pad786a[2]; // padding
		};
		static_assert(sizeof(s_i343collectiblescodexentrylist) == 40, "struct s_i343collectiblescodexentrylist is invalid size");

		struct s_i343collectiblescollectiblesdefinition
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_i343collectiblescollectibleentry> collectible_entry_block;
			c_typed_tag_block<s_i343collectiblescodexpercategoryinfo> codex_category_info_block;
			c_typed_tag_block<s_i343collectiblespercollectipletypedata> per_collectible_data_block;
			long codex_screen_index;
			long upgrade_screen_index;
			c_typed_tag_block<s_i343collectiblescodexentrylist> codex_lists_block;
		};
		static_assert(sizeof(s_i343collectiblescollectiblesdefinition) == 72, "struct s_i343collectiblescollectiblesdefinition is invalid size");

		struct s_errorreportnodeindex
		{
			byte node_index;
		};
		static_assert(sizeof(s_errorreportnodeindex) == 1, "struct s_errorreportnodeindex is invalid size");

		struct s_errorreportnodeweight
		{
			real node_weight;
		};
		static_assert(sizeof(s_errorreportnodeweight) == 4, "struct s_errorreportnodeweight is invalid size");

		struct s_error_report_point
		{
			real_point3d position;
			s_errorreportnodeindex node_indices[4];
			s_errorreportnodeweight node_weights[4];
		};
		static_assert(sizeof(s_error_report_point) == 32, "struct s_error_report_point is invalid size");

		struct s_error_report_vertex
		{
			s_error_report_point point;
			argb_color color;
			real screen_size;
		};
		static_assert(sizeof(s_error_report_vertex) == 52, "struct s_error_report_vertex is invalid size");

		struct s_error_report_vector
		{
			s_error_report_point point;
			argb_color color;
			real_vector3d normal;
			real screen_length;
		};
		static_assert(sizeof(s_error_report_vector) == 64, "struct s_error_report_vector is invalid size");

		struct s_errorreportlinepoint
		{
			s_error_report_point point;
		};
		static_assert(sizeof(s_errorreportlinepoint) == 32, "struct s_errorreportlinepoint is invalid size");

		struct s_error_report_line
		{
			s_errorreportlinepoint points[2];
			argb_color color;
		};
		static_assert(sizeof(s_error_report_line) == 80, "struct s_error_report_line is invalid size");

		struct s_errorreporttrianglepoint
		{
			s_error_report_point point;
		};
		static_assert(sizeof(s_errorreporttrianglepoint) == 32, "struct s_errorreporttrianglepoint is invalid size");

		struct s_error_report_triangle
		{
			s_errorreporttrianglepoint points[3];
			argb_color color;
		};
		static_assert(sizeof(s_error_report_triangle) == 112, "struct s_error_report_triangle is invalid size");

		struct s_errorreportquadpoint
		{
			s_error_report_point point;
		};
		static_assert(sizeof(s_errorreportquadpoint) == 32, "struct s_errorreportquadpoint is invalid size");

		struct s_error_report_quad
		{
			s_errorreportquadpoint points[4];
			argb_color color;
		};
		static_assert(sizeof(s_error_report_quad) == 144, "struct s_error_report_quad is invalid size");

		struct s_error_report_comment
		{
			s_tag_data text;
			s_error_report_point point;
			argb_color color;
		};
		static_assert(sizeof(s_error_report_comment) == 68, "struct s_error_report_comment is invalid size");

		struct s_error_report
		{
			c_enum<e_errorreporttypes, char> type;
			c_enum<e_e_error_report_source, char> source;
			c_flags<e_errorreportflags, short, k_errorreportflags_count> flags;
			s_tag_data text;
			long source_identifier;
			c_static_string<32> source_filename;
			long source_line_number;
			c_typed_tag_block<s_error_report_vertex> vertices_block;
			c_typed_tag_block<s_error_report_vector> vectors_block;
			c_typed_tag_block<s_error_report_line> lines_block;
			c_typed_tag_block<s_error_report_triangle> triangles_block;
			c_typed_tag_block<s_error_report_quad> quads_block;
			c_typed_tag_block<s_error_report_comment> comments_block;
			long report_key;
			long node_index;
			real_bounds bounds_x;
			real_bounds bounds_y;
			real_bounds bounds_z;
			argb_color color;
		};
		static_assert(sizeof(s_error_report) == 184, "struct s_error_report is invalid size");

		struct s_error_report_category
		{
			c_static_string<256> name;
			c_enum<e_errorreporttypes, char> report_type;
			char generated_padf276[1]; // padding
			c_flags<e_errorreportflags, short, k_errorreportflags_count> flags;
			word runtime_generation_flags;
			char generated_pad3f2b[2]; // padding
			long runtime_something;
			c_typed_tag_block<s_error_report> reports_block;
		};
		static_assert(sizeof(s_error_report_category) == 280, "struct s_error_report_category is invalid size");

		struct s_collision_model_material
		{
			string_id name;
		};
		static_assert(sizeof(s_collision_model_material) == 4, "struct s_collision_model_material is invalid size");

		struct s_bsp3d_node
		{
			long long node_data_designator;
		};
		static_assert(sizeof(s_bsp3d_node) == 8, "struct s_bsp3d_node is invalid size");

		struct s_s_bsp3d_kd_super_node
		{
			real plane_0;
			real plane_1;
			real plane_2;
			real plane_3;
			real plane_4;
			real plane_5;
			real plane_6;
			real plane_7;
			real plane_8;
			real plane_9;
			real plane10;
			real plane11;
			real plane12;
			real plane13;
			real plane14;
			long plane_dimensions;
			long child_index_0;
			long child_index_1;
			long child_index_2;
			long child_index_3;
			long child_index_4;
			long child_index_5;
			long child_index_6;
			long child_index_7;
			long child_index_8;
			long child_index_9;
			long child_index10;
			long child_index11;
			long child_index12;
			long child_index13;
			long child_index14;
			long child_index15;
		};
		static_assert(sizeof(s_s_bsp3d_kd_super_node) == 128, "struct s_s_bsp3d_kd_super_node is invalid size");

		struct s_planesparams
		{
			real_plane3d plane;
		};
		static_assert(sizeof(s_planesparams) == 16, "struct s_planesparams is invalid size");

		struct s_collision_leaf
		{
			c_flags<e_leafflags, char, k_leafflags_count> flags;
			char generated_padd325[1]; // padding
			word bsp2d_reference_count;
			dword first_bsp2d_reference;
		};
		static_assert(sizeof(s_collision_leaf) == 8, "struct s_collision_leaf is invalid size");

		struct s_bsp2d_reference
		{
			short plane;
			short bsp2d_node;
		};
		static_assert(sizeof(s_bsp2d_reference) == 4, "struct s_bsp2d_reference is invalid size");

		struct s_bsp2d_node
		{
			real_plane2d plane;
			short left_child;
			short right_child;
		};
		static_assert(sizeof(s_bsp2d_node) == 16, "struct s_bsp2d_node is invalid size");

		struct s_collision_surface
		{
			word plane_index;
			word first_edge;
			short material;
			c_flags<e_surfaceflags, char, k_surfaceflags_count> flags;
			byte best_plane_calculation_vertex_index_;
		};
		static_assert(sizeof(s_collision_surface) == 8, "struct s_collision_surface is invalid size");

		struct s_collision_edge
		{
			word start_vertex;
			word end_vertex;
			word forward_edge;
			word reverse_edge;
			word left_surface;
			word right_surface;
		};
		static_assert(sizeof(s_collision_edge) == 12, "struct s_collision_edge is invalid size");

		struct s_collision_vertex
		{
			real_point3d point;
			word first_edge;
			short sink;
		};
		static_assert(sizeof(s_collision_vertex) == 16, "struct s_collision_vertex is invalid size");

		struct s_collision_bsp
		{
			c_typed_tag_block<s_bsp3d_node> bsp3d_nodes_block;
			c_typed_tag_block<s_s_bsp3d_kd_super_node> bsp3d_supernodes_block;
			c_typed_tag_block<s_planesparams> planes_block;
			c_typed_tag_block<s_collision_leaf> leaves_block;
			c_typed_tag_block<s_bsp2d_reference> bsp2d_references_block;
			c_typed_tag_block<s_bsp2d_node> bsp2d_nodes_block;
			c_typed_tag_block<s_collision_surface> surfaces_block;
			c_typed_tag_block<s_collision_edge> edges_block;
			c_typed_tag_block<s_collision_vertex> vertices_block;
		};
		static_assert(sizeof(s_collision_bsp) == 108, "struct s_collision_bsp is invalid size");

		struct s_collision_model_bsp
		{
			short node_index;
			char generated_pad8a4c[2]; // padding
			s_collision_bsp bsp;
		};
		static_assert(sizeof(s_collision_model_bsp) == 112, "struct s_collision_model_bsp is invalid size");

		struct s_moppcodedatadefinitionparams
		{
			byte mopp_data;
		};
		static_assert(sizeof(s_moppcodedatadefinitionparams) == 1, "struct s_moppcodedatadefinitionparams is invalid size");

		struct s_s_havok_mopp_code_definition
		{
			long long field_pointer_skip;
			long long property_bag_skip;
			short size;
			short count;
			char pad0[12]; // padding
			real vi;
			real vj;
			real vk;
			real vw;
			char pad64_0[4]; // padding
			long long m_data_pointer;
			long int_m_size;
			long int_m_capacityandflags;
			char int8_m_buildtype;
			char pad1_0[1]; // padding
			char pad1_1[2]; // padding
			char pad1_2[4]; // padding
			char pad64_1[4]; // padding
			// custom value
			c_typed_tag_block<s_moppcodedatadefinitionparams> mopp_data_block__block;
			// custom value
			char mopp_build_type;
			char pad2_0[1]; // padding
			char pad2_1[2]; // padding
			char generated_pad27be[8]; // padding
		};
		static_assert(sizeof(s_s_havok_mopp_code_definition) == 104, "struct s_s_havok_mopp_code_definition is invalid size");

		struct s_collision_model_permutation
		{
			string_id name;
			short resourcebspoffset;
			short resourcebspcount;
			c_typed_tag_block<s_collision_model_bsp> bsps_block;
			c_typed_tag_block<s_s_havok_mopp_code_definition> mopp_codes_block;
		};
		static_assert(sizeof(s_collision_model_permutation) == 32, "struct s_collision_model_permutation is invalid size");

		struct s_collision_model_region
		{
			string_id name;
			c_typed_tag_block<s_collision_model_permutation> permutations_block;
		};
		static_assert(sizeof(s_collision_model_region) == 16, "struct s_collision_model_region is invalid size");

		struct s_collision_model_pathfinding_sphere
		{
			short node;
			c_flags<e_pathfindingsphereflags, short, k_pathfindingsphereflags_count> flags;
			real_point3d center;
			real radius;
		};
		static_assert(sizeof(s_collision_model_pathfinding_sphere) == 20, "struct s_collision_model_pathfinding_sphere is invalid size");

		struct s_collision_model_node
		{
			string_id name;
			c_flags<e_collisionnodeflags, short, k_collisionnodeflags_count> flags;
			short parent_node;
			short next_sibling_node;
			short first_child_node;
		};
		static_assert(sizeof(s_collision_model_node) == 12, "struct s_collision_model_node is invalid size");

		struct s_collision_model_definition
		{
			s_anytag_struct_definition anytag;
			long import_info_checksum;
			c_typed_tag_block<s_error_report_category> errors_block;
			c_flags<e_collisionmodelflags, long, k_collisionmodelflags_count> flags;
			c_typed_tag_block<s_collision_model_material> materials_block;
			c_typed_tag_block<s_collision_model_region> regions_block;
			c_typed_tag_block<s_collision_model_region> cookie_cutters_block;
			c_typed_tag_block<s_collision_model_pathfinding_sphere> pathfinding_spheres_block;
			c_typed_tag_block<s_collision_model_node> nodes_block;
			s_tag_resource regions_resource;
			s_nodeflagstoragearray flags_for_nodes_driving_collision_geo[32];
		};
		static_assert(sizeof(s_collision_model_definition) == 232, "struct s_collision_model_definition is invalid size");

		struct s_color_table_color
		{
			c_static_string<32> name;
			argb_color color;
		};
		static_assert(sizeof(s_color_table_color) == 48, "struct s_color_table_color is invalid size");

		struct s_color_table
		{
			s_anytag_struct_definition anytag;
			c_typed_tag_block<s_color_table_color> colors_block;
			char generated_pad9dec[4]; // padding
		};
		static_assert(sizeof(s_color_table) == 32, "struct s_color_table is invalid size");

		struct s_authoredlightprobelights
		{
			// custom authored_light_probe
			// custom direction_1
			real direction_1;
			// custom front_back_1
			real front_back_1;
			rgb_color direct_color_1;
			// custom direct_intensity_1
			real direct_intensity_1;
			// custom direction_2
			real direction_2;
			// custom front_back_2
			real front_back_2;
			rgb_color direct_color_2;
			// custom direct_intensity_2
			real direct_intensity_2;
			rgb_color ambient_color;
			// custom ambient_intensity
			real ambient_intensity;
			rgb_color sun_color;
			// custom sun_intensity
			real sun_intensity;
			rgb_color cubemap_scale_color;
			// custom cubemap_scale_intensity
			real cubemap_scale_intensity;
			// custom authored_light_probe_intensity_scale
			real authored_light_probe_intensity_scale;
			// custom generated_air_probe_intensity_scale
			real generated_air_probe_intensity_scale;
		};
		static_assert(sizeof(s_authoredlightprobelights) == 104, "struct s_authoredlightprobelights is invalid size");

		struct s_rgblightprobe
		{
			real sh_data;
		};
		static_assert(sizeof(s_rgblightprobe) == 4, "struct s_rgblightprobe is invalid size");

		struct s_authoredlightprobe
		{
			c_typed_tag_block<s_authoredlightprobelights> lights_block;
			// custom generated_air_probe_intensity_scale
			real generated_air_probe_intensity_scale;
			s_rgblightprobe raw_sh_data[27];
			s_rgblightprobe per_frame_sh_data[27];
			real_point3d sun_color;
			real_point3d cubemap_scale;

			/* value */

			c_flags<e_authoredlightprobeflags, short, k_authoredlightprobeflags_count> flags;
			char generated_padb28a[2]; // padding
		};
		static_assert(sizeof(s_authoredlightprobe) == 260, "struct s_authoredlightprobe is invalid size");

		struct s_customobjectlighting
		{

			/* Character Lighting */

			c_typed_tag_block<s_authoredlightprobe> authored_light_probes_block;
			c_enum<e_lightboolean, char> is_camera_space;
			c_flags<e_customobjectlightingflags, char, k_customobjectlightingflags_count> flags;
			char generated_pad79fe[2]; // padding
			c_typed_tag_reference<BITMAP_TAG> cubemap_override;
		};
		static_assert(sizeof(s_customobjectlighting) == 32, "struct s_customobjectlighting is invalid size");

		struct s_customobjectlightingtag
		{
			s_anytag_struct_definition anytag;
			s_customobjectlighting probe;
			char generated_pad8a18[4]; // padding
		};
		static_assert(sizeof(s_customobjectlightingtag) == 52, "struct s_customobjectlightingtag is invalid size");

		struct s_composerscenario
		{
			c_typed_tag_reference<LEVEL_TAG> scenario;
		};
		static_assert(sizeof(s_composerscenario) == 16, "struct s_composerscenario is invalid size");

		struct s_composerbink
		{
			c_flags<e_composerbinkflags, long, k_composerbinkflags_count> flags;
			c_typed_tag_reference<BINK_TAG> bink_movie;
			c_static_string<32> bink_movie_on_disc;
		};
		static_assert(sizeof(s_composerbink) == 52, "struct s_composerbink is invalid size");

		struct s_composerscenereference
		{
			c_typed_tag_reference<COMPOSITION_SCENE_TAG> scene;
		};
		static_assert(sizeof(s_composerscenereference) == 16, "struct s_composerscenereference is invalid size");

		struct s_stringidtoshortnamemappingid
		{
			string_id id;
		};
		static_assert(sizeof(s_stringidtoshortnamemappingid) == 4, "struct s_stringidtoshortnamemappingid is invalid size");

		struct s_stringidtoshortnamemappingindex
		{
			long string_index;
		};
		static_assert(sizeof(s_stringidtoshortnamemappingindex) == 4, "struct s_stringidtoshortnamemappingindex is invalid size");

		struct s_stringidtoshortnamemapping
		{
			c_typed_tag_block<s_stringidtoshortnamemappingid> ids_block;
			c_typed_tag_block<s_stringidtoshortnamemappingindex> string_indices_block;
			s_tag_data string_table;
		};
		static_assert(sizeof(s_stringidtoshortnamemapping) == 44, "struct s_stringidtoshortnamemapping is invalid size");

		struct s_soundbankdefinitionreference
		{
			c_typed_tag_reference<SOUNDBANK_TAG> soundbank;
		};
		static_assert(sizeof(s_soundbankdefinitionreference) == 16, "struct s_soundbankdefinitionreference is invalid size");

		struct s_composerfirsttofirsttransition
		{
			string_id preset;
			c_flags<e_composercagetransitionoverrideflags, short, k_composercagetransitionoverrideflags_count> override_flags;
			c_flags<e_composercagetransitionflags, char, k_composercagetransitionflags_count> flags;
			char generated_pad1960[1]; // padding
			real close_enough_distance_min;
			real close_enough_distance_max;
			angle close_enough_angle_min;
			angle close_enough_angle_max;
			real linear_velocity_min;
			real linear_velocity_max;
			angle angular_velocity_min;
			angle angular_velocity_max;
			real lower_weapon_time;
			real raise_weapon_time;
			real hide_player_time;
			c_enum<e_i343curvecurvebuiltin, char> move_to_slide_curve;
			char generated_pad3341[3]; // padding
			real move_to_time;
			real lower_weapon_delay_override;
			real raise_weapon_delay_override;
			real hud_off_delay_override;
			real hud_on_delay_override;
			real move_to_delay_override;
		};
		static_assert(sizeof(s_composerfirsttofirsttransition) == 80, "struct s_composerfirsttofirsttransition is invalid size");

		struct s_composerfirsttothirdtransition
		{
			c_flags<e_composercagetransitionflags, char, k_composercagetransitionflags_count> flags;
			char generated_pad1bd9[3]; // padding
			real close_enough_distance;
			angle close_enough_angle;
			angle angular_velocity;
			real lower_weapon_time;
			real raise_weapon_time;
			real hide_player_time;
			s_levelobjectreference destination;
		};
		static_assert(sizeof(s_composerfirsttothirdtransition) == 44, "struct s_composerfirsttothirdtransition is invalid size");

		struct s_compositiondefinition
		{
			s_anytag_struct_definition anytag;
			// custom scenario
			s_composerscenario scenario;
			// custom value
			string_id name;
			c_flags<e_composerflags, long, k_composerflags_count> flags;
			real animation_blend_in;
			real cage_camera_blend_in_time;
			c_enum<e_i343curvecurvebuiltin, char> cage_camera_blend_in_curve;
			char generated_pada339[3]; // padding
			string_id cage_camera_blend_in_variant;
			real cage_camera_blend_out_time;
			c_enum<e_i343curvecurvebuiltin, char> cage_camera_blend_out_curve;
			char generated_pad8958[3]; // padding
			string_id cage_camera_blend_out_variant;
			real cinematic_lod_scale;
			string_id lighting_variant;
